[
  {
    "title": "The Last Viking: The Life of Roald Amundsen, Conqueror of the South Pole",
    "author": "Stephen Bown",
    "ratingCount": "798 ratings",
    "ratingStarts": "4.5 out of 5 stars",
    "synopsis": "This “fascinating biography” of the Norwegian explorer who beat Robert Scott to the South Pole is “intelligent and often thrilling” (London Sunday Times).The most feted explorer of his generation, Roald Amundsen counted the discovery of the Northwest Passage, in 1905, as well as the North Pole amongst his greatest achievements. His revolutionary approach to technology transcends polar and nautical significance. However, until now, his story has rarely featured as more than a footnote to Scott’s tragic failure.Reviled for defeating Scott but worshipped by his men, Amundsen was pursued by women and creditors throughout his life before disappearing on a mission to rescue an Italian explorer attempting to claim the North Pole for Mussolini. The Last Viking is the life of a visionary and a showman, who brought the era of Shackleton to an end, put the newly independent Norway on the map, and was the twentieth century’s brightest trailblazing explorer.",
    "numberOfPages": "385",
    "reviews": [
      {
        "userName": "Miss Karenina",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Generally, in my day to day life, I feel that I was born too soon... I know that I would make an excellent planetary colonist. But I am also a diligent student of the lives and accomplishments of ground - breaking mountaineers and arctic explorers.\n\nThis excellent work brings the details of Amundsen's \"firsts\" to light. He was, without doubt, one of, if not THE, greatest explorers on the planet. Ever. Things that you'd think would be elementary: proper planning, using skis on snow/ice at the poles, learning from arctic inhabitants... he basically pioneered.\n\nDuring my read, I found myself wondering... if Cook and Peary's claims on the North Pole have been discredited, then who actually DID get there first? Gee. Guess who!\n\nAlthough details about his personal life rounded out his character, to me these are secondary points that did nothing to sway my admiration for the man. He tended to keep his personal life separate from his professional life, and (especially in today's world where people tend to think you want to know all the minutiae of their business) I like that. His personal life was generally kept that way, which to me is an admirable trait.\n\nThe language barrier has been instrumental in keeping Amundsen's accomplishments from being more widely known (as explained in the book), so I for one am very glad to see his story told in English. I was late finding it (published in 2012)... don't wait any longer! Definitely recommended.",
        "stars": "5.0"
      },
      {
        "userName": "Ron DiGiovanni",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Notice I use the title \"most likely.\" This is only for the fact that I dropped this pile of rubbish after reading about a third of it.\n\nHuntford wasn't bad enough with his relentless comparison of apples and oranges (Scott vs. Amundsen). We now have a fresh new effort in whitewashing the bizarre character of the last barbarian.\n\nRoald Amundsen was unquestionably the greatest of the polar athletes. Unfortunately, he also had the type of self-destruct personality that makes this brand of rehabilitative writing necessary.\n\nWhen I got about 25% through this book I started getting the feeling that this was little more than a cleanup job for old Roald. At that moment I decided that I would read ahead to the one true test of this author's intent - how he handles the case of Amundsen and Nobile.\n\nOH, MY GOD, what a pack of lies!\n\nWhen I read the chapter title - \"The Dirigible And The Fascist,\" at first I thought it was some sort of joke or sarcastic theme. But then, as I read on, I was not just disappointed that I had wasted 12 bucks on this crap, I was totally appalled.\n\nTo accuse Umberto Nobile of being a Fascist has less merit than calling Mother Theresa a Nazi. If you read anything about the life of Nobile, by any author, you will quickly come to realize that Mussolini and his Blackshirts made Nobile's life pure hell from day one of their tyranny. This is why the Americans embraced him lovingly. This is why the Russians went through such great expense and risk (both personal and political) to rescue him and his crew with their best icebreaker. The Russians admired little Umberto because they knew he was no Fascist.\n\nMost Nobile historians will either admit or at least intimate that the Fascists would have preferred to have Nobile die on the ice. And this wasn't just after the crash of the Italia. High ranking Blackshirts like Italo Balbo and Umberto's Fascist-favored competitors in the Italian aviation industry were praying that he would simply disappear up north in the Norge.\n\nWhat this author needs to realize is that you don't have to scrub a man's back to reveal new and interesting aspects of his life. I love reading new and interesting facts about Adolph Hitler. The story of this demon has always intrigued me. But if you twist the truth so as to favor your subject, you'll only discredit yourself in the act.\n\nOf course, I'm making no comparisons here, but if you really want to understand Amundsen, READ HIS BOOKS. In his 1912, The South Pole (free with Kindle) he reveals his inner self with almost as much detail as our glorious Fuhrer did in Mein Kampf. He explains how he and his men killed a really cool Emperor Penguin just for s***s and giggles, clubbed five little puppies to death with the back of an axe, and drooled as they pondered the dog meat waiting for them at the end of a long trek. By the way, just so you know, according to Roald, Man's best friend is as tasty and delicious as any good cut of beef - and THAT was the actual quote.\n\nThe shame of it all is that this book was obviously well researched. The details of the Belgica voyage are one example. I have always harbored the suspicion that Amundsen might have been gay, in the closet, resentful of it, and just like Shakelton's brother, used female relations as a cover. Evidently, this was not the case, and although this author was willing to deal with this mystery of his life, I see no point in reading further for these insights, simply because I can no longer trust what I read.\n\nBut now let's go all the way back to the title, to set the record straight. Twice in my limited reading, I noticed that the author uses the phrase \"The Last Viking\" in suggesting that this was some sort of title that Amundsen earned for his stoic courage and savage determination to succeed. Rot! HIS MOTHER BESTOWED THIS TITLE UPON HIM! She used to say, \"Rrrrroald! You are the last of the Vikings.\" And this was most likely when he was behaving like the ingrate that he was. If this author mentions this somewhere where I didn't read, well, that's as much credit as I can give him.\n\nLet's allow this hyperbolic garbage to sink down into the ice where it belongs.\n\nRon DiGiovanni\nEaston, PA",
        "stars": "1.0"
      },
      {
        "userName": "Valerie Barber",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Very thorough",
        "stars": "4.0"
      },
      {
        "userName": "Miss Weezie",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I'm thrilled to have found this book as I'm doing research on Amundsen for a lecture I'll be presenting to about 100 people aboard two eco-tourism trips this winter to the Falkland Islands, South Georgia and the Antarctic Peninsula.\nI've been reading several different books but this is the one I've chosen to take with me for reference.\nIt's my 9th year as a kayak guide and lecturer in Antarctica and I've found in general our passengers get a bit overwhelmed with stories and lectures about Shackleton and Scott so I believe this will satisfy and/or open new territory and understanding.\nIt piqued my interest as well, both my parents were Norwegian, born about the time of Amundsen's passing. I believe not only was he a great leader but possessed keen insight into people's characters, created good working teams and, through a number of positive factors, achieved great things.\nOne has to admire his tireless and impeccable preparations, he never lost a man on any of his expeditions due to careful planning and execution of gear (furs), food (fresh meat) and methods of travel (skis and dog sledges).\nI choose not to compare his South Pole exploration with Scott's too much, I'd found myself growing weary of others' scathing critiques.\nI've chosen instead to stick only to Amundsen's story, it's so compelling and stands very well on its own.\nI've found this book enlightening and refreshing in that the author has stuck with his main character and not fallen into the comparison trap.\nAmundsen's story is detailed with enough of his own research we know he'd done his homework.\nTo do anything less might spell disaster, which others had suffered.\nAs you've said there had to be more behind the man than his stoic public persona, the image he fed to the world.\nThe private image can generally be more interesting than the public one, as this book shows.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B009JXIY9I\nPublisher ‏ : ‎ Aurum (October 20, 2012)\nPublication date ‏ : ‎ October 20, 2012\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 7657 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 385 pages"
  },
  {
    "title": "Tent for Seven: A Camping Adventure Gone South Out West",
    "author": "Marty Ohlhaut",
    "ratingCount": "9 ratings",
    "ratingStarts": "5.0 out of 5 stars",
    "synopsis": "\"A factual account that reads like a breathtaking thriller. . . . Highly recommend.\"—Readers' Favorite (5 Stars)Marty Ohlhaut loved the great outdoors, and he loved his family, but this time, the combination proved disastrous.Cooped up inside due to long work hours, Marty was excited about taking off with his wife and five children for the beautiful Canadian Rockies. Aware that this could be their last camping trip together, he wanted to make it extra memorable.Little did he know how memorable it would be. From a massive heat wave and tainted water to encounters with aggressive red ants and formidable bears, they experienced one problem after another. Then tragedy struck, forcing Marty to face the terrifying possibility of losing a loved one. With the help of mysterious strangers in one of the world's most awe-inspiring locations, he fought to keep his family alive and his sanity intact.Now, three decades later, he joins forces with his daughter Grace Ly to recount the gripping tale of that ill-fated vacation. Written with candor and wit reminiscent of Bill Bryson, Tent for Seven vividly captures both the grandeur and the dangers of the wilderness as Marty learns just how much his wife and children mean to him—and how fragile life can be.",
    "numberOfPages": "276",
    "reviews": [
      {
        "userName": "Sheryl T Smith",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I am not a fast reader but read it in record time.The chapters are packed with this Family's adventures that are often too unreal to believe at times. The descriptions of the places they went, the close calls, & life threatening events made you feel like you were there in person & pretty scary at times .\nThe humorous accounts had me laughing out loud and other times I was like What Were You thinking ??\nI highly recommend A Tent For Seven , you will not be disappointed .",
        "stars": "5.0"
      },
      {
        "userName": "John C.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Tent for Seven is a folksy true account of a family vacation filled with adventure, drama, and a touch of humor. The main story and vignettes make for a captivating read. I had trouble leaving it, and finished the book within a day of receiving it. I highly recommend it!",
        "stars": "5.0"
      },
      {
        "userName": "Ginny H.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "“A Tent for Seven” is a wonderful entertainingly written true story of Marty and his family with an abundance of adventure and love. Many scenes are absolutely hilarious, I laughed out loud often. With its quick pace it is almost impossible to put down.\n\nThe style holds your interest as the author juxtaposes this family trip with adventures of his own travels 20 years earlier as a single college graduate. He reflects on the intense strain but also the immense joy which comes from sharing his love of camping with his family. I found it to be insightful and moving.\n\n“Tent” does what we hope all good books will do: transport us from our day to day lives to fun and excitement without leaving our easy chairs. But it goes further. It invites the readers to reflect on their own adventures and their handling of adversity while recognizing the importance of family and friends in their own lives.\n\nAnd it specially reminds us to acknowledge the kindness of strangers. Perhaps if we reflect carefully, we too might realize we’ve crossed paths with an “angel” or two in our own lives.",
        "stars": "5.0"
      },
      {
        "userName": "L. Gold",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Immerse yourself in a heartwarming camping journey that defies convention. Through trials and triumphs, the Ohlhaut family embarks on an unforgettable adventure, showcasing their resilience and deep appreciation for the natural world. The author's vivid descriptions and well-timed humor infuse the prose with an infectious sense of adventure, allowing readers to feel the thrill or trepidation of each moment. I was moved on several occasions by the compassion and kindness shown by strangers who generously extend a helping hand when needed most. Ultimately, this enchanting tale serves as a poignant reminder of the enduring power of family bonds, forged through shared experiences, that resonate long after the final page. Enjoy.",
        "stars": "5.0"
      },
      {
        "userName": "Amanda Schreier",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This was a really fun read! “Tent for Seven” is both really funny (I laughed out loud several times) and heartwarming. If you like adventure books, interesting travel escapades, and humorous, smart storytelling, you’ll love this book! What makes it extra special, beyond just a crazy adventure, is the heartwarming journey the main character, Marty, goes on within himself. I don’t want to give anything away, but this book has that spark of soul that leaves you thinking about it long after. Really enjoyed it!",
        "stars": "5.0"
      },
      {
        "userName": "Joe Maly",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A compelling story describing a charming family of seven’s venture into the northwestern wilderness for a two-week vacation trip. Expecting a tedious trek through the woods, the tale is instead a memorable account that brings the reader into the family circle. Flashbacks to a trip out west with college buddies years ago provide a fun counterpoint to the family adventure.",
        "stars": "5.0"
      },
      {
        "userName": "Amazon customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Read in one sitting. This book is a fun, quick read. The writing is hilarious and entertaining. I loved the accompanying pictures and the pie reciepe! I've never had saskatoon pie, but after reading the pie chapter I feel the need to go find some. I feel bad for this family and all they went through, but, at the end of the day, it made for a great story!",
        "stars": "5.0"
      },
      {
        "userName": "Anne R",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "By turns funny, scary, touching, and thrilling, this book is a true story of a family looking to have an adventure. And have one they did! Quick, easy read, with well drawn characters and descriptive writing that put you right into the story and the heart of this family.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0C2PMP9S5\nPublisher ‏ : ‎ Sandra Jonas Publishing House (August 15, 2023)\nPublication date ‏ : ‎ August 15, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 5759 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 276 pages"
  },
  {
    "title": "Into the Abyss: An Extraordinary True Story",
    "author": "Carol Shaben",
    "ratingCount": "5,868 ratings",
    "ratingStarts": "4.3 out of 5 stars",
    "synopsis": "Read the \"gripping and emotionally affecting\" book where four men survived the plane crash. The pilot. A politician. A cop... and the criminal he was shackled to (Washington Post).On an icy night in October 1984, a commuter plane carrying nine passengers crashed in the remote wilderness of northern Alberta, killing six people. Four survived: the rookie pilot, a prominent politician, a cop, and the criminal he was escorting to face charges. Despite the poor weather, Erik Vogel, the 24-year-old pilot, was under intense pressure to fly. Larry Shaben, the author's father and Canada's first Muslim Cabinet Minister, was commuting home after a busy week at the Alberta Legislature. Constable Scott Deschamps was escorting Paul Archambault, a drifter wanted on an outstanding warrant. Against regulations, Archambault's handcuffs were removed-a decision that would profoundly impact the men's survival. As the men fight through the night to stay alive, the dividing lines of power, wealth, and status are erased, and each man is forced to confront the precious and limited nature of his existence.",
    "numberOfPages": "338",
    "reviews": [
      {
        "userName": "monya sigler",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I enjoyed he authors writing style as she brings to life the harrowing circumstances around the crash and rescue of a Canadian bush flight. Satisfyingly, she also takes the reader through the poignant impact of the crash of the lives of the survivors. I am pleased to have experienced this tale!",
        "stars": "4.0"
      },
      {
        "userName": "Tiffany Crosby",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I had to finish this book the moment I started reading it. I was captivated by the quest for survival against all odds and for the human quest for meaning in the midst of trauma. We can learn so much about the human spirit by survivors of tragedy. It's natural to wonder what if and think about those who missed the flight because of an unplanned happening and those who made the flight unexpectedly. Much like 9/11 and those who did not make it into the office that day for one reason or another.",
        "stars": "5.0"
      },
      {
        "userName": "Booklover",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The true story of four men, strangers to one another, who survived a plane crash and how the trauma affected each man's life.",
        "stars": "4.0"
      },
      {
        "userName": "Lafmore",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This isn't a grand survival adventure nor a sensationalized version of events. It is an exploration of how this tragedy occurred and how the experience shaped the lives of the survivors. A great deal dealt with the safety issues and how this accident affected the future of aviation in Canada. It also explores the physical, emotional and spiritual repercussions for the survivors. It is a well written, interesting story, although I felt the end got a little unfocused and rambling.",
        "stars": "4.0"
      },
      {
        "userName": "lovesroses",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "As no other secular book has done in my 70 years, this book was very profoundly moving. It really did make me stop several times while reading, and think, and search through the deepest part of me, on so many levels with such introspection.\n\nI go through books like candy, and I know that none have affected me as deeply as this book and the relevant experiences told, were, Profound.",
        "stars": "5.0"
      },
      {
        "userName": "Robert J. Ruttenberg",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I enjoyed this book and actually felt the pain the 4 survivors endured. She really captured the essence of the crash",
        "stars": "4.0"
      },
      {
        "userName": "KenO",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Having been involved in aviation as an Air Force Loadmaster, it's much easier to comprehend the magnitude of this story. Though never in a crash, there were some close calls that ended with a sigh of relief. Sitting in the jump seat on an instrument approach and watching the altimeter going down and nothing in sight until the high intensity approach lights brightened up the fog prior to seeing a runway. Trusting the instruments and hoping they where accurate.\n\nDead reckoning is a dubious term with a double meaning. One is good and one is bad. Carol has done an outstanding job of bringing the worst nightmare of a pilot into a words that puts you into the left seat and your \"driving\". The reader can almost feel the horror of a crash and its aftermath. The healing process and grief weighs heavy on your shoulders as you read on. A break in the clouds hanging over Eric's head allows a ray of light break through at the end. It was a long, hard road!",
        "stars": "5.0"
      },
      {
        "userName": "Headly",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "In this true story you will become acquainted with the four survivors of this small commuters airline. You will read of the horror of survival in snow covered woods to a reunion some 10 years later.\n\nThe story dives deep into the lives , both before and after the crash, and follows them through the tough times and slow healing and through relationships both lost and found. Of you've ever wanted to be a bush pilot, or know someone who does...then this is a must read.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B009CJK4GA\nPublisher ‏ : ‎ Grand Central Publishing (May 21, 2013)\nPublication date ‏ : ‎ May 21, 2013\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 18082 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 338 pages"
  },
  {
    "title": "438 Days: An Extraordinary True Story of Survival at Sea",
    "author": "Jonathan Franklin",
    "ratingCount": "6,444 ratings",
    "ratingStarts": "4.7 out of 5 stars",
    "synopsis": "Declared “the best survival book in a decade” by Outside Magazine, 438 Days is the true story of the man who survived fourteen months in a small boat drifting seven thousand miles across the Pacific Ocean.On November 17, 2012, two men left the coast of Mexico for a weekend fishing trip in the open Pacific. That night, a violent storm ambushed them as they were fishing eighty miles offshore. As gale force winds and ten-foot waves pummeled their small, open boat from all sides and nearly capsized them, captain Salvador Alvarenga and his crewmate cut away a two-mile-long fishing line and began a desperate dash through crashing waves as they sought the safety of port.  Fourteen months later, on January 30, 2014, Alvarenga, now a hairy, wild-bearded and half-mad castaway, washed ashore on a nearly deserted island on the far side of the Pacific. He could barely speak and was unable to walk. He claimed to have drifted from Mexico, a journey of some seven thousand miles.  A “gripping saga,” (Daily Mail), 438 Days is the first-ever account of one of the most amazing survival stories in modern times. Based on dozens of hours of exclusive interviews with Alvarenga, his colleagues, search-and-rescue officials, the remote islanders who found him, and the medical team that saved his life, 438 Days is not only “an intense, immensely absorbing read” (Booklist) but an unforgettable study of the resilience, will, ingenuity and determination required for one man to survive more than a year lost and adrift at sea.",
    "numberOfPages": "289",
    "reviews": [
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "As remarkable as this story of courage in the face of deprivation is, the real story is about the challenge of the new realities of living in a changing environment where profits trump all other considerations. Millions of poor people around the world struggle everyday to find clean water and adequate food. We must stop this exploration of our resources and put an end to capitalist greed, that results in this devastation of our planet.",
        "stars": "5.0"
      },
      {
        "userName": "Briana McElroy",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "incredible story",
        "stars": "5.0"
      },
      {
        "userName": "eric w anderson",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Great story. Hard to even imagine. Painfully easy to read. A story of humanity overcoming all odds to survive. Alvarenga made it and most all would not.",
        "stars": "5.0"
      },
      {
        "userName": "Susan McCracken",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I thought it was very interesting how a person could last so long on the open ocean in a small boat",
        "stars": "4.0"
      },
      {
        "userName": "Otterprods",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is such a remarkable story. Based on thorough research and free of any pretentious writing style, it really captures the physical and mental struggles that Alvarenga encountered throughout his journey and beyond. It reads like an exciting novel and is the best book I've read this year (so far).",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I appreciated learning so much about the ocean while reading an engaging account of survival at sea. Worth the read.",
        "stars": "5.0"
      },
      {
        "userName": "Sun Sand + Sips",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Not only was it a great, thrilling story - I learned a lot. And if I am ever stuck at sea, I may just make it thanks to Chancha and his story. Except for my motion sickness. That may be an issue.",
        "stars": "5.0"
      },
      {
        "userName": "Roger Duke",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Probably one of the most epic survival stories. Great character descriptions. The only reason it was not 5 star was because I don’t think it needed a full book, or at least not this long for the story. A little repetitive and drawn out. Could be short or could add more details and keep the length.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B00UDCHZ3K\nPublisher ‏ : ‎ Atria Books; Reprint edition (November 17, 2015)\nPublication date ‏ : ‎ November 17, 2015\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 53174 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 289 pages"
  },
  {
    "title": "The Underworld: Journeys to the Depths of the Ocean",
    "author": "Susan Casey",
    "ratingCount": "33 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "NEW YORK TIMES BESTSELLER • From bestselling author Susan Casey, an awe-inspiring portrait of the mysterious world beneath the waves, and the men and women who seek to uncover its secrets“An irresistible mix of splendid scholarship, heart-stopping adventure writing, and vivid, visceral prose.\" —Sy Montgomery, New York Times best-selling author of The Soul of an OctopusFor all of human history, the deep ocean has been a source of wonder and terror, an unknown realm that evoked a singular, compelling question: What’s down there? Unable to answer this for centuries, people believed the deep was a sinister realm of fiendish creatures and deadly peril. But now, cutting-edge technologies allow scientists and explorers to dive miles beneath the surface, and we are beginning to understand this strange and exotic underworld:  A place of soaring mountains, smoldering volcanoes, and valleys 7,000 feet deeper than Everest is high, where tectonic plates collide and separate, and extraordinary life forms operate under different rules. Far from a dark void, the deep is a vibrant realm that’s home to pink gelatinous predators and shimmering creatures a hundred feet long and ancient animals with glass skeletons and sharks that live for half a millennium—among countless other marvels.Susan Casey is our premiere chronicler of the aquatic world. For The Underworld she traversed the globe, joining scientists and explorers on dives to the deepest places on the planet, interviewing the marine geologists, marine biologists, and oceanographers who are searching for knowledge in this vast unseen realm. She takes us on a fascinating journey through the history of deep-sea exploration, from the myths and legends of the ancient world to storied shipwrecks we can now reach on the bottom, to the first intrepid bathysphere pilots, to the scientists who are just beginning to understand the mind-blowing complexity and ecological importance of the quadrillions of creatures who live in realms long thought to be devoid of life.Throughout this journey, she learned how vital the deep is to the future of the planet, and how urgent it is that we understand it in a time of increasing threats from climate change, industrial fishing, pollution, and the mining companies that are also exploring its depths. The Underworld is Susan Casey’s most beautiful and thrilling book yet, a gorgeous evocation of the natural world and a powerful call to arms.",
    "numberOfPages": "337",
    "reviews": [
      {
        "userName": "pcol6642",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Excellent read. Moves along well. Not insulting to the previously uninformed on deep sea anything. Great balance between scientific explanations and descriptions and personal aspirations. Book is white with medium blue outside titling. Font and spacing makes easy to read. Text well edited. Great service as usual.",
        "stars": "5.0"
      },
      {
        "userName": "seacoast sue",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I have not done exhaustive research of other reviews to see if this has been previously noted, but that said let me just characterize Susan Casey’s The Underworld as written by a Rachel Carson with wit. An incredibly important volume on today’s environmental concerns, and frankly a joy to read.",
        "stars": "5.0"
      },
      {
        "userName": "MLBME",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The only reason I didn't give a 5 star rating is that the author gets lost in lyricism, prose and hyperbole at times. I understand she was trying to share the emotional intensity that she felt but it is a bit florid at times. Having said that.... I highly recommend this book to anyone! I Scuba dived back in my younger, leaner days (;^), and loved every moment I got to spend in the water, I still love everything about the ocean, and this book was a great read on the subject, without my having to get seasick!",
        "stars": "4.0"
      },
      {
        "userName": "Korak",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book was very well written and such a fantastic journey through the oceans and the history thereof that I would make it required reading at least at the collegiate level. It makes you appreciate God's marvelous creations.",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I love the way Susan Casey gives us so much fascinating science wrapped in these tales of undersea adventures, unexpected sea creatures and parts of the earth we have yet to explore. So much to think about.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0BL738ZLL\nPublisher ‏ : ‎ Doubleday (August 1, 2023)\nPublication date ‏ : ‎ August 1, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 46502 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 337 pages\nPage numbers source ISBN ‏ : ‎ 0385545576"
  },
  {
    "title": "The Real Dirt on America's Frontier Legends",
    "author": "Jim Motavalli",
    "ratingCount": "47 ratings",
    "ratingStarts": "4.0 out of 5 stars",
    "synopsis": "Learn the truth behind the famous characters of the Wild West—and how the legends got it wrong—in this lively history that separates fact from fiction. The historic figures of the Western frontier have fascinated us for generations. But in many cases, the stories we know about them are little more than inventions. Popular legend won’t tell you, for instance, that David Crockett was a congressman, or that Daniel Boone was a Virginia legislator. Thanks to penny dreadfuls, Wild West shows, sensationalist newspaper stories, and tall tales told by the explorers themselves, what we know of these men and women is often more fiction than fact.The Real Dirt on America's Frontier Legends separates fact from fiction, showing the legends and the evidence side-by-side to give readers the real story of the old West. Here you’ll discover the fascinating truth about Lewis and Clark, Daniel Boone, “Buffalo Bill” Cody, Calamity Jane, Kit Carson, Davy Crocket, and many others.",
    "numberOfPages": "242",
    "reviews": [
      {
        "userName": "SgtRick",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The book is all short stories about frontier people. I like short stories because I read in bed before sleep. Very calming.",
        "stars": "4.0"
      },
      {
        "userName": "R. Putman",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Short chapters, nice writing, easy reading about the legends of the west. Contains modern day follow up activities for you to experience as you wish",
        "stars": "4.0"
      },
      {
        "userName": "Valueformydollar",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Semi interesting but not sure how accurate. If you want to read a good book on the west read \" A rough trip through paradise\" by Andrew Garcia.",
        "stars": "2.0"
      },
      {
        "userName": "Carl J. Nollen",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is an attractive book with lots of pictures, notably the full page high quality photo of Kit Carson. There are 15 chapters on 17 legends featured with occasional pages of others such as Annie Oakley, Pearl Hart and Belle Starr in Calamity Jane's chapter. The chapter for each frontier person has three parts: The Legend, How They Got It Wrong and What We Actually Know. This explains what they are mostly known for, what's mistaken about what we know, and a longer explanation of what more likely is the truth, if known. I didn't find much new on the better known legends but found the book of more value for the lesser known Cathay Williams, Pierre Louis and Benito Vasquez and Black Beaver, people I had not heard of.",
        "stars": "4.0"
      },
      {
        "userName": "Daniel Makara",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "As someone who grew up wearing a coonskin cap, \" Real Dirt \" destroyed my childhood. Not that I really believed that Davy Crockett \" kilt him a Bar when he was only 3 \"... it was reassuring to think that there were real heroes who tangled with real bad guys back in the Old West. \" Real Dirt \" while destroying those myths was actually more profoundly revealing that the actual facts were not Black & White, but more believable in the kind of 19th Century scramble for 15 minutes of Fame. Ned Buntline, Buffalo Bill & P.T. Barnum may have been the real heroes in Mr. Motavalli's exhaustively researched and jauntily told extravaganza.\nWorth Reading ! ! !",
        "stars": "5.0"
      },
      {
        "userName": "Carol P.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is a gift and think she will be very happy with it. Book looks new.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B07VMQFHTW\nPublisher ‏ : ‎ Gibbs Smith (August 13, 2019)\nPublication date ‏ : ‎ August 13, 2019\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 40732 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 242 pages"
  },
  {
    "title": "Endurance: Shackleton's Incredible Voyage",
    "author": "Alfred Lansing",
    "ratingCount": "19,807 ratings",
    "ratingStarts": "4.8 out of 5 stars",
    "synopsis": "Experience one of the greatest adventure stories of the modern age in this New York Times bestseller: the harrowing tale of British explorer Ernest Shackleton's 1914 attempt to reach the South Pole.In August 1914, polar explorer Ernest Shackleton boarded the Endurance and set sail for Antarctica, where he planned to cross the last uncharted continent on foot. In January 1915, after battling its way through a thousand miles of pack ice and only a day's sail short of its destination, the Endurance became locked in an island of ice. Thus began the legendary ordeal of Shackleton and his crew of twenty-seven men. When their ship was finally crushed between two ice floes, they attempted a near-impossible journey over 850 miles of the South Atlantic's heaviest seas to the closest outpost of civilization.With an introduction by Nathaniel Philbrick, Endurance is the definitive account of Ernest Shackleton's fateful trip. Alfred Lansing brilliantly narrates the gripping and miraculous voyage that has defined heroism for the modern age.",
    "numberOfPages": "292",
    "reviews": [
      {
        "userName": "Tom Brody",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "ENDURANCE SHACKLETON'S INCREDIBLE VOYAGE by Alfred Lansing is a 280-page book about a voyage to Antarctica, where the goal was to cross the continent on foot, and where this goal was prevented when the ship, the Endurance, became permanently trapped in ice. The ship became trapped at a point about 30 miles from the LUITPOLD COAST, followed by dragging of the trapped ship by the ice to a point 800 miles away from the Luitpold Coast, and at this more distant point, the trapped ship finally sank. After the ship sank, the men continued on foot, but most of their travel was provided by the movement of their ice floe. The movement of the ice floe brought them a further 500 miles, and to within 100 miles of their final destination (Elephant Island). When the ice floe broke up, the men set out in three small boats, and traveled this final 100 miles. Aside from the name of the ship, the word \"endurance\" occurs in only one context, namely that of \"bladder endurance.\" Bladder endurance was a problem when the men were camping in the stone shelters on Elephant Island, and needed to use a common 2-gallon gasoline can as a urinal at night (page 204).\n\nThe book begins on August 1, 1914, when the Endurance set sail from London. The story ends on August 30, 1916, when Shackleton managed to land his rescue ship on Elephant Island, Antarctica, to retrieve the men who were left behind. The expedition was called, IMPERIAL TRANS-ANTARCTIC EXPEDITION, and all 28 men are listed on page 1 of the book. The book has two maps, the first tracking the location where Endurance was trapped (Jan. 19, 1915) in ice, the location where Endurance was crushed and therefore abandoned (Oct. 27, 1915), the location of the men's journey on the moving ice floe, and the final 100 mile stretch where the men took three small boats to Elephant Island to land on April 9, 1916. The second map shows the entire journey of Endurance from South Georgia Island to just off the coast of Antarctica, and the journey of one of the three small boats (the Caird) from Elephant Island back to South Georgia Island, where Shackleton successfully rounded up a rescue party.\n\nThere are six black and white photos, taken by crew member Frank Hurley. The photos show the Endurance locked in ice, the Endurance after being crushed, Frank Hurley posing with Ernest Shackleton by their tent on an ice floe (taken on May 10, 1916), and a photo of the rescue vessel arriving on August 30, 1916. There are also reproductions of two paintings by the ship's artist.\n\nTHE WRITING. Aside from a handful of literary excesses in the first several pages, this book is absolutely devoid of journalistic fluff. There is no attempt at re-creating conversations. There is no attempt at drama or pathos. There is no attempt to impress the reader with difficult words or with long sentences. I love Mr. Lansing's writing style. Mr. Lansing prefers to remain invisible, and his writing comes so naturally, and the result is that I felt like I was one of the crew members when I read the book.\n\nCLIFF HANGERS. The narrative provides a dozen or so cliff hangers, where the reader is aware that the men are faced with the threat of immediate death. These threats include savage storms at sea, having an ice floe disintegrate under the men's camping area, threats of having the three small boats crushed between ice floes, and threats of freezing to death. In the final chapter, when Mr. Shackleton set foot on South Georgia Island, and attempted to cross the Island on foot, he repeatedly took pathways that led to a dead-end that terminated at the top of a high cliff, producing the threat of death due to lack of food and exposure to the cold.\n\nOPTIMISM AND COURAGE. In a broader sense, the book is an illustration of courage in the face of constant life-threatening cold, and in the face of the threat of being lost at sea. The book provides little explicit guidance on the meaning of leadership, but it is easy to read between the lines. We learn that Mr. Shackleton never expressed thoughts of hopelessness, the fact that none of the men were drama queens (see, page 40), the fact that the men possessed a good sense of humor (see page 42), were incapable of malice (page 78), and were willing to join in singing (pages 17, 45, 75). What also helped keep the men in good spirits was that one man had a banjo, and that there was ususually plenty of powdered milk, canned beets and cauliflowers, and biscuits on hand. My own personnal opinion is as follows. Although it is difficult to eliminate drama queens during the job interview process, it is very easy to keep employees in good spirits by providing free food at regular intervals.\n\nEXCERPTS. We learn that the trip was funded by James Caird ($120,000), the UK government ($50,000), and the Royal Geographic Society ($5,000). We learn that second in command was Frank Wild, who had accompanied Shackleton on earlier trips to Antarctica. We learn that Endurance set sail from London the week that World War I started. The Endurance had three sails and a coal-fired 350 hp steam engine, that she was designed by Aanderud Larsen, and was built in Norway. Frank Hurley, the photographer, had already been to Antarctica with another explorer (Douglas Mawson). Sixtynine dogs were also brought along, though they never had a chance to pull the sledges over Antarctica.\n\nDISTASTER #1. On page 30, Endurance gets permanently trapped in ice. Although this entrapment occurred only 60 miles away from land, the ship was trapped in an ice floe that has a surface that was too \"hummocky\" to risk travel (page 34).\n\nDISASTER #2. By page 36, a quarter of the dogs had died, and the cause was foot long red worms.\n\nDISASTER #3. We learn that the ship's order of phonograph needles was discovered, instead, to consist of a box of 5,000 sewing needles (page 43). This is not really a disaster, but it is amusing to recount this.\n\nDISASTER #4. On page 59, the ship, which had been trapped for nine months, was finally crushed, and the men rescued their mittens, tobacco, surgical instruments, banjo, photographic negatives, cases of sugar, flour, rice, barley, and jam, stoves, and toothbrushes (page 80).\n\nDISASTER #5. Sometimes walk through the deep slush on the ice floe was very slow, for example, after one five hour walk the party had advanced only a half mile (page 93). At one point, a sea leopard attacked Thomas Orde-Lees, and he was rescued by Frank Wild, who shot the sea leopard, which weighed 1,100 pounds (page 102).\n\nDISASTER #6. The banjo-playing proved to be torture, because Leonard Hussey (meteorologist) knew only six tunes (page 104). It is amusing to recount this, even though it is not really a disaster.\n\nDISASTER #7. The men complained that their meat-based diet (seals, sea leopards, penguins, dog pemmican) was causing flatulence and a \"squeaky gut.\" Ice was used for toilet paper, and ice freezing on the skin caused chronically unhealed sores (page 112).\n\nDISASTER #8. The continued drift of the ice floe brought the men too far north to be able to debark at Paulet Island, leaving open the possibility of debarking at islands further to the north, such as Elephant Island or drifting even further north to be lost at sea in the dreaded DRAKE PASSAGE (pages 117-121, 124, 134).\n\nDISASTER #9. Food shortages with concomitant sub-zero temperatures was an occasional threat (page 122). The continued failure of the ice pack to disintegrate prevented the men from sailing to land, which at one point, was only 42 miles away (page 123). The ice was too lumpy to cross, and the floes were too close to each other for a safe sailing.\n\nDISASTER #10. Eventually, the ice floes used by the men for camping started to break apart (pages 128, 132, 137) and on page 138, the three small boats were launched. Killer whales surfaced on all sides of the boats (page 141), and masses of churning ice caused by rip tides threatened to overturn the boats (page 141). It is interesting to point out that the small boats were caulked with seal blood, or with cotton lamp wick and oil paints (pages 85, 107).\n\nCONCLUSION. This book is an excellent model to other historians, as a guide on how to write history books. Love this book! The last time I read a book like this was in elementary school, when I read THE RAFT by ROBERT TRUMBULL. The Raft is another non-fiction book about survival at sea. I read The Raft during the time of the Seattle World's Fair (ha, ha, not really recently).",
        "stars": "5.0"
      },
      {
        "userName": "Nanu",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Karen Eisenbrey, author of the \"Deep River\" and \"St. Rage\" series of Fantasy novels, turns to Science Fiction and hits a home run here on earth!\n\nThis book is excellent!!! It is soooooo beautifully composed, so well-constructed! The protagonists are so well-developed and the supporting characters so well-delineated! No alert reader could confuse one character with another. It is more than just a great story - this novel is very well-written!\n\nCombine elements of Jane Austen's \"Pride and Prejudice\" with Alfred Lansing's account of the Shackelton Expedition, set it in space, and you have this book! The story follows the hero, astronaut Ruby Ladd, and the egotistical, unexpected public-relations-motivated addition to her crew, documentarian Harte Gunner.\n\nIn the process of showing us that real heroes don't go for the glory, cost be damned, I find that I also buy the love story between Ruby and Harte as it plays out in a way that makes sense - that he'd be taken with her from the get-go, first only carnally (after all, plenty of women he wants to sleep with are willing to sleep with him) but building into something non-superficial over time as he observes her, is baffled by how she sees him, invests himself in the mission rather than only in his documentary project, and sacrifices along with the rest of them, not setting himself apart. He shows her that he is a man worth being with.\n\nAnd Ruby shows him what leadership is. She shows him that heroism is frequently not flashy and that what others call heroism is often an accidental by-product of caring more about what happens to others than about making ones mark.",
        "stars": "5.0"
      },
      {
        "userName": "Kristine A. Davis",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book was incredible! Every person should read it. Simply reading about man's will to live and survival in the most treacherous conditions evoke strong feelings of inspiration. The story about an expedition across Antarctica turns into an almost two year fight to get back to civilization across ice, snow, and unforgiving seas. Beyond that, the author impeccably describes the struggles, landscapes, weather, the mens' characters, daily life and activities, etc so vividly you can see it in your minds eye. The journey gets you interested but the writing keeps you on your toes and turning each page. Worth every minute you spend reading it. These men and their heroic fight to survive is outstanding and deserve recognition.",
        "stars": "5.0"
      },
      {
        "userName": "Kathy Cott",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I liked the format of the written story. Mr. Lansing rightly so developed heroes out of all the men. This was an incredible read, which I will never forget. The men worked together as a united team to not just save themselves but to save each other. Shackleton’s leadership allowed these men to be successful in a difficult struggle, where no one gave up their will to live. Shackleton’s inward struggle and command of the expedition is highly and strongly commendable. I strongly recommend this book.",
        "stars": "5.0"
      },
      {
        "userName": "Heather Norwood",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is not only possibly the best book on the topic, this was one of the finest written books I've read. Lansing chronicals icy wasteland and days of being stranded with page turning ability. Each word and each page flows like smooth like melted butter. He provides great insight, visuals, and emotion. Shackleton and his crew were some of the most impressive explorers of our time and this book does them great justice",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B00IC8VF10\nPublisher ‏ : ‎ Basic Books; Anniversary edition (April 29, 2014)\nPublication date ‏ : ‎ April 29, 2014\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 28520 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 292 pages"
  },
  {
    "title": "I Beat The Odds: From Homelessness, to The Blind Side, and Beyond",
    "author": "Michael Oher",
    "ratingCount": "1,484 ratings",
    "ratingStarts": "4.7 out of 5 stars",
    "synopsis": "The football star made famous in the hit film (and book) The Blind Side reflects on how far he has come from the circumstances of his youth. Michael Oher shares his personal account of his story, in this inspirational New York Times bestseller. Looking back on how he went from being a homeless child in Memphis to playing in the NFL, Michael talks about the goals he had to break out of the cycle of poverty, addiction, and hopelessness that trapped his family. Eventually he grasped onto football as his ticket out and worked hard to make his dream into a reality. With his adoptive family, the Touhys, and other influential people in mind, he describes the absolute necessity of seeking out positive role models and good friends who share the same values to achieve one's dreams. Sharing untold stories of heartache, determination, courage, and love, I Beat the Odds is an incredibly rousing tale of one young man's quest to achieve the American dream.",
    "numberOfPages": "278",
    "reviews": [
      {
        "userName": "impctdrver54",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A great read especially if you are a fan of “The Blind Side” book and movie. After watching Michael play for the Charlotte Panthers and ascend with them to the Super Bowl, I wanted to learn more about him. What an inspiring story!",
        "stars": "5.0"
      },
      {
        "userName": "Marilyn T.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Such good advice on how to succeed in life no matter what situation you came from. Thank you, Michael Oher!",
        "stars": "5.0"
      },
      {
        "userName": "J. Anthony Rosario",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I saw and loved the movie. So, I read up a little on Michael Oher, and have always been impressed with him. The Blind Side is more like an outline of Michael Oher’s life, but this book was the real meaty part of his life story. It was so believable and touching. Hard work, dreams and aspirations, and good people can often lead to great results. I cried too many times while reading this book…what more can I say?",
        "stars": "5.0"
      },
      {
        "userName": "Wayne Schneider",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I think Michael Over will chuckle at me for calling it a masterpiece. But I believe this not only a book that many young people should get their hands on and read it. Also, adults, parents and even grandparents should read it. There are so many of us that want to help but either don't know where to start or even how to start looking. This book of Michael's experiences is eye opening to the needs out there.\n\nThank you Michael Over for giving us an insight into your life.",
        "stars": "5.0"
      },
      {
        "userName": "C. Baker",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Michael Oher has had so many other people tell his story that he must have felt he finally had to tell his own story in his own words.\n\nMichael Oher may be the most well known offensive lineman in the history of the National Football League after the movie, The Blind Side, based on the best selling book of the same name by Michael Lewis. The Blind Side tells of an inner city Memphis kid who grew up virtually homeless but rose to become the first round pick of the Baltimore Ravens of the National Football League.\n\nAnyone who read or saw The Blind Side knows the basics of Oher's story. He grew up in drug infested neighborhoods in Memphis with an indifferent mother addicted to crack cocaine, who often left her many kids to fend for themselves and was at times homeless.\n\nOher grew up often not knowing where his next meal was coming from or even where he would sleep. In an out of foster care, sometimes homeless, always destitute in if not the basics, direction and care, his character and work ethic, along with a lot of help from some very generous people, eventually landed him at a private school in well to do part of Memphis.\n\nThe amazing aspect of Oher's success beyond people like the Tuohy family who took him into their home and made him part of their family, is his work ethic and perseverance through severe disadvantages.\n\nYes, Oher got lucky that there were enough people to help him along the way achieve his dreams. But it takes more than being huge and athletic to take those opportunities and turn them into success. While there are many, many, better off, less disadvantaged athletes that never graduate from college or achieve any level true success in professional sports, Oher graduated and had had success as a pro. Regardless of talent and background, that takes a lot of hard work. And despite the unbelievable disadvantages, Oher took the opportunities in front of him and made a success of his life.\n\nIn this book Michael talks about his life growing up, his love for his siblings and his adopted family, the Tuohys, but he also has a message. And that message is to those in similar circumstances not to give up, work hard, and take the opportunities afford and make the best of them. While not all kids in Oher's situation will be quite as lucky, and probably not have quite the perseverance, Oher's success creates a model and gives hope to others.\n\nAnd another amazing thing about Oher is how self aware he is. He notes that the life of a professional football player is short, so he doesn't live lavishly and plans to save and have a plan for the future. He understands that he doesn't know everything about football and the professional game and understands he has to continue to learn and improve. It's a rather refreshing perspective.\n\nThis book is readable, interesting, and while it will not really tell much that is not basically known about Oher's life and success, it is his message of hope and perseverance that makes it a worthwhile read.",
        "stars": "4.0"
      },
      {
        "userName": "Amy Nix",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I got the Kindle version of this on a whim, and I didn't expect much because these \"written by a famous person\" books are generally ghost-written exercises in self-aggrandizement. Every now and then, however, you come across a really good and meaty memoir...and this is one of those. Mr. Oher clearly wrote this book himself. It is written in a conversational style not typical of professional authors, and it personalized the book in such a brilliant way. You can tell that you are reading this young man's own words and thoughts. It's totally endearing. The substance of the book is wrenching and lovely and funny all at once. Mr. Oher's sense of humor and his ability to tell stories of terrible sadness mix together into something really special.\n\nI loved learning about Oher's irritation at certain parts of The Blind Side film's depiction of him. I loved hearing the confidence and awareness in his self-evaluation. He has a remarkably observant estimation of his own gifts and shortcomings that I found inspiring. Some of the reviews I consulted before buying this book said they felt Oher's tone was unappreciative, dismissive, or even snobby. I didn't sense that in any part of the book; in fact, he spends a great deal of time talking about everyone in his life--other children, select teachers, neighbors, social workers, and coaches--who showed him a kindness. He leaves out no one. He stresses the importance of not just the Tuohy family, but each of the others who helped him, fed him, sheltered him, or taught him. How anyone got ingratitude from this book is beyond me. This is a man who knows where he came from, knows what his mistakes were, and knows how hard he worked personally to gain what he's now received. He shows gratitude, but does not spend half the book gushing about how he'd be nothing without this or that person because the simple truth is: there was no way Michael Oher was ever going to allow himself to be \"nothing.\"\n\nYou get honest truth in this book about what it felt like to be Michael Oher as a child, how he views the people who formed his childhood now that he's grown up, and what he thinks people who come from a similar background should focus on to achieve their potential. At the end of the book, Mr. Oher talks about the charities he is familiar with himself and offers a long list of ideas about how individuals can make a difference for children in distress. It was wonderful getting to hear the voice of the real Michael Oher, and I highly recommend this for a nice weekend read.\n\nI loved every paragraph of this book, and I couldn't put it down. Well done, Mr. Oher. Very well done, indeed.",
        "stars": "5.0"
      },
      {
        "userName": "Kevin Herring co-author Practical Guide for Internal Consultants: Using Your Expertise to Build Business Capacity",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Loved the book! Very impressive life story and should inspire many people from teens to adults to work hard and keep eying the prize. Good, worthwhile goals always payout in some way.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B005GSYY94\nPublisher ‏ : ‎ Avery; Reprint edition (February 7, 2012)\nPublication date ‏ : ‎ February 7, 2012\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 4900 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 278 pages"
  },
  {
    "title": "Wanderlust: An Eccentric Explorer, an Epic Journey, a Lost Age",
    "author": "Reid Mitenbuler",
    "ratingCount": "91 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "The mesmerizing, larger-than-life tale of an eccentric adventurer who traversed some of the greatest frontiers of the twentieth century, from uncharted Arctic wastelands to the underground resistance networks of World War II.\"An absolute joy...Wanderlust is a compelling introduction to one of the most charismatic explorers to ever cross the ice.\"—New York Times Book ReviewDeep in the Arctic wilderness, Peter Freuchen awoke to find himself buried alive under the snow. During a sudden blizzard the night before, he had taken shelter underneath his dogsled and become trapped there while he slept. Now, as feeling drained from his body, he managed to claw a hole through the ice only to find himself in even greater danger: his beard, wet with condensation from his struggling breath, had frozen to his sled runners and lashed his head in place, exposing it to icy winds that needed only a few minutes to kill him… But if Freuchen could escape that, he could escape anything.Freuchen’s life seemed ripped from the pages of an adventure novel—and provided fodder for many books of his own. A wildly eccentric Dane with an out-of-nowhere sense of humor, his insatiable curiosity drove him from the twilight years of Arctic exploration to the Golden Age of Hollywood, and from the burgeoning field of climate research to the Danish underground during World War II. He conducted jaw-dropping expeditions, survived a Nazi prison camp, and overcame a devastating injury that robbed him of his foot and very nearly his life. Through it all, he was guided not only by restlessness but also by ideals that were remarkably ahead of his time, championing Indigenous communities, environmental stewardship, and starting conversations that continue today. Meticulously researched and grippingly written, Wanderlust is an unforgettable tale of daring and discovery, an inspiring portrait of restlessness and grit, and a powerful meditation on our relationship to the planet and our fellow human beings. Reid Mitenbuler’s exquisite book restores a heroic giant of the last century back into public view.",
    "numberOfPages": "509",
    "reviews": [
      {
        "userName": "DRW",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book is fantastic, easily one of my new favorites. I was honestly expecting to not enjoy this book, because I'm not all that excited about either horrid winters or Greenland, but I suspected there had to be more than just a few fascinating things about this Peter Freuchen character. It didn't take long to get hooked on his story and my curiosity kept me engaged, which is exactly what you hope for in a book, complete with with lively details and unexpected turns. A note at the conclusion explains that there was a vast amount of original written material left behind by Freuchen that enabled the author to illustrate scenes with incredible details - including sights, sounds, and sometimes scents. It's this kind of depth that enables the reader to connect with a slice of the past and the central characters in a very nuanced way. Highly recommend!",
        "stars": "5.0"
      },
      {
        "userName": "Eric",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I needed some adventure in my life and was glad to get it in this riveting book. What an incredible life Freuchen had, from Arctic explorer to Hollywood writer to Danish freedom fighter. Freuchen is a very interesting and complicated character, who seemed to love nothing more than going somewhere else. I found the portraits of those Freuchen met to be really well drawn out, and quite realistic -- very much how things tend to happen in real life. It's hard to comprehend what it'd take to survive in the Artic as long as he did, but he clearly handled his interactions with others in an enlightened way in comparison to his time. I have to say, my favorite part was the even-handed debunking of some of the tall-tales in his life, like the \"Frozen Poop Chisels\" escape from the snow and the not-so-daring release from a Nazi prison, both flagged by the NYTimes. But the real heart of the book is that adventure isn't just what happens on the outside, but what happens on the inside. I don't agree entirely with the WPost review about introspection--there is a lot of show, not tell, here. Whether it's how to survive extreme isolation in the Artic or running refugees out of his Danish Farm, it's clear that Freuchen understood what it meant to be human. He caught on to the failures of the Soviet system much earlier than most, and also treated the Inuit inhabitants of the Arctic as fellow travelers in this world; he certainly embraced their culture. If Freuchen can teach us anything, it's that we don't have all the answers ourselves, but maybe those answers are still out there, and the next person we meet in this big, blue world can help us find them--or at least discuss them together after meeting on an icy ship, a shaky train, or a long walk. They say it's not the destination, but the journey--and what a journey this book was. Well worth the time!",
        "stars": "5.0"
      },
      {
        "userName": "James Cleary",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is generally a good read and when the author sticks to the subject of the fascinating life of Artic explorer Peter Freuchen, it is an excellent piece of historical writing. The author’s writing is certainly in the welcome new style of narrative nonfiction that often reads like a good novel.\n\nEXCESSIVE SIMILIES\n\nThere is one glaring exception to the writing style, however. The author showers us with similes like a downpour in a rain forest. And most of them are just as silly as that one. A good editor would have pointed out that when the basic description paints a clear picture, metaphors and similes are an unnecessary distraction. Good writing doesn’t call attention to itself.\n\nGRATUITOUS POLITICAL COMMENTARY\n\nMy main criticism of this work, though, is the author’s inability to stick to the subject. He frequently veers off into his own political views, using the thinnest of segues. He often blurs Freuchen’s views with his own in a misleading way.\n\nThe crusty explorer certainly expresses some political views in his writing, but with only a few exceptions, he wasn’t any kind of a political activist, yet like so many of today’s historians, Mr. Mitenbuler just can’t restrain himself from expressing his own left-leaning views.\n\nThis includes inaccurate, undocumented ramblings about the causes of the Great Depression and lectures on the various aspects of socialism and capitalism, always in the broadest sweeping terms, unsupported by any attribution or original research. He especially missed the boat on Herbert Hoover’s reaction to the depression.\n\nBut more importantly, none of this is germane to the main story and shows a lack of discipline and good editing.\n\nWHO IS REID MITENBULER?\n\nAnother somewhat strange thing about this author is his apparent secretiveness about his own life. Search Reid Mitenbuler on the Internet and you will find nothing about his background. His own website only lists books he has written and publications in which he has been published. That’s it. Nothing else. Very strange indeed.\n\nJim Cleary\nGreen Valley, AZ",
        "stars": "3.0"
      },
      {
        "userName": "Think Tank Reader",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I’ve read many biographies of historical people in my time. Too many of them are standard accounts of achievements, places, and obstacles overcome. Predictable and boring. Mr. Mitenbuler makes this into a story that’s interesting and fun to read. Plus, it’s about Greenland. How many books have you read about Greenland? That’s part of the fun - learning about the people and customs of native Greenlanders before onslaught of Western ways. By following the life of a well known explorer of the time, Mr. Mitenbuler uses his provocative writing style to present an interesting and thoughtful book.",
        "stars": "5.0"
      },
      {
        "userName": "William M.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This dang book does not let up. From Freuchen's early adventures in Greenland to Hollywood and fighting Nazis, this guy did it all. I couldn't put this book down.",
        "stars": "5.0"
      },
      {
        "userName": "Colin Barnett",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book is extremely well-written. I wondered how the author could know what actually happened during the events he described, but the book is well-sourced. Based on the quality of the writing, I am going to read another book by the same author.",
        "stars": "5.0"
      },
      {
        "userName": "Maxwell T. Sandford",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book appears to be factually correct. I read one of Freuchen's books a long time ago while spending a frozen month at Resolute on Cornwallis Isl. The times have certainly changed since the turn of the 20th Century, perhaps not for the better.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0B2RQJY8Y\nPublisher ‏ : ‎ Mariner Books (February 21, 2023)\nPublication date ‏ : ‎ February 21, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 16934 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 509 pages\nPage numbers source ISBN ‏ : ‎ 006332315X"
  },
  {
    "title": "Completely Mad: Tom McClean, John Fairfax, and the Epic of the Race to Row Solo Across the Atlantic",
    "author": "James R. Hansen",
    "ratingCount": "12 ratings",
    "ratingStarts": "4.8 out of 5 stars",
    "synopsis": "From the New York Times bestselling author of The First Man comes a sweeping saga involving two extraordinary—and extraordinarily different—adventurers who have only one thing in common: the ambition to cross the Atlantic in a rowboat . . . alone. In this bracing adventure tale, the stories of John Fairfax and Tom McLean are woven together for the first time. Fairfax would set off from the Canary Islands off the coast of Africa with his sights on Florida. McClean charted a course from Newfoundland to Ireland.  The two men couldn’t have been more different. John Fairfax was a golden-haired playboy, gambler, whiskey, gun smuggler, and ex-pirate who blamed his boat often, and who brazenly took time off from his goal of reaching America to hop aboard large ships for a drink, a shower, and good food. He courted the press like a modern-day Richard Branson or Elon Musk.  The egoless Tom McClean was an orphan with a tough, Dickensian childhood, who ran off to become a British paratrooper and later joined the SAS (his training rivaled the U.S. Navy Seals). Tom was a purist who loved his boat Silver and never once took time off from rowing to sun himself on a remote beach or jump aboard a cruise ship. After 70 days, he landed on the rocky coast of Ireland to no fanfare and headed straight to the nearest pub.  Though the two men’s remarkable transoceanic journeys seem pulled from a different era, both embarked within days of the first landing on the Moon: July 20th, 1969.  Filled with gale-force winds, backbreaking effort, menacing sharks, playful dolphins, awing natural beauty, great mishaps, failed equipment, hyperthermia, near-drowning, the fighting of mental and physical lethargy, creative problem-solving, phantom illusions on the water, and glorious moments of bliss, Completely Mad stands alongside other classics of ocean adventure.   With gripping and insightful prose, James R. Hansen brings to life Fairfax and McLean's expeditions, from their battle with the elements to their own inner demons. Completely Mad is a nail-biting, epic tale of endurance, and readers will be gripped until the end to find out who won.",
    "numberOfPages": "370",
    "reviews": [
      {
        "userName": "Carol L. Busse",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The race between two totally different personalities across the Atlantic Ocean in row boats was a riveting read. Why would any one want to take on that challenge and what kind of men were they with that same goal? The author so captivates the reader with his story of “madness” of two unusual men who want to be the first to row across the ocean by himself. Hansen captures the essence of the two so vividly that the reader feels like he is in the rowboats with them, experiencing the horrifying affects of the ocean, its creatures and the weather. All that the men endure throughout the “race” is hard to believe and makes the reader think they are surely crazy!",
        "stars": "5.0"
      },
      {
        "userName": "David Chudwin",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "BOOK REVIEW\n“Completely Mad:\nTom McClean, John Fairfax, and the Epic Race to Row Solo Across the Atlantic”\nBy James R. Hansen\n(Pegasus Books, 2023)\n\nThere are only a dozen or so literary plots and Man Versus Nature is a timeless one.\nThe protagonists of Prof. James R. Hansen newly released masterpiece are two unlikely British adventurers, Tom McClean and John Fairfax, who in 1969 became the first men to row solo across the Atlantic Ocean.\nIt is fitting they separately accomplished this feat in July 1969, the month and year of the Apollo\n11 Moonlanding. Of course, Prof. Hansen’s previous works have focused on space, most notably “First Man” his biography of Neil Armstrong. As Armstrong and his pioneering space crew returned to Earth in the silent vacuum of space, McClean and Fairfax battered stormy seas with thunder and lightning, gale force winds, huge waves, bone-chilling cold, and salt water-stung crops of blisters.\nThe two men could not have been more different. Fairfax grew up in fascist Italy and then Argentina, son of a single mother. He left as a teenager and led a dissolute vagabond life including stints as a pirate, playboy and gambler before settling in England.\nMcClean had a hard childhood. He grew up in a strict English orphanage and entered the military as a teenager, joining the elite paratroopers and later the British Special Services, SAS. He served in conflicts in Indonesia, Aden, and Honduras, often with isolated combat groups of 4.\nNature in the form of the sea is the antagonist of the story. The Atlantic is at times capricious, wild, unforgiving, and overwhelming, as described by Hansen. The freezing gales, mammoth waves, briny salt water, and strong winds which took them off-course, tested the two men to the ultimate.\nHansen masterfully interweaves the men’s life stories with the story of their ocean voyages. Hansen was able to interview in detail McClean by skype from Scotland where he is now 81. Fairfax died in Las Vegas in 2012 but Hansen was able to interview Sylvia Cook the woman who was his girl friend and assistant during that time. Necessarily, there is more detail about McClean.\nProf. Hansen has a direct writing style which waxes poetic as he describes the battles between the men and the sea. “Completely Mad” rises to the level of classics such as Hemingway’s “The Old Man and the Sea,” Melville’s “Moby Dick” and Homer’s “The Odyssey.” As Hansen describes the struggles of the men to survive against nature’s blows, I am reminded of the modern “Into Thin Air” by Jon Krakauer, where the antagonist is Mt. Everest instead of the ocean.\nIt is fascinating that the two men continued their quests after 1969. Fairfax and his girlfriend were first to row 6,000 miles across the Pacific in 1972. McClean oared four more times across the Atlantic over the ensuing decades. What motivated these men? Hansen points to aspects of their personalities and upbringings but does not give definitive answers as to why men explore and will sacrifice to be first.\nHansen wrote the book during the pandemic and it was time well-spent. He has taken sagas of men against the sea from a half-century ago and made them come vividly alive. Hansen is an excellent storyteller and a fine writer. I highly recommend “Completely Mad” which is destined to be a modern classic.",
        "stars": "5.0"
      },
      {
        "userName": "Edward",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is an absolutely compelling rendering of the important stories of two men with very different approaches to achieving their startling goals. It is clear that the author's sympathies lie more with one than the other but to his credit, both stories are told with sympathy, integrity and respect. The book is written in exciting prose throughout but that praise must be tempered by the woeful state of copyediting; there are all sorts of distracting syntax issues throughout. That is perhaps a reflection of the woeful state of the publishing industry at present but I hope the paperback edition will go through more rigorous editing.",
        "stars": "4.0"
      },
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "In the summer of 1969, when the world was enthralled by the exploits of the Apollo astronauts, few people had heard of the two young adventurers who were rowing across the Atlantic Ocean, alone. In Completely Mad, James Hansen brings life to each man’s story. Tom McClean, raised in a British orphanage and former paratrooper and member of Britain’s elite SAS, and John Fairfax, who had already lived a life of high adventure before he was out of his teens, were very different. Hansen uses his meticulous research to recreate each man’s voyage with accounts of terrifying storms, huge waves, hovering sharks, as well as the day to day routines that allowed them to survive on their tiny vessels. Read this book, and you will never be able to forget their journeys.",
        "stars": "5.0"
      },
      {
        "userName": "ann",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This extraordinary true adventure story by James R. Hansen is THE summer book of 2023. I have no doubt that Completely Mad will also be made into a blockbuster motion picture.\n\nThis dramatic real life story took place during the intensive mass media buildup to the monumental first human expedition to the Moon in 1969, so it was almost lost to posterity, having been almost completely lost in the giant shadow of Apollo 11.\n\nUnlike the Apollo missions, there was no live, around-the-clock television and radio coverage of those two separate and extremely dangerous transatlantic rowboat voyages made by John Fairfax and Tom McClean. Thanks to Hansen for finally bringing this fascinating story back out into the light so we can all enjoy it.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0BHTNH6Y6\nPublisher ‏ : ‎ Pegasus Books (July 4, 2023)\nPublication date ‏ : ‎ July 4, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 53497 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 370 pages\nPage numbers source ISBN ‏ : ‎ 163936417X"
  },
  {
    "title": "The Blind Side: Evolution of a Game",
    "author": "Michael Lewis",
    "ratingCount": "2,271 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "The #1 New York Times Bestseller\"Lewis has such a gift for storytelling…he writes as lucidly for sports fans as for those who read him for other reasons.\" —Janet Maslin, New York TimesWhen we first meet him, Michael Oher is one of thirteen children by a mother addicted to crack; he does not know his real name, his father, his birthday, or how to read or write. He takes up football, and school, after a rich, white, Evangelical family plucks him from the streets. Then two great forces alter Oher: the family’s love and the evolution of professional football itself into a game where the quarterback must be protected at any cost. Our protagonist becomes the priceless package of size, speed, and agility necessary to guard the quarterback’s greatest vulnerability, his blind side.",
    "numberOfPages": "352",
    "reviews": [
      {
        "userName": "the gunner",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "First to give you full disclosure I'm a University of Georgia (UGA)Ball Fan. In the South \"Ball\" means just one thing, football. Does your son play ball has only one meaning, unless you are a Tech fan, then it could mean basketball, but those guys still carry slide rules.\n\nI bought this book because I thought it was a \"sports story\". I was wrong. It is an incredible human interest story, also. One which has caused me to laugh out loud and read some passages to my wife and, others, which made me cry.\n\nThis should be required reading for every school board official in the country.\n\nOprah ought to put it in her book club.\n\nThe author starts off explaining why an offensive left tackle is important in football (See Lawrence Taylor (L.T) and Joe (How I got my leg broken on national television) Thiesmann. It tells of the evolution of the passing game in the NFL from a steam-roller running game to a finesse passing game ala Bill Walsh (see west Coast Offense that was really born in Cincinnati).\nI particular enjoyed the antidote about his official trip to visit the University of Tennessee.\n\nBut what will be of greater human interest is the overlay of the story of Michael Oher, the \"man/child\" currently playing football at Ole Miss. Oher shows up at a predominantly white Christian school in the 9th grade with virtually no school history and horrible family background. An incredibly shy 350 pound kid struggles but ingratiates himself to faculty and staff and manages to stick around. Finally one Thanksgiving Day a volunteer assistant coach and his wife see him at a bus stop in his usual shorts and recognize that in addition to no money for food, he is traveling to the gym to watch practice just to be in a heated room. Through incredible acts of kindness and caring this young man is taken in by this wealthy Christian family who attempt to socialize and educate him for the future.\n\nBut little did they realize that at 6' 6\" with an incredible frame and quick feet, football coaches would see their answer to possibly the most important position on the football field and they would relentlessly come calling. This presents many problems as Oher has virtually no chance of attending college with his past educational background. Thus begins the odyssey of the recruiting wars for this individual who by the end of high school has been called the best pro prospect even though he has played in only 15 football games.\n\nThis portion of the book dominates approximately 60% of the book. It is incredibly touching and I certainly applaud the sympathetic, caring approach by Leigh Ann and Sean Tuohy. This book is not just for football fans as the issues here are much greater. How does a child get to the 9th grade with virtually no retention of knowledge or ability to function in a social setting? What can a change in culture and caring do for this young man? And other questions will also appear such as is their potential ulterior motives for selecting this student out of so many and wasn't the final steps to eligibility really inappropriate? As to my opinion I choose to believe that the Tuohy's were interested in helping another human being, and in the process, it enriched the lives of their family, this young man and the possibilities that a loving, caring environment can create.\n\nI strongly recommend this book for football fans, sociologists, and people with interest in politics, religion, or Southern Culture as there are many issues intertwined. Once again, the weakness to this book may be that he narrowed its focus by making it a \"sports book\". It's not. Its main message concerns underprivileged kids and how a change in environment can produce incredible results\n\nI thought it was hilarious that Sean Tuohy read Michael the following and told him that it was about Ole Miss going into the stadium at LSU (THE STADIUM IS KNOWN AS \"\"Death Valley,\":\n\nThe Charge of the Light Brigade\nby Alfred Lord Tennyson\n\nHalf a league, half a league,\nHalf a league onward,\nAll in the valley of Death\nRode the six hundred.\n\"Forward, the Light Brigade!\nCharge for the guns!\" he said:\nInto the valley of Death\nRode the six hundred.\n\"Forward, the Light Brigade!\"\nWas there a man dismayed?\nNot though the soldier knew\nSome one had blundered:\nTheir's not to make reply,\nTheir's not to reason why,\nTheir's but to do and die:\nInto the valley of Death\nRode the six hundred.\nCannon to right of them,\nCannon to left of them,\nCannon in front of them\nVolleyed and thundered;\nStormed at with shot and shell,\nBoldly they rode and well,\nInto the jaws of Death,\nInto the mouth of Hell\nRode the six hundred.\nFlashed all their sabres bare,\nFlashed as they turned in air\nSabring the gunners there,\nCharging an army, while\nAll the world wondered:\nPlunged in the battery-smoke\nRight through the line they broke;\nCossack and Russian\nReeled from the sabre-stroke\nShattered and sundered.\nThen they rode back, but not,\nNot the six hundred.\nCannon to right of them,\nCannon to left of them,\nCannon behind them\nVolleyed and thundered;\nStormed at with shot and shell,\nWhile horse and hero fell,\nThey that had fought so well\nCame through the jaws of Death\nBack from the mouth of Hell,\nAll that was left of them,\nLeft of six hundred.\nWhen can their glory fade?\nO the wild charge they made!\nAll the world wondered.\nHonour the charge they made!\nHonour the Light Brigade,\nNoble six hundred!\n\nOh, I'm an ex-artillery officer as well.\n\nHighly recommended for educational professionals and members of Boards of education. It wouldn't hurt if you are a fan of college football ,either.\n\nGunner August, 2008",
        "stars": "5.0"
      },
      {
        "userName": "Annette Barltome",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "described as is",
        "stars": "5.0"
      },
      {
        "userName": "takingadayoff",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I loathe football. Especially the way it's morphed over the past thirty years into little more than an excuse for head bashing. The only \"sport\" more mindless than football is boxing. I don't know much about football, in fact, most of what I know about it now, I learned from Blind Side. It sounds to me like the professional teams are all looking for physical freaks who are little more than violent monsters who can follow simple instructions, who are angry at the world and can be manipulated to direct that anger into trying to maim the players from the opposing team. The fact that they are quite likely to be maimed themselves is only a concern because of potential lost services to the team. The players are capital expenditures that will depreciate over time and the teams just want to get their money's worth before a player has to be discarded. The level of concern over injured players almost rises to the level of concern over that racehorse that broke its leg last year. For weeks, people were beside themselves worrying over whether the horse would have to be put down. They were almost, but not quite, as concerned about the horse as they are about the recent premature deaths of former football players that are almost certainly due to multiple concussions received while playing pro football as it is now meant to be played.\n\nThe story of how the object of football has changed from scoring touchdowns to trying to break the quarterback's legs is only a part of Blind Side. The main part is the story of one person, Michael Oher, who is sixteen when we meet him. Michael Lewis, the author, tells a fascinating story, as usual. Oher comes from such a sad and deprived background that it is amazing that he can function at all. The Tuohys, a wealthy couple with two kids of their own, take Oher in. And at 6'5\" and 340 pounds, Oher is no stray kitten. To their credit, the Tuohys helped Oher out of the goodness of their hearts, not because they realized that he would be filthy rich one day soon because he is exactly the right body type to be a left tackle, the player who protects the quarterback's blind side.\n\nOher's story brings up several concerns. One is that he always dreamed of playing basketball, and had no interest in football. Although he was pretty good at basketball, his body is perfect for football, so the coaches at his new high school directed him to football and away from basketball. Since Oher is unusually passive, he went along. But being passive isn't a good quality for a football player. It took a lot of taunting and goading by other players for Oher to finally develop his anger and direct it to hitting the other players. Lewis never hints that anyone encouraged the kids to taunt Oher, but it certainly worked out well. Another concern is that in order for Oher to graduate from high school and be admitted to college, he had to have a C average and pass a certain number of courses. The Tuohys hired a full-time tutor for Oher and Oher worked very hard but in the end, he almost certainly had to cheat to make the grade point average. Lewis tells of Oher taking online courses to make up the last credits he needed. Certainly Oher is better off with the education he did get than the complete lack of education he was getting before everyone wanted him to be able to accept a football scholarship. But you know he isn't the exception. I guess there's no way to change the system at this point, but wouldn't it make more sense to have a minor league for football rather than handing out degrees in criminal justice to players who can barely read just so they'll be eligible to play?\n\nMichael Lewis is a terrific writer. I loved his Money Culture and Liar's Poker and Moneyball. I was less enchanted by Coach, his paean to an unpleasant and sadistic high school coach. And with Blind Side, I'm on the fence. The writing is good, the story is gripping, there's controversy and drama. I'm a bit uncomfortable though, about how many people are using Oher for their own profit. The high school coaches were thrilled to have Oher playing for them because it meant recognition and promotions. The college coaches were promising the Tuohys and Oher the moon if he'd go to their college because it meant a chance at the pros for them. Even if Oher gets injured and never signs a pro contract, they've already profited. And Lewis has a best selling book.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B000VWM0MI\nPublisher ‏ : ‎ W. W. Norton & Company; Reprint edition (September 17, 2007)\nPublication date ‏ : ‎ September 17, 2007\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 761 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 352 pages"
  },
  {
    "title": "River of the Gods: Genius, Courage, and Betrayal in the Search for the Source of the Nile",
    "author": "Candice Millard",
    "ratingCount": "2,870 ratings",
    "ratingStarts": "4.3 out of 5 stars",
    "synopsis": "NEW YORK TIMES BESTSELLER • The harrowing story of one of the great feats of exploration of all time and its complicated legacy—from the New York Times bestselling author of The River of Doubt and Destiny of the RepublicABEST BOOK OF THE YEAR: THE WASHINGTON POST • GOODREADS\"A lean, fast-paced account of the almost absurdly dangerous quest by [Richard Burton and John Speke] to solve the geographic riddle of their era.\" —The New York Times Book ReviewFor millennia the location of the Nile River’s headwaters was shrouded in mystery. In the 19th century, there was  a frenzy of interest in ancient Egypt. At the same time, European powers sent off waves of explorations intended to map the unknown corners of the globe – and extend their colonial empires.Richard Burton and John Hanning Speke were sent by the Royal Geographical Society to claim the prize for England. Burton spoke twenty-nine languages, and was a decorated soldier. He was also mercurial, subtle, and an iconoclastic atheist. Speke was a young aristocrat and Army officer determined to make his mark, passionate about hunting, Burton’s opposite in temperament and beliefs.From the start the two men clashed. They would endure tremendous hardships, illness, and constant setbacks. Two years in, deep in the African interior, Burton became too sick to press on, but Speke did, and claimed he found the source in a great lake that he christened Lake Victoria. When they returned to England, Speke rushed to take credit, disparaging Burton. Burton disputed his claim, and Speke launched another expedition to Africa to prove it. The two became venomous enemies, with the public siding with the more charismatic Burton, to Speke’s great envy. The day before they were to publicly debate,Speke shot himself.Yet there was a third man on both expeditions, his name obscured by imperial annals, whose exploits were even more extraordinary. This was Sidi Mubarak Bombay, who was enslaved and shipped from his home village in East Africa to India. When the man who purchased him died, he made his way into the local Sultan’s army, and eventually traveled back to Africa, where he used his resourcefulness, linguistic prowess and raw courage to forge a living as a guide. Without Bombay and men like him, who led, carried, and protected the expedition, neither Englishman would have come close to the headwaters of the Nile, or perhaps even survived.In River of the Gods Candice Millard has written another peerless story of courage and adventure, set against the backdrop of the race to exploit Africa by the colonial powers.",
    "numberOfPages": "424",
    "reviews": [
      {
        "userName": "Bobby D.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "When I was a teenager one of the things that intrigued me was Explorers, especially those who searched for the source of the Nile. As a result, I have read and collected several books on the topic. It was automatic when I saw Candice Millard had written her latest book on this subject that I would pre-order a copy. I have read and liked her three previous books (especially THE RIVER OF DOUBT). I would recommend that if you have never read another book on this subject her new book is a good starting point. You might even want to find a copy of the 1990 movie that tracks this same story, THE MOUNTAINS OF THE MOON. I thought I would use this review to also mention some of my favorite books on the subject of the search for the Nile.\n\nMillard’s book for the most part only focuses on Richard Burton and John Hanning Speke's searches (and Speke’s lone discovery of the source). She also elevates the major role played by their African guide Sidi Muarak Bombay, a former slave who co-led other White English Explorers (such as Henry Morton Stanley). Bombay helped Stanley to find Livingston and became the first to cross the entire African continent, sea to sea, from East to West with explorer Cameron. It was not until 2009 that the Royal Geographic Society commissioned a major museum exhibit that recognized native explorers’ contributions.\n\nI still have my first book on the subject of the River Nile. Read some 60 years ago all I can recall is that it was one of those books that amazed its teenage reader. It is Alan Moorehead’s THE WHITE NILE (1960). The book includes the Speke/Burton exploration in addition to Livingston, Samuel Baker with his wife, Stanley and finally covering the Muslim uprising that killed “Chinese” Gordon leading to Kitchener's British victory. Moorehead wrote a second book, THE BLUE NILE (1962) which includes the history of this major river tributary.\n\nAnother book that digs deeper into the amazing person that was Richard Burton (not the actor who borrowed his name). Edward Rice’s CAPTAIN SIR RICHARD BURTON: THE SECRET AGENT WHO MADE THE PILGRIMAGE TO MECCA, DISCOVERED THE KAMA SUTRA, AND ROUGHT THE ARABIAN NIGHTS TO THE WEST (1990). In addition, led with Speke the expedition into the Mountains of the Moon in search of the source of the Nile. Burton spoke 29 languages and was long before Lawrence of Arabia an Englishman who emerged himself in foreign cultures. Like Lawrence Burton was an obsessive writer of great talent and intellect who immersed himself in Araian Muslim culture (who disguised as a Muslim entered Mecca).\n\nMore biographies and focus have highlighted Burton over Speke. If you do not know the story it is best I not give it away here except to say Speke did not have the charisma or talent to provide for a lasting legacy. Richard Burton married late in life to a very interesting woman, Isabel. Their relationship and Burton’s story is well told in Mary S. Lovell’s biography, A RAGE TO LIVE, RICHARD AND ISABEL BURTON (1998).\n\nA very entertaining book about a fabulously interesting footnote to the people attracted to the challenge of the search for the Nile’s source is Pat Shipman’s TO THE HEART OF THE NILE, LADY FLORENCE BAKER AND THE EXPLORATION OF CENTRAL AFRICA (2004). Florence’s family was killed in the Hungry revolution which lead to her being kidnapped from a refugee camp and sold into slavery. Trained to be in a harem. At age 14 she was to be auctioned but a wealthy Englishman, Samuel Baker facilitated her escape (perhaps being outbid). Eventually, the two married and through a continued journey to keep Florence’s background hidden settled on an arduous attempt to journey upriver to find the source of the Nile. Instead, they found Lake Albert returning to celebrity in England.\n\nOf all these books one stands out as the most entertaining, well-written, and has become one of my all-time favorites. Tim Jeal’s STANLEY, THE IMPOSSIBLE LIFE OF AFRICA’S GREATEST EXPLORER (2007). Know mostly for his finding (with Bombay) Dr. Livingston famously saying, “Dr. Livingston, I presume?”Stanley’s reputation has been tarnished over decades casting him as an anti-African imperialist caught up in the madness of King Leopold of Belgium’s crimes in the Congo. Tim Jeal’s book does much to rehabilitate Stanley still warts apparent. Stanley’s is an amazing life story, serving for a time on both the South and North side in the American Civil War. In addition to searching for the source of the Nile (finally confirming that Speke’s Lake Victoria theory was correct) he also searched for the source of the Congo River. He was knighted in 1897. (Check this extraordinary book out.)\n\nFollowing STANLEY Tim Jeal wrote, EXPLORERS OF THE NILE, THE TRIUMPH AND TRAGEDY OF A GREAT VICTORIAN ADVENTURE (2011). Jeal, much like Alan Moorhead in THE WHITE NILE covers almost all of the major Explorers that attempted to find the source of the Nile. So when I saw that Candice Millard had chosen this much-told story I wondered why beyond it is one that never bores in its telling. And Millard does the story justice and I enjoyed revisiting all of these interesting stories and characters. My problem with the book is that I did not find a lot that was fresh or new to the story. But that is more my problem than that of the author, as she has written a great book for a new generation. Those who are captivated by this adventure and the conflict between these two strong-willed men should enjoy Millard’s fine telling.",
        "stars": "4.0"
      },
      {
        "userName": "J. Hanson",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book, like Millard's earlier book, River of Doubt, should have been a five-star book. Her research is first-rate, her storytelling superb, her exploration of character excellent without being intrusive or self-centered. I'm glad I read both books, and I learned a lot from each.\n\nWhy then only four stars? Almost exclusively due to two things, which many readers might not even notice, but which my wife and I, as writers and editors, found maddening to the point of distraction—and which detracted from our enjoyment.\n\nFor some reason, Candice is obsessed with sentence structure employing the one-word clause, \",however,\" sometimes to the tune of five or six times on a single page—even in places where it was utterly unnecessary, or where a simple \"but\" would have sufficed. I first noticed it in River of Doubt, which I read on my own. When I bought River of the Gods to read aloud to my wife, I warned her of my experience with the previous book, and wondered aloud if the obsession would continue. Indeed it did, to our amusement and then annoyance. I finally resorted to constant, instant editing to relieve us both of the pain.\n\nSimilarly, Candice manically overuses the conjunction \"that\" hundreds of times where it is superfluous. Example: \"The Geographical Society hoped that he might be willing to accompany the expedition into the interior, but Burton hoped that he would turn them down.\" Both \"thats\" are unnecessary and make the sentence read extremely awkwardly. Again, this is repeated ad nauseam throughout the book.\n\nI have scant hope either Candice or her editor will read this, so consider it a rant. I do hope Candice continues her explorations into history, but I also hope she is assigned an editor with some knowledge of and sympathy for the marvelous grace of the English language.",
        "stars": "4.0"
      },
      {
        "userName": "Beguiled By Books",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Favorite Quote: “Nothing,” he wrote, “vexes the mind so much as feeling one’s self injured in a way that cannot be prevented or avenged.”\n\nSynopsis: River of the Gods is the story of the explorers who sought the source of the White Nile. Millard dives into the lives of Burton and Speke, the two main explorers who attempted this mission several times. During the height of this exploration, very few Europeans had ventured into the heart of Africa, but Burton and Speke, both together and separately, would attempt multiple times. This book chronicles the plethora of individuals involved in those explorations and the rivalries between explorers and countries.\n\nThoughts & Feelings: I enjoyed this book, but it was a slow read. It’s incredibly detailed and thoroughly researched. This book is narrative non-fiction, which means it’s non-fiction, but reads like a story. The story starts strong and you feel compelled to learn more about these unorthodox gentlemen (for their time).\n\nMillard also does an excellent job pointing out colonization and recognizes where written history changed the names of certain places. She also goes above and beyond, including the women who influenced the male explorers and those who aided the explorations.",
        "stars": "4.0"
      },
      {
        "userName": "Leslie Koorhan",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is a fantastic story of 2 explorers and their search for the source of the Nile. Sir Richard Burton (the 19th century linguist and explorer) and John Speke, his sometimes partner and then rival, are very memorable characters in this book. But of great interest is Ms. Millard's coverage of the history and background of the events of this book. She is one of the best historians and storytellers around today. This is her 4th book that I have read and every one of them are great thrillers as well as historical. She makes history come alive and I look forward to her next.",
        "stars": "5.0"
      },
      {
        "userName": "Sherry H.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Very interesting book about the source of the Nile.",
        "stars": "4.0"
      },
      {
        "userName": "Richard",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A history book that reads like a novel, except for it’s true it’s about finding the headwaters of the Nile. Read it and share it with friends you can hardly put it down.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B09BTJNJCX\nPublisher ‏ : ‎ Anchor (May 17, 2022)\nPublication date ‏ : ‎ May 17, 2022\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 25099 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 424 pages"
  },
  {
    "title": "Into Thin Air",
    "author": "Jon Krakauer",
    "ratingCount": "20,529 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "#1 NATIONAL BESTSELLER • The epic account of the storm on the summit of Mt. Everest that claimed five lives and left countless more—including Krakauer's—in guilt-ridden disarray. \"A harrowing tale of the perils of high-altitude climbing, a story of bad luck and worse judgment and of heartbreaking heroism.\" —PEOPLEA bank of clouds was assembling on the not-so-distant horizon, but journalist-mountaineer Jon Krakauer, standing on the summit of Mt. Everest, saw nothing that \"suggested that a murderous storm was bearing down.\" He was wrong. By writing Into Thin Air, Krakauer may have hoped to exorcise some of his own demons and lay to rest some of the painful questions that still surround the event. He takes great pains to provide a balanced picture of the people and events he witnessed and gives due credit to the tireless and dedicated Sherpas. He also avoids blasting easy targets such as Sandy Pittman, the wealthy socialite who brought an espresso maker along on the expedition. Krakauer's highly personal inquiry into the catastrophe provides a great deal of insight into what went wrong. But for Krakauer himself, further interviews and investigations only lead him to the conclusion that his perceived failures were directly responsible for a fellow climber's death. Clearly, Krakauer remains haunted by the disaster, and although he relates a number of incidents in which he acted selflessly and even heroically, he seems unable to view those instances objectively. In the end, despite his evenhanded and even generous assessment of others' actions, he reserves a full measure of vitriol for himself. This updated trade paperback edition of Into Thin Air includes an extensive new postscript that sheds fascinating light on the acrimonious debate that flared between Krakauer and Everest guide Anatoli Boukreev in the wake of the tragedy.  \"I have no doubt that Boukreev's intentions were good on summit day,\" writes Krakauer in the postscript, dated August 1999. \"What disturbs me, though, was Boukreev's refusal to acknowledge the possibility that he made even a single poor decision. Never did he indicate that perhaps it wasn't the best choice to climb without gas or go down ahead of his clients.\" As usual, Krakauer supports his points with dogged research and a good dose of humility. But rather than continue the heated discourse that has raged since Into Thin Air's denouncement of guide Boukreev, Krakauer's tone is conciliatory; he points most of his criticism at G. Weston De Walt, who coauthored The Climb, Boukreev's version of events. And in a touching conclusion, Krakauer recounts his last conversation with the late Boukreev, in which the two weathered climbers agreed to disagree about certain points. Krakauer had great hopes to patch things up with Boukreev, but the Russian later died in an avalanche on another Himalayan peak, Annapurna I. In 1999, Krakauer received an Academy Award in Literature from the American Academy of Arts and Letters--a prestigious prize intended \"to honor writers of exceptional accomplishment.\"  According to the Academy's citation, \"Krakauer combines the tenacity and courage of the finest tradition of investigative journalism with the stylish subtlety and profound insight of the born writer.  His account of an ascent of Mount Everest has led to a general reevaluation of climbing and of the commercialization of what was once a romantic, solitary sport; while his account of the life and death of Christopher McCandless, who died of starvation after challenging the Alaskan wilderness, delves even more deeply and disturbingly into the fascination of nature and the devastating effects of its lure on a young and curious mind.\"",
    "numberOfPages": "368",
    "reviews": [
      {
        "userName": "Aletheia Knights",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Almost twenty years ago, journalist Jon Krakauer joined a guided expedition to the top of Mount Everest, led by accomplished high-altitude climber and guide Rob Hall. Ostensibly on assignment to write a magazine piece on the increasing commercialization of Everest, as outfits like Hall's made it possible for climbers with more disposable income than actual mountaineering experience to have a go at the summit, Krakauer knew this might be his only chance to fulfill his own boyhood dream by standing atop the highest mountain on earth. An enthusiastic climber since childhood - though with no experience whatsoever at very high altitudes - he was one of the most technically proficient clients on Hall's team, and on May 10, 1996, he made it to the summit. On the way back down the mountain, however, Hall's group was one of several expeditions caught up suddenly in a violent snowstorm. Krakauer, farther down the mountain than most of his teammates when the storm hit, made it safely back to the tents before he collapsed in exhaustion. He woke to discover that triumph had given way to terror and tragedy: several guides and clients, including Hall, were still out there in the storm, their bodies becoming increasingly vulnerable to the subzero temperatures as their supplemental oxygen supplies dwindled. \"By the time I'd descended to Base Camp,\" Krakauer reflects in the Introduction, \"nine climbers from four expeditions were dead, and three more lives would be lost before the month was out.\"\n\n\"Into Thin Air,\" written within six months of Krakauer's return from Everest, is the product of his attempts to process exactly what happened up there, how things could go so very wrong and so many very experienced climbers, some of whom had summitted Everest several times before, could have lost their lives: \"I thought that writing the book might purge Everest from my life. It hasn't, of course. Moreover, I agree that readers are often poorly served when an author writes as an act of catharsis, as I have done here. But I hoped something would be gained by spilling my soul in the calamity's immediate aftermath, in the roil and torment of the moment. I wanted my account to have a raw, ruthless sort of honesty that seemed in danger of leaching away with the passage of time and the dissipation of anguish.\" Thanks perhaps to the years spent honing his craft as a writer and his discipline as a journalist with deadlines to meet, Krakauer succeeds brilliantly in what he has set out to do. His account is nowhere rushed, hysterical, or lacking in polish; rather, it's a well-told story, supported by carefully researched background and dozens of interviews with other participants in the events, and Krakauer is so much in control of his narrative that it comes almost as a shock how much of a genuine emotional wallop it packs.\n\nPerhaps only a man who stood on the summit of Everest after years of dreaming, only to regret afterwards that he'd ever gone, could tell this story the way Krakauer does, neither glossing over the dangers of the mountain or the waste of good human lives, nor denying the challenge it poses the human spirit simply by being the highest spot on the earth's surface, simply, in the words of a man who died on Everest decades before, \"because it is there.\" \"Into Thin Air\" is a thrilling, if sobering, tale of adventure. Let's be honest, reading a book like this is as close as most of us are ever going to get to climbing the great mountain - and Krakauer describes so well the challenges of the terrain, the moments of astonishing beauty, the plodding determination that carries the exhausted body ever onward, the effects of high altitude on the body and mind, that our vicarious ascent in his company is thoroughly satisfying. He brings his fellow climbers alive for us, too, in brief but vivid verbal portraits. We are told not only of their mountaineering prowess, but their determination, their amiability, their families, their human faults and foibles. Even though we've known pretty much all along who dies and who lives (the book is dedicated to the memory of those who died, and a photograph of the mountain between the introduction and first chapter is labeled with a map of their route indicating where major events took place, including several deaths), by the time the storm sweeps in we've come to care about these people, to hope without hope, to mourn their deaths, to celebrate every time a survivor makes it to safety.\n\nSome readers have labeled Krakauer arrogant and accused him of placing blame on everyone but himself, but I didn't find this to be the case. He comes down against the practice of guides leading commercial expeditions of clients without the skills or experience to make the climb without constant hand-holding, but he acknowledges that he himself didn't rightly belong there, and has nothing but praise for the skills of Rob Hall and the other guides he knew personally. He doesn't hesitate to point out errors of judgment that might have facilitated or compounded the perils of the situation, but it's more in the nature of pointing out the fallibility of human nature and the general unreliability of the human brain in a state of hypoxia (which, 8000 meters above sea level, supplemental oxygen can only partially mitigate) than pointing fingers or placing blame. There are no villains (except perhaps Ian Woodall, literally the only one of dozens of people he met on Everest of whom Krakauer had nothing good to say whatsoever, who for no apparent reason denied the use of his radio to help maintain contact with survivors and coordinate rescue attempts), but plenty of heroes: men and women who risked their lives venturing exhausted into a storm to rescue others, who held their own grief at bay to console the dying, who handed over their own precious bottles of oxygen to those in greater need, who calmly coordinated communications and rescue efforts during a time of crisis, or who simply managed to keep breathing when it would have been so much easier and less painful to fall asleep forever in the snow. That some of these fine, heroic men and women made the occasional mistake or bad decision says more about the risky nature of their undertaking than about them as individuals. Krakauer doesn't exempt himself from folly or fallibility, either, and in fact he's far harder on himself than he is on any of the others who were with him on the summit that day, living or dead. And granted that the fortitude, endurance, determination, and self-confidence necessary to tackle Everest tend to come hand-in-hand with a certain swagger and cockiness, Krakauer doesn't come across as particularly arrogant. This is a man who lets his readers see him, in the last chapter, broken by grief and survivor's guilt, lying across a bed naked and high on cannabis, with thick sobs \"erupting out of my nose and mouth in a flood of snot.\"\n\nThere's enough controversy surrounding the events on Everest in 1996, and particularly Krakauer's accounting of them, that readers who truly wish to understand what happened on the mountain that sad day probably shouldn't rely on this book alone. Fortunately, a number of other books on the subject exist, including at least four other memoirs by survivors of the disaster. \"Into Thin Air,\" however, remains in any case a good place to start - and a thrilling, if ultimately haunting, read.",
        "stars": "5.0"
      },
      {
        "userName": "John Jenkins",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book was recommended to me by people who knew that I am a backpacker. If I didn’t know it before reading this book, I quickly realized that there are huge differences between backpacking and mountaineering (not the least of which is cost: $65,000 for permit/guide/sherpa services for one person to climb Everest in 1996 compared to a $15 permit to backpack the John Muir Trail in 2021).\n\nSome reviewers have suggested that the author could have done more to try to save the lives of the nine climbers who died on Everest in May, 1996. The author makes it clear that he will always be haunted by survivor’s guilt – partly because Rob Hall, the leader of his group (Adventure Consultants), took on some risks that he might have resisted without having the journalist along. But he also makes it clear that it took all his physical abilities and his will to survive the descent of Mount Everest. As with most - if not all - of the other members of the expeditions, Mr. Krakauer had no energy left to pursue the missing climbers and he was probably not coherent enough to realize that they were missing.\n\nMr. Krakauer admits that most of the gear was carried by sherpas, and his own backpack held little more than a jacket, a few candy bars, and his camera. This makes the reader wonder if the constant nausea that he felt would have been mitigated with healthier food (trail mix or beef jerky?). And if the author carried a camera, why are there no photographs in this book? I only read the Kindle version, and it is possible that the hardcover or paperback versions did have photographs.\n\nThe author demonstrates his humility and economic illiteracy by inserting an incident that occurred on the hike to the base camp. Beck Weathers, another member of the Adventure Consultants team, was discussing the futility of minimum wage laws, and Mr. Krakauer suggested that raising the minimum wage might be a good idea; then admits that Mr. Weathers “made hash out of [his] fumbling avowal.” Disagreeing with Beck Weathers was a mistake because there is no good argument to support minimum wage laws, but the author probably inserted this anecdote to show that a relationship that started out with acrimony ultimately grew close as they shared the Everest experience.\n\nMr. Krakauer directs some criticism and praise to Anatoli Boukreev, a Russian who served as guide for the Mountain Madness expedition team that attempted to summit Everest the same day as Krakauer and his Adventure Consultants team. He criticizes Boukreev for climbing without oxygen (it is not unusual for strong climbers like Boukreev when climbing solo or with other strong climbers to eschew oxygen tanks; but when serving as a guide for weaker climbers, the extra strength provided by oxygen is considered appropriate) and for descending from the summit ahead of the clients. He also praises Mr. Boukreev for going out into the storm to try to rescue lost climbers. In 1997, Mr. Boukreev collaborated with G. Weston DeWalt to write “The Climb.” This book differed from “Into Thin Air” in several aspects and portrayed Mr. Boukreev’s actions in a more favorable light. A feud erupted between the authors and this feud is summarized in Mr. Krakauer’s extensive, 40-page postscript. Mr. Krakauer directs most of his criticism toward Mr. DeWalt for not performing more research, not interviewing more people, and not correcting the errors that Mr. Krakauer documented and requested in later editions of “The Climb.” Mr. Krakauer also tried to reconcile with Mr. Boukreev, but unfortunately Mr. Boukreev died in a Christmas Day 1997 avalanche in the Himalayas. The last sentence of the postscript was the opinion of Italian Simone Moro, Boukreev’s climbing partner: “When judging the decisions made by Anatoli in 1996 you must remember this: no clients on his team died.” I commend Mr. Krakauer for resisting the urge to add, “Yes, but Scott Fischer, the Mountain Madness expedition leader, did die.”",
        "stars": "3.0"
      },
      {
        "userName": "Nick Crisanti",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Wow. An amazing, suspenseful, adventure that, unfortunately, ends tragically. Krakauer captures the thrill of the climb and the direness of a crisis with gripping prose. It's indicative of the dichotomy of Mount Everest that you can stand on top of the world, exhausted yet euphoric, one minute and then be on the verge of complete capitulation while fighting for your very survival the next. And to deliver such extremes to the reader without diminishing emotion or excitement is a mark of a true writer. I was thoroughly engaged throughout, invested in each climber's ordeal, and captivated by the awesome, unforgiving mountain that so many desire to conquer.",
        "stars": "5.0"
      },
      {
        "userName": "Eric",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Great book. One of the best mountaineering books I’ve read. Not quite Touching the Void but close. My only gripe is that Jon tends to address the names of the “characters” in the book sometimes by first name, sometimes by last name, and sometimes by nick name. So it can be hard to follow along with who is doing what.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B000FC1ITK\nPublisher ‏ : ‎ Anchor; 1st edition (November 12, 1998)\nPublication date ‏ : ‎ November 12, 1998\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 4969 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 368 pages\nPage numbers source ISBN ‏ : ‎ 0307475255"
  },
  {
    "title": "Brave the Wild River: The Untold Story of Two Women Who Mapped the Botany of the Grand Canyon",
    "author": "Melissa L. Sevigny",
    "ratingCount": "145 ratings",
    "ratingStarts": "4.5 out of 5 stars",
    "synopsis": "The riveting tale of two pioneering botanists and their historic boat trip down the Colorado River and through the Grand Canyon.In the summer of 1938, botanists Elzada Clover and Lois Jotter set off to run the Colorado River, accompanied by an ambitious and entrepreneurial expedition leader, a zoologist, and two amateur boatmen. With its churning waters and treacherous boulders, the Colorado was famed as the most dangerous river in the world. Journalists and veteran river runners boldly proclaimed that the motley crew would never make it out alive. But for Clover and Jotter, the expedition held a tantalizing appeal: no one had yet surveyed the plant life of the Grand Canyon, and they were determined to be the first.Through the vibrant letters and diaries of the two women, science journalist Melissa L. Sevigny traces their daring forty-three-day journey down the river, during which they meticulously cataloged the thorny plants that thrived in the Grand Canyon’s secret nooks and crannies. Along the way, they chased a runaway boat, ran the river’s most fearsome rapids, and turned the harshest critic of female river runners into an ally. Clover and Jotter’s plant list, including four new cactus species, would one day become vital for efforts to protect and restore the river ecosystem.Brave the Wild River is a spellbinding adventure of two women who risked their lives to make an unprecedented botanical survey of a defining landscape in the American West, at a time when human influences had begun to change it forever.",
    "numberOfPages": "302",
    "reviews": [
      {
        "userName": "Kevin Johnson",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "'Brave the Wild River' recounts the incredible journey of two trailblazing women scientists as they embarked on a daring early Colorado River expedition, venturing through the breathtaking canyonlands of the Southwestern U.S., including the Grand Canyon itself. Being the first women to take on this daring adventure, their mission was to collect botanical specimens, and they did so remarkably well. However, what sets this book apart is how the author weaves an enthralling adventure tale that seamlessly blends nature writing, natural history science, human history, and the current water politics of the river.\nThe narrative takes you on thrilling escapades one moment and envelops you in serene beauty while describing the deep canyons the next. Having spent countless years exploring these canyons myself, I can attest that the story of these two botanists has become legendary among river lore. Discovering the intricate details of their remarkable journey was truly captivating.\nI wholeheartedly recommend this book to anyone considering a Colorado River trip, those who have already experienced it, and anyone with an interest in adventure chronicles, nature writing, or the captivating allure of the Southwest.\nThis is definitely a must-read!",
        "stars": "5.0"
      },
      {
        "userName": "Rachaelbookhunter",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "My first nonfiction read of the year and it was a good one! Brave The Wild River is the story of two women who mapped the botany of the Grand Canyon. In 1938 Elzada Clover and Lois Jotter set off on an expedition down the Colorado River with three male boatmen and their leader. The Colorado River was the most dangerous river in America and only a few people had ever attempted the rapids. No one had yet surveyed the plants in the Grand Canyon and the two botanists wanted to be the first. It was a very important but dangerous job.\n\nTheir story is exciting, interesting, and informative. Within the first few pages I had already learned a lot. Botany was considered a girly science, yet women didn't hold high-ranking jobs. Collecting plants while out for a stroll was nice but white water rafting was dangerous and incomprehensible. These women had to deal with a lot just to live their dream.\n\nAnd then there was the river. I felt like I was right there with them. The descriptions of the river and Grand Canyon are so beautiful and well done. You can imagine how everyone felt on the 43 day journey. This story is well researched and well written. We get the history of the river, the native people who originally lived there, and how everything changed when people came with money and big plans.\n\nIf you are interested in nature, the Grand Canyon, exploring, or women's stories then you will like this. I highly recommend it. It's so interesting and fun to read. I was a little sad when I got to the last page because I had such a good time.\n\nThank you so much to the publisher & Netgalley for the chance to read! All opinions are my own.",
        "stars": "5.0"
      },
      {
        "userName": "James Prothero",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is a great account, written with a novelist's skill, that brings the reader into the visceral experience of the sun and sand and wind and water on your skin. Not only history, but almost as good as being actually there.",
        "stars": "5.0"
      },
      {
        "userName": "Lynda R. Neely",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book is absolutely amazing. Having run the Colorado many years ago this book made me want to go back. The descriptions are lovely, impressive, and dangerous at the same time. It is a truly romantic writing showing how much the author loves the subject. I have traveled all over the world but if you have not viewed the Colorado River up close and personal, you have missed a true treasure.\nTreat yourself and read this book.",
        "stars": "5.0"
      },
      {
        "userName": "Val",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This expedition was unknown to me before I read this book, so I appreciate the author bringing a story from the past and documenting it to share.\n\nWhile this story highlights both Elzada Clover and Lois Jotter's contribution to the expedition, I do not feel the expedition could have been successful without the help of Nevills and the other men included on the trip. At times in the story the women complained of having to leave the boat and walk along the river, but that decision was made for the safety of the women and for the fact that physically the men could have handled the rapids better. It was considered a dangerous expedition; the 277-mile stretch through the Grand Canyon was considered to have a lot of rapids. some previous expeditions were not successful and that is discussed in the book too.\n\nThe reason I only gave this book 3 stars is because it did not discuss enough of the harmful ecological effects that the Colorado River has suffered though, since the implementation of the first dam and the current crisis the river is facing.\n\nThe book included details about racism, lack of women rights along with a story given about Lois Jotter and how her home was considered a safe place for same-sex couples to have conversations, but this book completely lacked enough information about the health of the Colorado River and how its future is a real concern.\n\nAfter reading the book, I found more information that should have been included: The Colorado River is the number one most threatened and endangered U.S. River according to AmericanRivers.org; a result of poor water management and drought. The river has lost 20% of its size due to the destruction of the river and the mismanagement of its waters. There are 15 dams on the Colorado River, and they have caused a lot of destruction to the river and surrounding area.\n\nI would have liked to read a whole chapter on the health of the Colorado River before the expedition, during and after - with an update to state of the river today. This was only briefly mentioned, but I found the Colorado River so fascinating that I think it would have added a lot to the story to give further details.\n\nI hope the health of the Colorado River will be taken into consideration when leaders create future policies concerning the river and will also have the support of the American people to protect its waters.",
        "stars": "3.0"
      },
      {
        "userName": "James W. Evans",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is a beautifully prepared and presented work detailing the grueling trip down the Colorado River by six rugged individuals, which included two first class botanists ( who just happen to be women). It is a sure fire page turner full of day to day descriptions of their activities. As for Clover and Jotter, I wish I could have met them.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0BHPRKW1Y\nPublisher ‏ : ‎ W. W. Norton & Company (May 23, 2023)\nPublication date ‏ : ‎ May 23, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 11671 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 302 pages"
  },
  {
    "title": "Undaunted Courage: Meriwether Lewis, Thomas Jefferson and the Opening of the American West: Meriwether Lewis Thomas Jefferson and the Opening",
    "author": "Stephen E. Ambrose",
    "ratingCount": "6,112 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "From the New York Times bestselling author of Band of Brothers and D-Day, the definitive book on Lewis and Clark’s exploration of the Louisiana Purchase, the most momentous expedition in American history and one of the great adventure stories of all time.In 1803 President Thomas Jefferson selected his personal secretary, Captain Meriwether Lewis, to lead a voyage up the Missouri River to the Rockies, over the mountains, down the Columbia River to the Pacific Ocean, and back. Lewis and his partner, Captain William Clark, made the first map of the trans-Mississippi West, provided invaluable scientific data on the flora and fauna of the Louisiana Purchase territory, and established the American claim to Oregon, Washington, and Idaho. Ambrose has pieced together previously unknown information about weather, terrain, and medical knowledge at the time to provide a vivid backdrop for the expedition. Lewis is supported by a rich variety of colorful characters, first of all Jefferson himself, whose interest in exploring and acquiring the American West went back thirty years. Next comes Clark, a rugged frontiersman whose love for Lewis matched Jefferson’s. There are numerous Indian chiefs, and Sacagawea, the Indian girl who accompanied the expedition, along with the French-Indian hunter Drouillard, the great naturalists of Philadelphia, the French and Spanish fur traders of St. Louis, John Quincy Adams, and many more leading political, scientific, and military figures of the turn of the century. High adventure, high politics, suspense, drama, and diplomacy combine with high romance and personal tragedy to make this outstanding work of scholarship as readable as a novel.",
    "numberOfPages": "538",
    "reviews": [
      {
        "userName": "Dmckinleyp",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Stephen Ambrose's \"Undaunted Courage\" is a great entry in the ranks of what you might call popular history...books with a serious purpose and covered in the right amount of depth to fully inform the reader, without the extensive detail that characterizes history written for historians. It focuses more on Captain Meriwether Lewis than on Captain William Clark, in fact it is as much a biography of Lewis as an account of the expedition, as the subtitle makes clear: \"Meriwether Lewis, Thomas Jefferson, and the opening of the American West.\" Not that Clark was a mere supporting character, far from it, but Lewis bore the greater responsibility of planning the journey and reporting directly to Jefferson and Congress on their progress and results. He also received greater reward afterward, including appointment as Governor of the territory of Louisiana in 1807 - which had tragic consequences, which I will leave to the reader to discover.\nAfter a 100-page section outlining Lewis's early life and career, the historical background, and his and Jefferson's ambitious planning of the project, Undaunted Courage follows the Lewis and Clark expedition from its beginnings in the Pittsburgh area to its successful goal of reaching the Pacific coast, and then back again. It seems there is a huge body of historical literature covering the expedition in great detail, so Ambrose's purpose was to distill it to a volume more readable to the average person. You can learn the technical and human challenges that Lewis and Clark, and their Corps of Discovery, had to overcome, at every juncture on the journey. You will learn how the Corps varied in number depending on its needs, with several men included only so far as the trip to the mouth of the Missouri, where the \"core Corps\" followed the main path to the West, which of course was the main objective of their mission. There was much more interaction with the various Indian tribes than I expected, including their long winter with the large Mandan tribe in 1804-1805, where they roamed far and wide, studied their cultures, partied with the Indians (and slept with their wives), and prepared for the long push up the western stretch of the River and to cross the Rocky mountains.\nA few impressions from this book:\n- I was struck by the different experiences Lewis and Clark had with the Indian tribes they encountered. The Mandans of North Dakota, who shared their quarters with the Corps, were very friendly and did not bargain too hard with the White men for supplies and horses. So too the Nez Perce were extremely generous, and worried about the Corps' fate when they attempted to cross the Bitter Root mountains in early Spring before the snow melted, in June 1806. But the Teton Sioux and the Blackfeet tribes, both very warlike and feared by other Indians, caused terrible trouble, and Lewis's small, separated party finally had a small battle with Blackfoot horse-thieves in Montana in July 1807, before escaping on canoes down the Missouri River. This just scratches the surface of the Corps' Indian experience, and you should know Lewis wrote lengthy notes about the ethnology of all the tribes he met.\n- While the Corps did not lose any men to violence, they lost only one man to illness. Sergeant William Floyd died of appendicitis early in the journey, and was buried on a hill overlooking the Missouri. The men were often sick, and all of them, especially Lewis who nearly died in late 1806, suffered from dysentery from poor diets - often subsisting entirely on plant roots. It is a tribute to both Lewis and Clark's medical skills they kept the men healthy enough to continue, after necessary rest and recovery. In fact, the two leaders' determination and toughness were an absolute inspiration to all their men.\n- Their lowest point was the winter spent in the small fort they built near the Oregon coast. It was named Fort Clatsop, for the nearby tribe. They had enough to eat but the weather was consistently wet, cold and windy. There was very little recreation, and the Clatsops, while friendly enough, tried to take advantage of the white men's hospitality.\n- Lewis and Clark discovered \"immence\" herds of buffalo that covered the plains for miles. (Their spelling was atrocious, but so was most peoples spelling back then - they were still very articulate and wrote extensive notes on the Indians, geography, and flora and wildlife they encountered.) The bison were so tame the men often walked right through the herds. Which is remarkable, since the Indians, thanks to horses and a few guns they had, hunted the buffalo very heavily, showing the white men some of their techniques. The Corps also hunted elk, beaver, and antelope, when they could get close enough. They ate huge amounts of meat so they could keep going, often 6 pounds a day per man.\n- Almost no American anticipated the heights or distances in crossing the Rocky Mountains. Captain Lewis was in awe on first seeing them, and discouraged at the prospect of crossing them, which they had to do with snowy trails in many stretches. It is more testimony to Lewis and Clark's leadership that they survived the crossing, both ways.\n- Lewis and Clark were not only tough military leaders, they were astute judges of how far to push their luck. Still, the book assesses a few of their weaknesses, such as failing to take full advantage of the linguistic skills of Sacagawea, the Shoshone woman (married to a French trader) who joined the expedition soon after St. Louis.\n- Finally, while there was very little violence during the journey, all the men showed the necessary courage and toughness it required. They stood down potentially hostile Indians, they negotiated in good faith with all they tribes they traded with (with one exception which I will leave you to read about), and did their utmost best to represent friendly and honest ambassadors from the US government, which of course had just purchased most of the land they traveled from the French. Lewis and Clark's expedition was executed about as flawlessly as President Jefferson could have ever hoped. It is a bright and shining example of American greatness early in our history.\nAmbrose has essentially done the heavy lifting for us readers, telling an amazing story gathered from 200 years of notes and other histories. without sacrificing anything important. As such, \"Undaunted Courage\" is a tremendous achievement, and a book anyone with more than a passing interest in US history should read.",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Bought this as a Father’s Day gift and my dad devoured it.",
        "stars": "5.0"
      },
      {
        "userName": "YV",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Hardy good read",
        "stars": "5.0"
      },
      {
        "userName": "Tim Bates",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Ambrose is one of my favorite authors because he does both excellent research and summarizes other authors’ work with clarity and respect. He gives me a good sense of the characters’ motivations and what life was like on the expedition.",
        "stars": "5.0"
      },
      {
        "userName": "Phelix",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Every US student knows about Lewis & Clark. But reading the daily details of what they faced on the trail, how they were used by Washington, and attempts to monetize and control the story afterwards gives a true perspective on how groundbreaking this journey was, for both the men and the country. The book kind of fizzled out at the end, but then so did the journey.",
        "stars": "5.0"
      },
      {
        "userName": "W. Lee",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Ambrose made me experience the expedition as if I were there: making the decisions that Lewis made, observing the plants and animals, and even messing up relations with the Native Americans. The account was very approachable by non-scholars. I'm not aware of any film adaptation of the expedition, but it's better that it stays in written form, as an almost mythic story of the American expansion.\n\nI didn't like some of Ambrose's speculations at the end. I won't spoil it for those who aren't already familiar with Lewis's biography.\n\nThis is an absolute must-read for any American citizen and anyone else interested in the Jeffersonian era.",
        "stars": "5.0"
      },
      {
        "userName": "James Nordin",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Ambrose, as he says, decided to link Lewis and Jefferson because \"everyone loves Jefferson\". Ambrose says Lewis is not a racist because he likes some Indians and dislikes others. But as a Virginia \"gentleman\" he doesn't consider Blacks as real people to be judged individually. I'm this respect he was as complicated and hypocritical as Jefferson (who Ambrose describes as the most human rights oriented American leader ever - despite him owning over 200 humans, including his children and their mother). In the conclusion, Ambrose tried to balance the greatness and glass of Lewis, but tends up entirely positive. Just reading the book, it is very hard to come to that conclusion.",
        "stars": "3.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B00AK78P8W\nPublisher ‏ : ‎ Simon & Schuster; 1st edition (April 23, 2013)\nPublication date ‏ : ‎ April 23, 2013\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 12946 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 538 pages"
  },
  {
    "title": "Into the Wild",
    "author": "Jon Krakauer",
    "ratingCount": "19,474 ratings",
    "ratingStarts": "4.4 out of 5 stars",
    "synopsis": "NATIONAL BESTSELLER • In April 1992 a young man from a well-to-do family hitchhiked to Alaska and walked alone into the wilderness north of Mt. McKinley. Four months later, his decomposed body was found by a moose hunter. This is the unforgettable story of how Christopher Johnson McCandless came to die.\"It may be nonfiction, but Into the Wild is a mystery of the highest order.\" —Entertainment WeeklyMcCandess had given $25,000 in savings to charity, abandoned his car and most of his possessions, burned all the cash in his wallet, and invented a new life for himself. Not long after, he was dead. Into the Wild is the mesmerizing, heartbreaking tale of an enigmatic young man who goes missing in the wild and whose story captured the world’s attention. Immediately after graduating from college in 1991, McCandless had roamed through the West and Southwest on a vision quest like those made by his heroes Jack London and John Muir. In the Mojave Desert he abandoned his car, stripped it of its license plates, and burned all of his cash. He would give himself a new name, Alexander Supertramp, and, unencumbered by money and belongings, he would be free to wallow in the raw, unfiltered experiences that nature presented. Craving a blank spot on the map, McCandless simply threw the maps away. Leaving behind his desperate parents and sister, he vanished into the wild.Jon Krakauer constructs a clarifying prism through which he reassembles the disquieting facts of McCandless's short life. Admitting an interest that borders on obsession, he searches for the clues to the drives and desires that propelled McCandless. When McCandless's innocent mistakes turn out to be irreversible and fatal, he becomes the stuff of tabloid headlines and is dismissed for his naiveté, pretensions, and hubris. He is said to have had a death wish but wanting to die is a very different thing from being compelled to look over the edge. Krakauer brings McCandless's uncompromising pilgrimage out of the shadows, and the peril, adversity, and renunciation sought by this enigmatic young man are illuminated with a rare understanding—and not an ounce of sentimentality. Into the Wild is a tour de force. The power and luminosity of Jon Krakauer's stoytelling blaze through every page.",
    "numberOfPages": "231",
    "reviews": [
      {
        "userName": "Fyrecurl",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "NARRATIVE ARC AND PARALLEL STRUCTURE– IN A NON-FICTION NOVEL\nWhen Jon Krakaur wrote an account of the untimely death of a young man who went into the wilds of Alaska with little more than his wits, he was faced with the daunting task of how he would write the story. In this creative non-fiction story, Krakaur used craft techniques that he could use in keeping a reader interested, particularly where most readers would know the ending before the story even began. Krakaur had already reported about Christopher Johnson McCandless’ fateful quest in Outside magazine. McCandless obviously examined the structure of any story, exposition, rising action, crisis, climax and denouncement, or resolution, and began to form how best to tell McCandless’ tragic story. He borrows the narrative arc technique from fiction, and uses parallel structure, interspersing several small stories, each with a different protagonist and antagonist, but with a common theme running through each, that ties the resolution together.\nKrakaur’s story has a quasi-linear plot, with characters and setting, rising action, with conflicts and complications, and finally a resolution, where the ultimate question that had plagued the character from the start is resolved—except there are two main characters in this story, a story of layered structure, similar to Emily Bronte’s epic story, Wuthering Heights—McCandless, who, prior to his death finds that true happiness can only be found in sharing it, (Krakaur, 189) and Krakaur himself, who tells the story of his investigation and resolves the mystery of McCandless death that had been plaguing him for some time; poison sweet pea berries actually killed McCandless, not starvation from inexperience; and at the end, the restless look in his eyes was replaced with a look of serenity and peace. (Krakaur, 198-99).\nFrom start to finish, the story is simply about this educated young man from a well-to-do Washington D.C. family who hitchhiked to Alaska in April of 1992, walked into the Alaskan forest with a small caliber hunting rifle, and minimal provisions, and died of what appeared to be starvation after surviving several months in the wild. The readers simply thought McCandless an imprudent, idealist who was ill prepared to meet the challenge. Krakaur wrote, “McCandless was ridiculously ill prepared [] he had no business heading into any wilderness … [there was] only one word for the guy: incompetent.” (Krakaur, 177). In researching, and investigating this case for a novel, Krakaur found out differently.\nHaving been a similar wild youth, Krakaur wanted to show the reader “Why” some men hear the call of the wild, and do things that most others would be satisfied simply dreaming about. McCandless’ story was larger than life, and the perfect vehicle for Krakaur to propound his answer to the question. Although ostensibly about McCandless, this story is Krakaur’s memoir—his memory’s truth, stating: “I was haunted by the particulars of the boy’s starvation and by vague unsettling parallels in his life, and those of my own”(Krakaur, Author’s note, p.2). He uses parallel structure to answer the resolution to an age old question, and the death of one young man—who found out too late, that “Happiness [is] only real when [it’s] shared”. (Krakaur, 189).\nIn using the stories of various other explorers, including his own, Krakaur proposes his theory, injecting it into the story as a resolution to the question that he poses in the beginning, why would someone want to walk deep into the bush and live off the land for a few months. (Krakaur, 4). Krakaur injects the question again through one of his characters, the boy’s mother, Billie: “I just don’t know why he had to take those kind of chances…” (Krakaur, 132). Thus, the reader is compelled to read on to find the answer, the resolution, that arrived after the death of the boy (climax of the story), and into the denouncement (resolution).\nKrakaur begins his story in medias res (Krakaur, 3) and McCandless is dropped off by Gallion, an man with some experience in Alaska, and rising action builds almost immediately from the introduction of these characters where he remarks:\nStill, Gallien was concerned. Alex admitted that the only food in\nhis pack was a ten-pound bag of rice. His gear seemed exceedingly minimal\nfor the harsh conditions of the interior, which in April still lay buried under\nthe winter snowpack. Alex’s cheap leather hiking boots were neither waterproof nor well insulated. His rifle was onl .22 caliber, a bore too small to rely on if he\nexpected to kill large animals like moose and caribou, which he would have to\neat if he hoped to remain very long in the county. He had no ax, no bug dope,\nno snowshoes, no compass. The only navigational aid in his possession was a\ntattered state road map he’d scrounged at a gas station. (Krakaur, 5).\nThis sets up the complications and conflict posed by man against nature, albeit not the main focus of the story. The action continues to rise throughout the author’s creative use of setting as he describes the land McCandless attempts to enter as ominous and remote. He writes: “A hundred miles out of Fairbanks the highway begins to climb into the foothills of the Alaska Range… the Stampede Trail … seldom traveled, [] isn’t even marked on most road maps of Alaska… in the middle of trackless wilderness north of Mt. McKinley.” (Krakaur, 5).\nThe story then jumps back to the preparations made by McCandless prior to his trek into the wild Alaska forest, breaking into the scenes of his troubled stay in the wild, and after describing the details of his short adult life, and death, it follows with Krakaur’s own memoir of not only his investigation (a layered technique) but the parallel story of his own youth, attempting to climb an impossible summit, and the stories of other persons who appeared to be equally imprudent.\nKrakaur’s character begins to emerge in Chapter 8, where he examines the criticism he received from readers after the story he wrote about McCandless. “The prevailing Alaska wisdom held that McCandless was simply one more dreamy half-cocked greenhorn who went into the country expecting to find answers to all his problems and instead found only mosquitoes and a lonely death.” (Krakaur, 72). Krakaur then descends into a series of several parallel stories of other explorers to show the reader why this theory of foolhardy youth is not the case in McCandless’ death. “Dozens of marginal characters have marched off into the Alaska wilds over the years never to reappear. A few have lodged firmly in the state’s collective memory.” (Krakaur, 72). He then tells the stories of counterculture idealists, military leaders, wealthy academics, writers, and photographers, like Rossellini, John Mallon Waterman, Carl McCunn, and Everett Reuss, with varying stories, some similar, others in contrast to McCandless. Reuss wrote: “I shall always be a lone wanderer, of the wilderness. God knows how the trail lures me… the lone trail is the best…I’ll never stop wandering… And when it comes to die, I’ll find the loneliest, most desolate, spot there is.” (Krakaur: Reuss, 91).\nBut Krakaur recognizes that McCandless was no idealist, no crackpot, nor foolhardy wanderer who took chances with his life, nor failed to appreciate the risks. McCandless writes: “If this adventure proves fatal and you don’t ever hear from me again I want you to know you are a great man. I now walk into the wild.” (Krakaur, 133-34). Having read the other parallel stories that ended in disaster for most, the reader is now enticed to find out why. It was his own portion of the book that was his memoir, that Krakaur feeds the reader a resolution to the story behind the death of McCandless.\nI was twenty three, younger than McCandless, when he walked\ninto the Alaska bush. My reasoning, if one can call it that, was\nenflamed with the scattershot passions of youth and a literary diet\noverly rich in the works of Nietzsche, Keroac, and John Menlove Edwards, the later a deeply troubled writer and psychiatrist who,\nbefore putting an end to his life with a cyanide capsule in 1958,\nhad been one of the preeminent British rock climbers of the day.\nEdwards regarded rock climbing as a “Psycho-neurotic tendency”;\nhe climbed not for sport, but to find refuge from the inner torment\nthat framed his existence. (Krakauer, 135).\nKrakauer allows the reader to draw its own conclusion but only after he sets up these parallel stories to draw the comparison. He further exalts McCandless’ obsession to go into the wilderness as not simply a youthful whim, but much more. He presents the reader with his own Alaskan wilderness story, replete with inner thoughts, and an epiphany, that strongly suggests the resolution the reader should find in the denoument of McCandless’ story. Although the grueling story of Krakauer’s experience to cross treacherous terrain to climb an icy face of Devil’s Thumb, seemed much more dangerous an ordeal than that which McCandless put himself through, the author completes the narrative arc quite effectively by drawing a resolution in parallel story of his feat. Comparing the “skewed relationships” each had with their fathers, the “similar intensity, similar heedlessness, and similar agitation of the soul”, the reader is satisfied that McCandless died from a freakish accident, and was driven to the wilderness not by a death wish but by some deep seated desire to accomplish some impossible feat that would help fix his broken life. (Krakauer, 155). The reader is compelled to believe McCandless, if he survived, would feel the same way as Krakauer, “I suffered from hubris, perhaps, and an appealing innocence, certainly, but I wasn’t suicidal;” and as the parallel story implies, neither was McCandless. (Krakauer,\n155). Thus, the narrative arc is complete, with the resolution.\n\n____________________\nKrakauer, Jon. Into The Wild. Random House. New York. 1996.\nBronte, Emily. Wuthering Heights. The Reader’s Digest Association, Inc.\nNew York. 2010.",
        "stars": "4.0"
      },
      {
        "userName": "D.g.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Into The Wild- Jon Krakauer\n\nDov Guggenheim\n\nWhen a teenager picks up a book that is seemingly on his reading level, the suspected genre is usually either fiction, non-fiction, or science fiction. One would also suspect the book to be one storyline, a plot that involves a main character, a conflict, and how the conflict was resolved. \"Into The Wild\" is absolutely none of this. Into the wild does have a main character, Christopher McCandless, who decides to leave a life with many advantages, lots of money, and a college degree, to go into the wild. But that is the only similarity. From case studies, to the exciting twists and turns of a rebellious young adult's life, and people he meets on his journey, the part biography, part non-fiction, part case study book \"Into The Wild\" is anything but a normal book.\n\n\"Into The Wild\" is a book relating to the story of Christopher McCandless(who changes his name to Alex Supertramp), a well-to-do man who recently graduated from Emory University. His father, Walt, always pressures him to be perfect, and Christopher hates his father and everything about him, like his constant, imprudent chase of material happiness, and having two simultaneous relationships- one with his ex-wife, and one with Christopher's mother, Billie. After some time, Christopher donates all of his money, leaves a family that loves him, and leaves behind almost all of his possessions to leave to an Alaskan wilderness with just a gun, some bullets, some rice, and some basic survival books. He meets many people along the way, including a woman named Jan, who becomes his mother figure( her son had also abandoned her- she encourages Christopher to go back home, or at least tell his parents what he's up to and accept some items for well-being- take this passage as an example of her personality- \"Have you let your people know what you're up to? Does your mom know you're going to Alaska? Does your dad know?... I'd keep at it until he'd change the subject, though- because of what happened between me and my own son. He's out there somewhere, and I'd want someone looking after him like I looked after Alex), a man named Ronald, who takes him in as a son and gives him work, shelter, food, and other living qualities, and other certain charecters. Christopher is always moving, and he dies over one hundred days after he left. Many people judge this whole ordeal negatively, but Krakauer makes sure to mention in his author's note \"I will leave it to the reader to form his or her own opinion of Chris McCandless\"- that you should have your opinion of this whole episode.\n\nThis book is a very unique book, so that being said, it's memorable, and the content of this book can be perceived as instructive. The whole kid running away from home storyline and the multiple opinions and interviews definitely portray some instructive points regarding rebellious actions. That same storyline is also very controversial. This book is a real live story of a real kid running away from home and trying to survive in the wilderness with basically nothing, and this garnered a lot of opinions of Chris, mostly negative. So although maybe this whole situation is hard to imagine, it's very possible we'll know (or become) someone like this. But the book itself was written very well and portrayed in a fairly unbiased manner, leaving yourself to make an opinion of your own.\n\nAnother reason this book is so good is that even though there is very little suspense( anybody can figure out in the beginning of the book that in the end, Christopher dies) the book is so well written that the whole story line is very gripping. Krakauer attempts to go back in the past and see what made Chris perish.\n\nThere a few negatives to the book, though. First off, it's confusing. The whole story constantly is in flux, changing characters, scene, and point of view. It's hard to keep pace, but if you do, you'll understand the book the way it's meant to be. The problem is, if you don't, you might get some wrong ideas, and those are never good. Also, while generally in the whole book Krakauer wrote very well, including all the details, I felt as if that he didn't fully explain why Chris hated his parents so much that he abandoned his life. In fact, he almost made Chris seem as if he was a kid who wanted nothing to do with his parents for no good reason, and if Chris was as smart as he was, I'm sure there was a reason- this lack of detail can lead you to think Chris made a very dumb decision in leaving, which many people do, but Krakauer doesn't. Had he further detailed Chris's relationship with his parents, and why it was so bad, I'm sure it would be easier to see why Chris left.\n\nThis book, though a real, non-fiction, story, can teach a lesson- but which lesson is being taught by the book will vary from reader to reader. Chris obviously wanted to leave his family, and it's mentioned that he left in response to his father's imprudence. He leaves behind everything he knows, and meets people along his journey, but eventually dies. Different studies are brought in that are similar to this story. So what lesson is to be taught from this whole book( which is really a lot of different, relating stories, in one binding.)? That should you act rebelliously, bring more items and be better prepared and educated? That you should not act rebelliously at all? Krakauer insists Chris did nothing wrong, but others say it was foolish and arrogant of him to ditch everything and go into the wild. What's your opinion? Was it Chris's fault he died? Or did nature simply roll some bad dice on his turn? Different lessons and opinions can be formed from such a deep, controversial, real life topic.\n\nIn my personal opinion, this book was a great book and taught me a lot. Many people, including myself, have this nagging feeling once in awhile that they should just pick up and leave, start a new life somewhere else as a new person. This book talks about different cases in which, to a degree, this happened. It taught me that you can go into the wild on your own, but you need to be very well educated on where you're going, camping, survival, etc., and also that not everyone can do it. But again, this book can be understood in several different manners. This is a book that should be read with an open mind, being that it is a confusing, but deep, book. That being said, unless you have completed your pursuit of happiness and that you are completely happy with how your life is and you want your life to stay exactly how it is, every single teenager with a good reading comprehension should read this book. It'll change how you perceive a lot of things in life, including that little rebellious phase teenagers go through that adults like to call the adolescent phase.",
        "stars": "4.0"
      },
      {
        "userName": "GodParticle",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I put off reading this book for quite a few years. I figured since I saw the movie there was really no reason to read the book. The book was slow going but for some reason I kept coming back and I think I even enjoyed the slow. By the time I was towards the end of the book I did not want it to end. Knowing the outcome the entire time was also a reason I didn't want to read the book since I already knew the tragedy that would occur. But it was really nice to see the different takes on how things could have been different and didn't have to end the way that they had",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B000SEFNMS\nPublisher ‏ : ‎ Anchor; 1st edition (September 21, 2009)\nPublication date ‏ : ‎ September 21, 2009\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 11950 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 231 pages"
  },
  {
    "title": "Ascent Into Hell: Mount Everest",
    "author": "Fergus White",
    "ratingCount": "2,985 ratings",
    "ratingStarts": "4.5 out of 5 stars",
    "synopsis": "There is but one aim: the summit, the summit of Mount Everest.What starts with a trouble-free trek into the Nepalese highlands explodes into a gripping tale of hardship, peril, and adversity. Pushed beyond their physical and mental limits, climbers drop by the wayside. Their primal instincts for survival battle with their dogged resolve to drag themselves to the top of the world. But the focus remains: battle to the summit, and if successful, somehow get back down again.White plunges the reader into a land of subzero temperatures, asphyxiating air, and ever increasing danger. Base Camp and the Himalayan world above it come to life in this riveting, true novel. The inner workings of an Everest expedition team and what it takes to climb the world's highest mountain are laid bare. Some return from the death zone injured. Some do not return at all.Success and failure vie for supremacy throughout.This personal, day-by-day chronicle takes the reader along every step of an Everest climb. A must for climbing enthusiasts, lovers of adventure, and extreme sport junkies; the closing chapters will leave you breathless.",
    "numberOfPages": "350",
    "reviews": [
      {
        "userName": "Cheryl Harris",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The author writes vividly about the good and bad parts of climbing Mt. Everest. I loved hearing about the mountains as well as his reactions.",
        "stars": "5.0"
      },
      {
        "userName": "Lost Sailor",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I'm an avid armchair mountain climber, reading most of what I can get my hands on in my old age. Though I've watched all the movies and documentaries about Everest and read all I can, this book really puts you there on a climb.\n\nYou experience all the ups and downs, upsets and triumphs, and trials and tribulations that a single season could possibly endure through the eyes and heart of a guy trying to get to the top (and back down safely).\n\nI strongly recommend this book for anybody that is interested in what it's like to actually attempt to summit Mount Everest.",
        "stars": "5.0"
      },
      {
        "userName": "S. Owen",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "What a thorough account of a harrowing journey. Fergus brought the reader along his internal struggle up the mountain through weeks of endurance. I enjoyed the internal focus and the way he was in his head the whole time. Other writers zoom in and out and focus on the map and locations too much. This book was great in that it kept the reader focused on what was happening in the mind of the climber. I really enjoyed this!",
        "stars": "4.0"
      },
      {
        "userName": "Sabine Behr",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is an excellent book, giving such detail of the events of Everest like I have never read before. It felt like I was there with him on the journey",
        "stars": "5.0"
      },
      {
        "userName": "T. Stephens",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Fergus writes a compelling story of his journey to summit Everest. Reading, it was easy to feel he was your friend and were there with him. Great pictures too.",
        "stars": "5.0"
      },
      {
        "userName": "Mary K",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Interesting title. Loved the pictures and the detail of the climb. Feels as though I too have been there. A good read.",
        "stars": "4.0"
      },
      {
        "userName": "JWW",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Outstanding piece of work. I've been reading a lot of mountaineering books, and this may be the best! It's White's tale, as an amateur, of climbing Everest, and he tells it like it is; everything you go through physically and mentally to climb. Well written and the photos help you see and understand the various places and conditions.",
        "stars": "5.0"
      },
      {
        "userName": "Wendy",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I’ve read a lot of books about Everest but this is the best one for describing every detail about the trek to base camp and the climb up to the summit and back down. If you want an idea of what it would be like to trek or climb, the experiences that Fergus encountered and relates will provide that. Really a great story with an emphasis on teamwork and the friendships that result.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B07763H6D7\nPublication date ‏ : ‎ November 3, 2017\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 5416 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 350 pages"
  },
  {
    "title": "The Last Ride of the Pony Express: My 2,000-mile Horseback Journey into the Old West",
    "author": "Will Grant",
    "ratingCount": "48 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "\"Spellbinding\" (Douglas Preston) and \"completely fascinating\" (Elizabeth Letts), cowboy and journalist Will Grant takes us on an epic and authentic horseback journey into the modern West on an adventure of a lifetime.  The Last Ride of the Pony Express boldly illuminates both our mythic fascination with the Pony Express, and how its spirit continues to this day. ​    The Pony Express was a fast-horse frontier mail service that spanned the American West— the high, dry, and undeniably lonesome part of North America. While in operation during the 1860s, it carried letter mail on a blistering ten-day schedule between Missouri and San Francisco, running through a vast and mostly uninhabited wilderness. It covered a massive distance—akin to running horses between Madrid and Moscow— and to this day, the Pony Express is irrefutably the greatest display of American horsemanship to ever color the pages of a history book.   Though the Pony Express has enjoyed a lot of traction over the years, among the authors that have attempted to encapsulate it, none have ever ridden it themselves. While most scholars would look for answers inside a library, Will Grant looks for his between the ears of a horse. Inspired by the likes of Mark Twain, Sir Richard Burton, and Horace Greeley, all of whom traveled throughout the developing West, Will Grant returned to his roots: he would ride the trail himself with his two horses, Chicken Fry and Badger, from one end to the other.   Will Grant captures the spirit of the west in a way that few writers have.  Along with rich encounters with the ranchers, farmers, historians, and businessmen who populate the trail, his exploits on horseback offer an intimate portrait of how the West has evolved from the rough and tumble 19th century to the present, and it’s written with such intimacy that you’ll feel as though you’re riding right alongside of him. Along the way, he fights off wild mustangs wanting to steal his horses in Utah, camps with Peruvian sheepherders in the mountains, and even spends three days riding under the Top Gun aviator school in Nevada, which are just a handful of extraordinary tales Will Grant unveils as he makes his way across the treacherous and, at times, thrilling landscape of the known and unknown American West.  The Last Ride of the Pony Express is a uniquely tenacious tale of adventure by a native son of the West who defies most modern conveniences to compass some two thousand miles on horseback. The result is an unforgettable narrative that will forever change how you see the West, the Pony Express, and America as a whole.",
    "numberOfPages": "282",
    "reviews": [
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I loved this book and the way the author wove together the history of the West with its people and places as he encountered them today. So much is changing in our country and that is very true for the farmers, ranchers and other people who populate the huge expanse of the US that he covered on horseback. I learned a lot about other cultures that exist right here in my own country and met characters I never would have otherwise. The author has a distinctive voice and I enjoyed the parts where he brought the reader into his preparation, planning and the problems he faced along the trail. This is a great read for anyone who loves to travel, loves horses or is interested in US history.",
        "stars": "5.0"
      },
      {
        "userName": "Julia Sutherland",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The vastness of the West is brought to life in this re-creation of the Pony Express ride. It’s amazing that something so romanized and famous had such a short life lasting only 18 months. The book is full of great stories about the people who live along the trail and their trust and kindness. I think the horses are the heroes of this tale.",
        "stars": "5.0"
      },
      {
        "userName": "Owen Wosleger",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A remarkable tale of a trek through the west that is equal parts historic and entertaining. Author Will Grant is an incredible story teller who takes you through his ride on the pony express route in 1860. Will’s descriptions of the landscape and the people he meets along the way made it difficult to put this book down. 5 stars.",
        "stars": "5.0"
      },
      {
        "userName": "luana wright",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Very reader friendly account of recreating the pony Express experience. I enjoyed his encounters with people he met and the history of areas he rode through. Looking forward to his next adventure.",
        "stars": "5.0"
      },
      {
        "userName": "Scott Mitchell",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Similar to his journey, this is not a quick jaunt through the West. The experiences and observation of the people and communities along the way of recreating this ride are as compelling as the trail itself, and at its best when his thoughtful prose is sauntered amidst rather than just galloped through.",
        "stars": "5.0"
      },
      {
        "userName": "yestermorrow",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A fun and engaging book from the rare perspective of a cowboy journalist with a unique voice. With a keen eye, an open heart, a sure hand, and a sharp pen, Grant penetrates the history and myth of the Pony Express Trail and overlays it with the realities of the modern American West and the people the land has made. It's an engrossing, one-of-a-kind journey and a worthy read.",
        "stars": "5.0"
      },
      {
        "userName": "Reid S",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I was amazed by this book. Grant’s journey, and his knowledge of the West and the people he met - it was a total joy to read and learn. His two horses have amazing names, and come to life so beautifully. Truly a piece of Americana and a book I’ll be recommending to anyone who loves brilliant travel writing and understanding the West and the role it’s played in the American imagination.",
        "stars": "5.0"
      },
      {
        "userName": "NHK",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is a book for history buffs, horse aficionados, and anyone who wants to get a view of the old west. It is so well written, and documented. A joy to read and to recommend. I am putting it on summer reading lists for adults and grandchildren.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0BH4KWWM7\nPublisher ‏ : ‎ Little, Brown and Company (June 6, 2023)\nPublication date ‏ : ‎ June 6, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 22942 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 282 pages"
  },
  {
    "title": "The Mamba Mentality: How I Play",
    "author": "Kobe Bryant",
    "ratingCount": "27,605 ratings",
    "ratingStarts": "4.8 out of 5 stars",
    "synopsis": "The Mamba Mentality: How I Play is Kobe Bryant’s personal perspective of his life and career on the basketball court and his exceptional, insightful style of playing the game—a fitting legacy from the late Los Angeles Laker superstar.In the wake of his retirement from professional basketball, Kobe “The Black Mamba” Bryant decided to share his vast knowledge and understanding of the game to take readers on an unprecedented journey to the core of the legendary “Mamba mentality.” Citing an obligation and an opportunity to teach young players, hardcore fans, and devoted students of the game how to play it “the right way,” The Mamba Mentality takes us inside the mind of one of the most intelligent, analytical, and creative basketball players ever.In his own words, Bryant reveals his famously detailed approach and the steps he took to prepare mentally and physically to not just succeed at the game, but to excel. Readers will learn how Bryant studied an opponent, how he channeled his passion for the game, how he played through injuries. They’ll also get fascinating granular detail as he breaks down specific plays and match-ups from throughout his career.Bryant’s detailed accounts are paired with stunning photographs by the Hall of Fame photographer Andrew D. Bernstein. Bernstein, long the Lakers and NBA official photographer, captured Bryant’s very first NBA photo in 1996 and his last in 2016—and hundreds of thousands in between, the record of a unique, twenty-year relationship between one athlete and one photographer.The combination of Bryant’s narrative and Bernstein’s photos make The Mamba Mentality an unprecedented look behind the curtain at the career of one of the world’s most celebrated and fascinating athletes.",
    "numberOfPages": "236",
    "reviews": [
      {
        "userName": "yellow1",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The book, Mamba Mentality How I Play, by: Andrew D. Bernstien is great for young athletes that need tips and motivation for their selected sport. The book shows Kobe Bryant’s perspective of basketball and his method of how hw became a great player. The book talks about how Kobe played against his opponents, his work ethic and Kobes relationship with his teammates.\n\nThe first reason this book is great for young athletes is that this book inspires young players to work, play, train, and practice just like Kobe, and can result in success in the athletes. The reason this could inspire them is that Kobe was an all-time great NBA player that finished his career with five NBA championships, so who wouldn’t want to be like him?\n\nIn the book Kobe shows how he developed a solid relationship with his teammates on and off the court. Take for example Pau Gasol, in this book they dedicated a whole page to Pau Gasol’s relationship with Kobe and how their relationship resulted in multiple championships. Pau states how when he was traded from the Memphis grizzlies to the LA Lakers, Pau had to get on a plane from Memphis to LA, and as soon as he arrived at his apartment… Kobe showed up to meet Pau, the new member of the team for the first time in the middle of the night! This shows that Kobe was so determined and dedication to develop a great relationship with his new team member. This can inspire young athletes to develop and prioritize good relationships with their teammates.\n\nThe book also spoke about Kobes relationship with other players outside of his team or in other words his opponents. Kobe always studied the players gameplay that he would be playing against in the game on Sunday night. He noticed the tiniest details on other players strategies and would take them and use them in his own advantage. This can embolden young athletes to study their opponents to improve their game.\n\nIn conclusion this book is perfect for young athletes that need that tiny bit of inspiration, motivation or Kobes little tips to become a winner.",
        "stars": "5.0"
      },
      {
        "userName": "DENICE",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Loved everything about this book. Made me think about the way I want to face life from this point on. Wow!",
        "stars": "5.0"
      },
      {
        "userName": "V",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If you love basketball or even try to adapt Kobe’s work ethic on to your life then this is the book for you.",
        "stars": "5.0"
      },
      {
        "userName": "Michael",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Book came quickly and in great shape. Satified customers and awesome content.",
        "stars": "5.0"
      },
      {
        "userName": "Maritza Bonola",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Easy to read, great images, content can apply to everyone. I purchased this as a gift for my teen son, he is a soccer player.",
        "stars": "5.0"
      },
      {
        "userName": "Lucy Luck",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Book cover was attractive And a good read",
        "stars": "5.0"
      },
      {
        "userName": "Portia Price",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I purchased this as a extra gift for Father’s Day (he asked for it)\nIt’s a big book and more like magazine layout then a reading book\nPerfect for a collectible book",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Excellent for Kobe fans, beautiful tribute.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B07DC3WRKT\nPublisher ‏ : ‎ MCD (October 23, 2018)\nPublication date ‏ : ‎ October 23, 2018\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 230291 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 236 pages"
  },
  {
    "title": "Ball Four (RosettaBooks Sports Classics)",
    "author": "Jim Bouton",
    "ratingCount": "2,693 ratings",
    "ratingStarts": "4.5 out of 5 stars",
    "synopsis": "The 50th Anniversary edition of “the book that changed baseball” (NPR), chosen by Time magazine as one of the “100 Greatest Non-Fiction” books.   When Ball Four was published in 1970, it created a firestorm. Bouton was called a Judas, a Benedict Arnold, and a “social leper” for having violated the “sanctity of the clubhouse.” Baseball commissioner Bowie Kuhn tried to force Bouton to sign a statement saying the book wasn’t true. Ballplayers, most of whom hadn’t read it, denounced the book. It was even banned by a few libraries.   Almost everyone else, however, loved Ball Four. Fans liked discovering that athletes were real people—often wildly funny people. David Halberstam, who won a Pulitzer for his reporting on Vietnam, wrote a piece in Harper’s that said of Bouton: “He has written . . . a book deep in the American vein, so deep in fact that it is by no means a sports book.”   Today Ball Four has taken on another role—as a time capsule of life in the sixties. “It is not just a diary of Bouton’s 1969 season with the Seattle Pilots and Houston Astros,” says sportswriter Jim Caple. “It’s a vibrant, funny, telling history of an era that seems even further away than four decades. To call it simply a ‘tell all book’ is like describing The Grapes of Wrath as a book about harvesting peaches in California.”   Includes a new foreword by Jim Bouton's wife, Paula Kurman   “An irreverent, best-selling book that angered baseball’s hierarchy and changed the way journalists and fans viewed the sports world.” —The Washington Post",
    "numberOfPages": "496",
    "reviews": [
      {
        "userName": "Clem",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "One of the many things that the 1939 classic film ‘Gone With the Wind’ is known for was that it was the first major film to feature a swear word. Apparently when Rhett Butler muttered “Frankly my dear, I don’t give a damn”, it was so scandalous that it caused little old ladies in their theater seats to reach for their smelling salts. That seems almost unbelievable when 50 years later, you almost needed a mainframe computer to keep track of all of the “F” words in a typical Martin Scorsese movie. Times definitely change.\n\nI mention this analogy because I basically felt the same way reading this “controversial, scandalous” book 50 years after it was written. This non-fiction book written by baseball player Jim Bouton ruffled so many feathers when written, that the then commissioner Bowie Kuhn threatened (then pleaded) Bouton to state that the book was actually fiction and Bouton made the whole thing up. Bouton, of course, refused. Reading this book so many years later, it really is hard to see what all the fuss was about. This thing now seems relatively tame. Especially if one has read the scores of recent books by the many colorful athletes such as Jose Canseco, David Wells, and Lenny Dykstra. Modern day readers of this book expecting to be “shocked” are likely to be disappointed instead.\n\nThis book chronicles a year of baseball player Jim Bouton, and essentially serves as a diary and an observation of one year of his baseball life. Jim Bouton had his best years in the early 1960s. This book details his 1969 season, when his best years were obviously behind him. It also doesn’t make things any more interesting when Bouton played for the expansion Seattle Pilots that year. For those who don’t know, the Pilots lasted an entire one year in Seattle before they became the Milwaukee Brewers. By then, Bouton was long gone. Then we look at his role on the team. In 1969, Bouton was relegated to the bullpen as mostly a mop up/ long relief pitcher, which is usually reserved for the least effective pitchers on the squad. So when such a mediocre individual dictates the year of a mediocre team, you’re likely to come away feeling quite bored throughout much of the book. We constantly read about Bouton working on his knuckleball in the bullpen and whining to his coaches for more playing time. This whining of his goes on for most of the whole season. It gets old quick.\n\nBut the episodes of the book that made this thing so memorable, though, wasn’t his own struggles, yet his R-rated observations of the ballplayers that he played with and played against. So yes, we read about players taking “broads” back to their hotel rooms and popping “greenies” (amphetamines) before the games, but it all seems quite tame 50 years later. Much of the verbiage, jargon, and anecdotes that the author shares really haven’t aged that well either and most of his funny stories really aren’t that funny. It’s also quite difficult keeping track of the multitude of players and coaches on the team. Part of this is because 90% of the players from 1969 aren’t really well known to most modern fans of the game. Today most fans can’t recollect people like Tommy Harper, Mike Marshall, and Doug Rader. These guys weren’t that bad back then, but history has a way of erasing most of the ‘good’ players from fans’ memories, and we tend to only remember the ‘greats’.\n\nIt was quite interesting, though, and a bit sad to see how much the game really has changed. In particular, these players were a far cry from ‘wealthy’. This book was written before the free agency boon came into play a few years later. This finally dictated that ball players should actually be payed what they’re worth. So in 1969, the best of the best of the best of ball players were majorly taken advantage of by their greedy owners. It seems quite ridiculous hearing Bouton negotiating to be paid $19,000 per year when his team won’t budge over $17,000. True, $17,000 per year went a lot further in 1969 than it does now, but when compared to eight-figure salaries that ballplayers nowadays make, you can’t help but feel such an amount is nothing more than worthless chump change.\n\nSo a lot of complaining about money, a lot of whining about not getting enough pitching time, and the general skullduggery of ballplayers sneaking out past curfew after night games, don’t really hold up that well when we read about such shenanigans over an entire baseball season. In fact, the most interesting parts of Bouton’s reflections of the 1969 season deal with when he’s briefly sent to the minors early in the season, and when he’s traded to the Houston Astros late in the year. The Astros (unlike the hapless Pilots) actually had a slim chance of making the playoffs, so the day by day accounts were a bit more interesting. Really, though, the only reason why these episodes are more interesting is because they somehow breakup the monotony of Bouton’s entire lifeless season.\n\nI should also put out that the author ‘re-released’ this book 10, 20 and 30 years after the 1969 season. Each of these releases feature a new chapter from the author with his reflections on the last ten years since he last “talked” to us. Sadly, though, these additions really aren’t that interesting. Sometimes he’ll make reflections on how the game has changed, and these are fun to read. Unfortunately, though, he mostly peppers these later chapters with personal information that simply didn’t interest me. Nothing personal, but I really didn’t want to read about his sour marital relations nor his various business ventures. Had there been more baseball, I might have enjoyed these sections more, but overall it was a chore to read.\n\nStill, though, when I review the book, I really need to be fair and try to imagine how it must felt reading this thing in the year 1970 instead of 2020. History tells us that it was a revelation at the time, so I can’t let my modern tastes be too cruel to the experience. I would advise modern fans to read other books by their current day heroes first. Then, go back and give this one a try and see how it compares against some of the latter day works. For me, this thing simply hasn’t aged that well.",
        "stars": "4.0"
      },
      {
        "userName": "Kiwiwriter",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "There is a standing joke, and it's likely true...major league baseball players read \"Maxim,\" \"Field and Stream,\" and \"Ball Four.\"\n\nIt's probably true, even though the latter book is now highly dated by today's standards. Nevertheless, it still does what it did when it came out in 1970 -- convey the story of 25-40 young men, playing for a mediocre baseball club, on the road to nowhere, trying to survive an awful season. The reader sees ballplayers as who and what they are...not very intelligent young men with intensely competitive natures, overheated egos and testosterone, living in an eighth-grade environment.\n\nThe book has a plot -- Jim Bouton struggling to master the knuckle ball, and not doing a particularly brilliant job of it. He gets sent to the minors for a while, botches up a start, and winds up being sent to the Houston Astros at the trade deadline. At first he seems to be a struggling victim, but when I read the book a second time, I felt less sympathy for him -- Bouton was given chances, and did only an average job when called upon. He overrated his own abilities.\n\nTo further spice up the book, Bouton added anecdotes about his days with the Yankees, which limned Mickey Mantle as a drunk, a lecher, and a nasty character. The fact that they were all true did little to mollify outraged readers, which included numerous baseball writers, like Dick Young, who were either proud of their efforts to keep these behaviors out of their newspapers or annoyed that a mere ballplayer had scooped them on them.\n\nAs it turned out, Baseball Commissioner Bowie Kuhn summoned Bouton to his office to discuss his fury with the book. The aforementioned writers were not happy. Neither were the owners, and this, I think, is the crux of Kuhn's rage: Bouton also revealed the duplicity, cheapness, incompetence, and contemptuous manner the owners treated their employees. Kuhn and his employers -- the owners -- did not want fans to discover that they underpaid players and regarded them as chattel. Skirt-chasing and drinking they could put up with. Paying players larger sums of money -- certainly not. Too bad for he owners that free agency would end in 1976 and the 1985 collusion cases would only make their situation worse.\n\nIn the end, there wasn't much Kuhn could do about the book, and it was a bestseller. After that, players and writers tried to copy \"Ball Four\" in their work.\n\nFor example, the first chapter of \"The Worst Team Money Could Buy,\" about the ghastly 1992 New York Mets, is pretty much entirely about ballplayers' sexual habits and rape scandals. Longtime manager Dick Williams admitted in \"No More Mr. Nice Guy\" that his drinking nearly ruined his marriage. Alex Rodriguez's numerous celebrity girlfriends got as much coverage as he did.\n\nIn the end, \"Ball Four\" wound up becoming pretty tame compared to the books that followed. It remained a defining moment in the literature of the sport. And the greatest irony of all...the Seattle Pilots, the team of the book, became the Milwaukee Brewers the following year, and pretty much vanished from memory. Were it not for \"Ball Four,\" probably nobody would remember them at all.",
        "stars": "5.0"
      },
      {
        "userName": "Ezra F Reviews",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "At its time of publication, Ball Four stirred the calm waters of baseball. Jim Bouton revealed the past times and shenanigans that pro players got up to on the road and at ball parks, which the owners weren't entirely happy getting out in the public eye, and Bouton was persona non grata with some players and managers who didn't appreciate the book he wrote. Reading it today it doesn't seem to groundbreaking, aside from the beaver shooting, but for lovers of baseball and sports it's a very good read, containing insight on the inner workings in pro sports, pitching and anecdotes on some famous players. A few things that I had issue with were the absence of Bouton mentioning his wife at the time Bobbie, who stayed home and raised his kids, and the lack of gratitude to her sacrifices. His second wife, Paula gets a whole epilogue and many words of praise, while Bobbie is only mentioned in passing when Bouton's daughter Laurie is tragically fatally injured in a car crash. Another thing I didn't like was that alongside the many epilogues in the book, Bouton doesn't provide any closure on how his team did at the end of the season he has just described in great detail. But despite these gripes it's a very good book.",
        "stars": "4.0"
      },
      {
        "userName": "Papa Bear",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I spent several years playing football and the experience,that I had, tells me that this book is all true. It is such a fun read, and I do enjoyed it, that I was sorry that it ended.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B07XB48KK6\nPublisher ‏ : ‎ RosettaBooks (March 20, 2012)\nPublication date ‏ : ‎ March 20, 2012\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 4816 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 496 pages"
  },
  {
    "title": "The White Darkness",
    "author": "David Grann",
    "ratingCount": "906 ratings",
    "ratingStarts": "4.4 out of 5 stars",
    "synopsis": "From the #1 New York Times bestselling author of Killers of the Flower Moon and The Wager, a thrilling and powerful true story of adventure and obsession in the Antarctic, lavishly illustrated with color photographs.  \"[Grann is] one of the preeminent adventure and true-crime writers working today.\"—New York Magazine Henry Worsley was a devoted husband and father and a decorated British special forces officer who believed in honor and sacrifice. He was also a man obsessed. He spent his life idolizing Ernest Shackleton, the nineteenth-century polar explorer, who tried to become the first person to reach the South Pole, and later sought to cross Antarctica on foot. Shackleton never completed his journeys, but he repeatedly rescued his men from certain death, and emerged as one of the greatest leaders in history.  Worsley felt an overpowering connection to those expeditions. He was related to one of Shackleton's men, Frank Worsley, and spent a fortune collecting artifacts from their epic treks across the continent. He modeled his military command on Shackleton's legendary skills and was determined to measure his own powers of endurance against them. He would succeed where Shackleton had failed, in the most brutal landscape in the world.  In 2008, Worsley set out across Antarctica with two other descendants of Shackleton's crew, battling the freezing, desolate landscape, life-threatening physical exhaustion, and hidden crevasses. Yet when he returned home he felt compelled to go back. On November 13, 2015, at age 55, Worsley bid farewell to his family and embarked on his most perilous quest: to walk across Antarctica alone. David Grann tells Worsley's remarkable story with the intensity and power that have led him to be called \"simply the best narrative nonfiction writer working today.\" Illustrated with more than fifty stunning photographs from Worsley's and Shackleton's journeys, The White Darkness is both a gorgeous keepsake volume and a spellbinding story of courage, love, and a man pushing himself to the extremes of human capacity. Look for David Grann’s latest bestselling book, The Wager!",
    "numberOfPages": "142",
    "reviews": [
      {
        "userName": "M. Epstein",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Very well written but missing the deepest level. Exploration of Antarctica fascinates me. It is so difficult and I wonder about why people are drawn to it. I could understand Worsley's lifelong obsession but his decision to go alone that last time when he was not young seems to me unbalanced and the book could have pushed deeper into his psyche on why he would do that to himself and his family.",
        "stars": "4.0"
      },
      {
        "userName": "commercial banker",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A 4 rating for most of the book but. Solid 5 for the final chapters. A true love affair both with the challenge of the Antarctic and his family. Tears came to my eyes at the end. Another great book by Grann !",
        "stars": "4.0"
      },
      {
        "userName": "Precise Disarray",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I love reading this in printed form. For this piece of non fiction, I prefer to have the hard copy in hand, with pictures to look at. I don't recall what I spent on the book (@$10), but I already know how many pages I was buying (160 pages from description, though 146 in book in hand).\n\nSometimes price is a deciding factor, sometimes not. when I really want to read something, I'll pay whatever. I really wanted to read this, so I bought it. I see a lot of negative reviews stating that readers should save their money and just read it out of the magazine (k, where am I going to get this copy?, also if it is just a reprinted mag piece, I am glad it is offered in a format I can enjoy), or figure out a way to get around buying it and read it electronically (hmm, really?). Positive reviews are looked at as though they are part of something scandalous, which undermines an authentic read with genuine enjoyment of this book. Although I initially considered backing away, I actually ultimately decided to -take a chance- purchase my book based on these negative reviews, so thank you!\n\nOne person's 1 star, is another person's 5 star :)\n\nI am already familiar with Grann's writing, so I knew to expect some solid writing. I was not disappointed (phew!). I did not gobble it up in a short sitting (savored it), I don't feel like I am being taken for my money with having spent $10 to read someones work. I've spent more money on less worthwhile reads. And I do understand that value is based on ones perspective. So *I* find value in this read, and because I do so, it does not mean that my review is not genuine.\n\nAlso, now there are used copies available. That being said, and price aside..\n\nThe information shared in this book is clear, concise, well described, and gives me a sense of being there in Antarctica. I was initially drawn to this book, well first because I wanted to see what else Grann has written (KIllers of the Flower Moon is amazing in particular) that I may not have read yet. Secondly, the premise of adventurers in Antarctica- something about long arduous treks really appeal to me, even if only from the comfort of my lazy girl recliner. I knew Grann would lead me as close as I could ever get to being there, with these brave, courageous, risk takers- without my having to leave the house. Not only that, but it spurred an interest in me to seek out even more information about the area and other explorers, their stories, and so on. They may be a bit crazy and selfish, but I can still be a voyeur into that world. Grann helps with that. And THAT absolutely makes this a worthwhile experience, to me. I think it is a gem of a book, and I appreciate this non fiction story. Looking forward to more of his work.",
        "stars": "5.0"
      },
      {
        "userName": "jpk",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Admirable but sad",
        "stars": "4.0"
      },
      {
        "userName": "Fletcher",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "An amazing story of a man who was as tough and resilient as the early polar explorer’s. Well written and researched.",
        "stars": "5.0"
      },
      {
        "userName": "donald leland craig",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Again David Grann pens a perfect short history of a person of great courage an inspiration. the sparse style suits the tale of conquering a challenge in the most inhospitable place on earth",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "David Grann’s books are by far the best written accounts of amazing events. I have now read all of them published so far and am looking forward to his next adventure.",
        "stars": "5.0"
      },
      {
        "userName": "Bingereader",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is my second book written by David Grann. I really enjoy his writing. He gives you all the facts, but in a heartfelt way that brings you on the journey the people he is talking about.\n\nIn ‘The White Darkness’, we follow Henry Worsely a British guy with an immense love and admiration for Shackleton, the Polar Explorer. Shackleton was one of three famous men to trek across Antarctica in the early 1900’s. “For scientific leadership, give me Scott; for swift and efficient travel, Amundsen; but when you are in a hopeless situation, when there seems to be no way out, get on your knees and pray for Shackleton.”\n\nHenry had many accomplishments in his life. He was a military leader, a British special forces officer. He retired from the military after thirty years. In between he made two trips to Antarctica. The first time with two other descendants of Polar Explorers. Gow and Adams were also in love with adventure and their family stories of bravery. The second time, he took the route of Scott and raced against fellow soldiers to the south pole, the other team taking Amundsen’s route. Both trips to the south pole was a success.\n\nEveryone that knew Worsely thought he was a fearless leader. Brave and never stopping. He was optimistic and able to brighten even the bleakest of times. People adored him.\n\nWith these treks across the white darkness, Worsely was fundraising for his fellow soldiers. Those that were injured in war and in the line of duty.\n\nThis book at 127 pages, brought tears to my eyes on several occasions, especially at the conclusion and final excursion to Antarctica. Worsely at 55 years of age and finally retired decided he would make one last trip to the frozen desert. A solo trip in 2015, Worsely would trek 900 nautical miles in 80 days. The world watched and each night Worsely would broadcast a good night message and answer questions from mostly the kids following his journey.\n\nWhat I didn’t notice, was the switch of the past tense when David Grann started that last chapter and was devastated to learn the outcome of this last and final trip.\n\nWith 127 pages including pictures this is a one sit read. I highly recommend if you have a adventurous spirit. If you love reading of others personal and physical journeys and accomplishments pick this book up. It is beautiful and inspiring. Loved this so much. Guess I’m a fan of David Grann, I’ll have to pick up another book by him soon.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B07BPP9TCL\nPublisher ‏ : ‎ Doubleday (October 30, 2018)\nPublication date ‏ : ‎ October 30, 2018\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 55908 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 142 pages"
  },
  {
    "title": "If I Live Until Morning: A True Story of Adventure, Tragedy and Transformation",
    "author": "Jean Muenchrath",
    "ratingCount": "2,550 ratings",
    "ratingStarts": "4.2 out of 5 stars",
    "synopsis": "--Best Book Awards Finalist (Travel & Essays Category).\"A story of courage, the author’s drive to survive, to heal, to manifest a new reality. If you are looking for an inspiring story, this is it!\"--Reader's Favorite Book Reviews.Her wilderness adventure turned into a nightmare. After skiing more than 200 miles along California's John Muir Trail, Jean faces death from a mountaineering accident on Mount Whitney. Broken and bleeding on the highest peak in the continental United States, she vows to realize her greatest dreams if she lives until morning. Her escape from the Sierra Nevada Mountains turns into an amazing five-day survival story. Jean's recovery is equally daunting. In this outdoor adventure memoir, her three-decade journey takes her from the depths of despair and chronic pain, to the heights of the Himalayas and on travels around the world. When the specter of Mount Whitney continues to shatter her life, Jean befriends Tibetan Buddhist lamas. Their ancient wisdom guides her on a path beyond her wildest dreams.\"An incredible, beautiful story.\"--Backpacker Radio",
    "numberOfPages": "276",
    "reviews": [
      {
        "userName": "MegNeu22",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book had me hooked from the beginning. First to even do the things Jean did in her earlier expeditions to how it transformed her and her visits to the Himalayas I was intrigued, inspired and most of all cheering her on as she continued to find her strength and persevere. I'm not a mountaineer by any means but am married to one and always found myself wanting to live vicariously through his stories. Thank you to Jean for sharing your story so we all could cheer you on and see just what it really means to beat the odds and never give up.",
        "stars": "5.0"
      },
      {
        "userName": "Andzelika Rzucidlo",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I enjoyed that the author spared no details when explaining the story - the addition of the goriness of the accident and the mundane of everyday mountaineering (i.e using a wag bag) made the storytelling feel more candid.",
        "stars": "4.0"
      },
      {
        "userName": "Karen Van De Moere",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I have been recently struggling with recovery from a bad skiing accident. I was looking for a good survival story to help boost my mindset. What I was looking for was in Part 1. Parts 2 and 3 are what I really needed. This is a great story of perseverance and the truth of what happens after a trauma. People react and heal in different ways. What I needed reminding of was how powerful my mind is and how I can change my perception of my circumstances by focusing on my mindset. I will be forever grateful for stumbling upon this book at this exact time in my life.",
        "stars": "5.0"
      },
      {
        "userName": "tmc",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Jean's story of overcoming tragedies to both herself and loved ones, and quest for enlightenment by embracing Eastern teachings and mindfulness, can serve to inspire one's own climb to greater awareness.",
        "stars": "4.0"
      },
      {
        "userName": "A Will",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "First off, I felt lied to by the Title. \"If I Live Until Morning\" okay, if you live, then what? Author didn't elaborate on this one. No death bed wish. No worries, I can look past the title.\nHalf the book is a telling of the story of the author's accident and survival from a fall, which, to me, doesn't read well. It reads just like a telling of a 30 year old story with memories that are a bit fuzzy and incomplete. Not an interesting telling of the Sierra ski trip, but just enough to get me to turn the page and see where it leads.\nThe second half of the book is the author's path to recovery, mostly through lessons learned from Buddhism. Religion isn't my thing, but still, Buddhism does have some nuggets of good advice on how to live the good life, which the author delves into in a manner that fits in with her personal recovery problems. Well done on that side.\nMy biggest complaint about the book, and this was a big one for me, was the author's complete lack with connecting on a human-to-human bases, ie, relationships. So, her boyfriend refused to acknowledge the accident and she describes him as so very uncaring and cold, yet she marries him. Can you please describe the relation dynamics that went into her partners behavior. At least a little? No? Not at all. It makes me question, even be skeptical, of her story as she tells it.\nI did get a lot of helpful life lessons from this book, dealing with my own personal issues with the ups and downs of life. She descriptions of the Himalayas and other travels really fueled me with a desire to complete my travel / adventure bucket list too. And I did get several life lessons / psychological viewpoints from this, easy to read, easy to finish book.",
        "stars": "4.0"
      },
      {
        "userName": "World Traveler",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Jean tells her story in an engaging way as she takes us on a journey of self discovery and adventure. I have traveled to many of the places she describes, and like most people I’ve had my struggles in life. Her story took many unexpected turns. We can learn a lot from her introspective journey physically, culturally and mentally. I thank her for sharing her story.",
        "stars": "5.0"
      },
      {
        "userName": "Alison V",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "At first glance, I thought this would be similar to other survival stories. It is much more as the story goes far beyond surviving a disaster. I felt this book was more an autobiography of the author's life and spiritual journey. It is well written but drags at time. Some of the terminology was lost on me as I am not a climber.",
        "stars": "4.0"
      },
      {
        "userName": "DdCbasin",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I have always loved hiking and in my 20’s and 30’s wanted to climb Mt Everest. I read every book on the subject that I could find but my path was to be a-horseback in Wyoming. So, I love books about climbers and I love books about survival and I also love books about meditation and enlightenment. Jean Muenchrath lived many of my dreams and her inspiring tale of overcoming the hurdles of that life was fascinating to read. Isn’t that the satisfying thing about a good book? It makes one feel as if one lived that experience? I could never have done the things she did, but I now have been with Jean as she did them and that is the next best thing.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B07QCJDWF6\nPublisher ‏ : ‎ VajraSky Books (April 6, 2019)\nPublication date ‏ : ‎ April 6, 2019\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 4674 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 276 pages"
  },
  {
    "title": "Jungle of Stone: The Extraordinary Journey of John L. Stephens and Frederick Catherwood, and the Discovery of the Lost Civilization of the Maya",
    "author": "William Carlsen",
    "ratingCount": "978 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "The acclaimed chronicle of the discovery of the legendary lost civilization of the Maya. Includes the history of the major Maya sites, including Palenque, Uxmal, Chichen Itza, Tuloom, Copan, and more.NEW YORK TIMES BESTSELLER • Illustrated with a map and more than 100 images. In 1839, rumors of extraordinary yet baffling stone ruins buried within the unmapped jungles of Central America reached two of the world’s most intrepid travelers. Seized by the reports, American diplomat John Lloyd Stephens and British artist Frederick Catherwood—both already celebrated for their adventures in Egypt, the Holy Land, Greece, and Rome—sailed together out of New York Harbor on an expedition into the forbidding rainforests of present-day Honduras, Guatemala, and Mexico. What they found would upend the West’s understanding of human history.In the tradition of Lost City of Z and In the Kingdom of Ice, former San Francisco Chronicle journalist and Pulitzer Prize finalist William Carlsen reveals the remarkable story of the discovery of the ancient Maya. Enduring disease, war, and the torments of nature and terrain, Stephens and Catherwood meticulously uncovered and documented the remains of an astonishing civilization that had flourished in the Americas at the same time as classic Greece and Rome—and had been its rival in art, architecture, and power. Their masterful book about the experience, written by Stephens and illustrated by Catherwood, became a sensation, hailed by Edgar Allan Poe as “perhaps the most interesting book of travel ever published” and recognized today as the birth of American archaeology. Most important, Stephens and Catherwood were the first to grasp the significance of the Maya remains, understanding that their antiquity and sophistication overturned the West’s assumptions about the development of civilization.By the time of the flowering of classical Greece (400 b.c.), the Maya were already constructing pyramids and temples around central plazas. Within a few hundred years the structures took on a monumental scale that required millions of man-hours of labor, and technical and organizational expertise. Over the next millennium, dozens of city-states evolved, each governed by powerful lords, some with populations larger than any city in Europe at the time, and connected by road-like causeways of crushed stone. The Maya developed a cohesive, unified cosmology, an array of common gods, a creation story, and a shared artistic and architectural vision. They created stucco and stone monuments and bas reliefs, sculpting figures and hieroglyphs with refined artistic skill. At their peak, an estimated ten million people occupied the Maya’s heartland on the Yucatan Peninsula, a region where only half a million now live. And yet by the time the Spanish reached the “New World,” the Maya had all but disappeared; they would remain a mystery for the next three hundred years.Today, the tables are turned: the Maya are justly famous, if sometimes misunderstood, while Stephens and Catherwood have been nearly forgotten. Based on Carlsen’s rigorous research and his own 1,500-mile journey throughout the Yucatan and Central America, Jungle of Stone is equally a thrilling adventure narrative and a revelatory work of history that corrects our understanding of Stephens, Catherwood, and the Maya themselves.",
    "numberOfPages": "544",
    "reviews": [
      {
        "userName": "Rex A. Dwyer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If you are interested in reading about the (European) discovery of the Mayan ruins in Guatemala, you could read the primary source, Stephens's own book. But I suggest you read this first, or instead, so that you don't get bogged down in that pompous/racist 19th-century-explorer writing style. It is really pretty exciting stuff. On top of the rest of it, Stephens and Catherwood were exploring in the middle of a revolution in Guatemala. (In fact, Stephens was on a diplomatic mission to a government that was collapsing.)\nThe book also follows up on what happened to the explorers after their adventure. A lesson from the lives of exploreres in general seems to be that finishing a major ground-breaking expedition may lead to a degree of fame, but it doesn't always lead to health and prosperitiy.",
        "stars": "4.0"
      },
      {
        "userName": "George Fulmore",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is a wonderful book, one that brings to life the tremendous efforts of two exceptional explorers/adventurers in the early 1800s. These men collaborated to find and document many of the major ruins left by the indigenous natives of southern Mexico and Central America.\nSays author William Carlsen: “Today the ancient Maya are recognized for having achieved one of the most sophisticated early civilizations on earth. Tourists by the millions, from every part of the globe, annually descend on Maya ruins in Mexico, Guatemala, Honduras, and Belize.”\nBut it was not always this way, and that is what this book is about: The story of the earliest explorations into the jungles of Mexico and Central America and the words and thoughts produced by these two explorers about what they found and what they surmised.\nIn the Acknowledgements section of the book, Carlsen states his passion for his work: “I will hold in my heart always the extraordinary Maya people….May you forever keep your rich culture alive for the benefit of us all.”\nI’ve personally had the pleasure of traveling in Mexico and Central America. I’ve been to many of the places talked about in the book. But I really treasure the way “Jungle of Stone” puts the pieces together, capturing the historic details and bringing the people involved in the early explorations to life.\nThe story starts in the early 1800s, in the Age of Discovery. This was a period when Europeans and Americans knew little about the Latin American before Columbus. The Spanish conquistadores were all about enriching themselves. They were not in the New World to learn about and/or preserve indigenous native culture. In fact, the Spanish shut off the New World south of the emerging United States for centuries.\nBut there were rumors of ruins of ancient civilizations found by the Spanish. Popular culture speculated that the works had to be by Egyptians, the Lost Tribes of Israel or others. The general thinking was that no indigenous people in the Americas would be capable of creating sophisticated works of art.\nThe book is all about the adventures of John Lloyd Stephens and his colleague Frederick Catherwood. Each had extensive travel experience, including in the Middle East, decades before Mark Twain would publish his book, “Innocents Abroad.” Catherwood was a professional architect by trade. Stephens was a lawyer who had made good money writing a book about his travels in Egypt, the Holy Land and Petra.\nThey began their great adventures in Latin America in 1839. They teamed up for 13 years to explore Mayan ruins in Latin America, their first conquest being Copan in Honduras. They were stunned by what they found.\nThey went were few white men had been before. They followed some of the same paths used earlier by Hernan Cortez. They continually faced dangers from bandits or hostile Indians. They traveled through areas of active wars. Mosquitoes, ticks, snakes, scorpions, rain, heat, mud and all kinds of other nuances and obstacles were encounter along the way. This was not an adventure for sissies.\nBritain was the great world power at the time. The U.S. was not yet a major world power. Stephens, as an American, dreamed of bringing Mayan treasures back to New York as the foundation of new prestigious museums that would put the U.S. on the world map. At the time, few in the world knew anything about the existence of the art and architecture of the Mayans.\nCameras did not exist, so it was the detailed drawings by Catherwood that would be an essential element in a future publication of a book by Stephens. The book, Travel in Central America, Chiapas and Yucatan, published in 1841, was met with great success, eventually going through 12 printings and sold all over the world. Stephens’ important conclusion was that the Mayan work was original and without influence of “models or masters.”\nThe two were off on the trail once again in 1841, this time to focus on the Yucatan Peninsula. Catherwood would be meticulous in the detail of his drawings. Bouts of malaria slowed them down, but they were prodigious in their work, the result of which was the 1843 work entitled, Incidents of Travel in Yucatan. Like Stephens earlier works, it was a great financial success.\nStephens and Catherwood talked about exploring further south, where Machu Picchu would not be discovered by the West for another 67 years. But the steam engine and the railroad was all the rage at this time. Catherwood took a job working on a line in British Guyana. Stephens would work on the railroad across Panama, essentially until he worked himself to death in 1852.\nFurther exploration of the Mayan ruins would wain, or the most part, until the early 1900s. But the foundational information documented by Stephens and Catherwood laid a foundation for all that was to come. And what a story it is, as beautifully written by Mr. Carlson in this very fine book, which I highly recommend.",
        "stars": "5.0"
      },
      {
        "userName": "Karen B-L",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Recommended by my brother. Took a while just to pick it up and start reading, but was drawn in immediately.",
        "stars": "5.0"
      },
      {
        "userName": "S. Warfield",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "During the early years of the nineteenth century there were rumors about stone relics and ruins that lay in the jungles of Central America. When travelers John L. Stephens, an American diplomat, and British artist Frederick Catherwood heard about the possible existence of ruins, they set out on an amazing journey to find the stones. This exploration took them into the rainforests of Guatemala, Honduras and Mexico. What the two men found was the civilization of the Maya and understanding of the extent of the vast area and the high degree of the civilization that the ancient culture had developed. The Maya built and lived in these cities during the time when Greece and Rome were great, and the architecture and art of the Maya were equally astounding and beautiful. Author William Carlsen brings the two explorers to life as well as the difficult and laborious times they had finding and uncovering the ruins of an ancient and sophisticated society of people.\n\nStephens and Catherwood made their way through the heat of the jungle, disease, war and areas high in the Central American mountains. As Stephens worked and directed work of uncovering the ruins, Catherwood drew exemplary likenesses of what they found. After their return home, they published a best-selling book that gave the world a new understanding of the Maya and their civilization. Their book is still in print today. This is a wonderful and comprehensive book that explores the remarkable discoveries of the two men as well as a look into their lives.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0105V62Z0\nPublisher ‏ : ‎ Mariner Books; Illustrated edition (April 26, 2016)\nPublication date ‏ : ‎ April 26, 2016\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 29527 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 544 pages"
  },
  {
    "title": "Mother of God: An Extraordinary Journey into the Uncharted Tributaries of the Western Amazon",
    "author": "Paul Rosolie",
    "ratingCount": "736 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "For fans of The Lost City of Z, Walking the Amazon, and Turn Right at Machu Picchu comes naturalist and explorer Paul Rosolie’s extraordinary adventure in the uncharted tributaries of the Western Amazon—a tale of discovery that vividly captures the awe, beauty, and isolation of this endangered land and presents an impassioned call to save it.In the Madre de Dios—Mother of God—region of Peru, where the Amazon River begins its massive flow, the Andean Mountain cloud forests fall into lowland Amazon Rainforest, creating the most biodiversity-rich place on the planet. In January 2006, when he was just a restless eighteen-year-old hungry for adventure, Paul Rosolie embarked on a journey to the west Amazon that would transform his life.Venturing alone into some of the most inaccessible reaches of the jungle, he encountered giant snakes, floating forests, isolated tribes untouched by outsiders, prowling jaguars, orphaned baby anteaters, poachers in the black market trade in endangered species, and much more. Yet today, the primordial forests of the Madre de Dios are in danger from developers, oil giants, and gold miners eager to exploit its natural resources.In Mother of God, this explorer and conservationist relives his amazing odyssey exploring the heart of this wildest place on earth. When he began delving deeper in his search for the secret Eden, spending extended periods in isolated solitude, he found things he never imagined could exist. “Alone and miniscule against a titanic landscape I have seen the depths of the Amazon, the guts of the jungle where no men go, Rosolie writes. “But as the legendary explorer Percy Fawcett warned, ‘the few remaining unknown places of the world exact a price for their secrets.’”Illustrated with 16 pages of color photos.",
    "numberOfPages": "340",
    "reviews": [
      {
        "userName": "Jessica",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Amazing read. Save the Amazon!!",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "really captivating story telling.\n\nvery informative, really make you think and urge you to consider taking actions.\n\ntruly a great book",
        "stars": "5.0"
      },
      {
        "userName": "B. Gooden",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I was fascinated by this book, which I read on my Kindle. I was searching for books on Peru, principally those related to pre-Columbian cultures, and found and was hooked by the title, since my wife and I have traveled to Peru three times (and also Ecuador two times), including a couple times in the Amazon region. And the initial reviews enticed me to read this book. The author's descriptions of the Amazon rainforests were at once realistic and poetic, with a very real important emphasis on what this world is doing, and not doing, to destroy, or to allow by apathy the destruction of the essential wholeness of the rainforests, to the world's and not just Peru's great peril. There is no doubt of his devotion to the Amazon and wish to preserve it, including what he is doing now, both by writing the book, and also continuing to help run, with others, including citizens of Peru, the Las Piedras Biodiversity Station, helping to lead its efforts to both study and preserve the region. I especially loved the descriptions of the animals, reptiles and birds of the still-for-now pristine regions of the Madre de Díos that most of us will never see, or unfortunately, ever see again. I also liked the fact that the author was self-deprecating about his adventures, including recognizing where he was perhaps brash and not paying attention to the possible dangers of the situations he was putting himself in. And then there is the interesting back-story of the author's personal and educational development from his days in New York, to his early attempts to establish himself in the Amazon region, but, with his parents help and encouragement, to go to college and complete his education to make himself more valuable in the responsibility he would then assume in Peru. This is absolutely a marvelous book. I would very much like to read whatever his next book might be. And I will no doubt re-read this one soon.",
        "stars": "5.0"
      },
      {
        "userName": "Anne G. Sherrod",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "As a person who loves nature, and an environmentalist who has a deep feeling for biodiversity, I LOVED this book. Couldn't put it down. Sat in a chair from morning til night, getting up only for bare essentials, until I'd finished it. Gave it to my friends and they raved about it. Just the title, Mother of God, had intrigued me because, whatever people meant when they named this tributary of the Amazon Madre de Dios, the name infers to me how a rainforest river is the birthplace of an explosion of life. I liked the author a lot. His explorations are courageous, his story is amazing, he is an excellent writer. His desire to be a scientist, but live and write as a lover of what he studies is on the right course. This book is how I want to be taken to the Amazon or any other wild place as a reader. It made me want to go there, despite snakes, crocodiles and mosquitoes. His recent exploit, after the book was published, of trying to get eaten by an Anaconda for a film (which can be seen on YouTube)is not on a right course. Perhaps the great success of his book has gone to his head. I was appalled, but scientists and environmentalists alike often have to figure out whether they are going to promote the environment or promote themselves; save nature or exploit it for fame; live one's life or make an exhibition of it. Rosolie is young, he has all the makings of a great modern explorer, he has time to make mistakes and learn from them. I hope he survives whatever attack of terrible judgement caused him to undertake getting swallowed by an anaconda, that he continues his documentation of the wild Amazonian rainforest, lives humbly and writes more books like this.",
        "stars": "5.0"
      },
      {
        "userName": "amsecretan",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Vivid is the best word I can use to describe this book. This year, I have read several \"Amazon adventure\" type books, beginning with The Lost City of Z, and then The Lost City of the Monkey God, and finally this one...and this one might be my favorite. As other reviewers have commented, this book takes you right into the Amazon with the author, and you really can envision the wondrous world he describes as if you are right there with him, stalking predators and observing thousands of species. This story gets right into the action, and places the reader right where you want to be - in a hammock listening to wild bird calls, crawling on the jungle floor looking for ants, floating down a river surrounded by the real possibility of getting lost forever. The author is honest and young, and has a very good grasp on his privilege in the world and how he might be able to use that to save the jungle he grows to love. It's really an astounding tale, with great imagery and real tension. If you like adventure in mysterious places, this is a great pick!",
        "stars": "5.0"
      },
      {
        "userName": "Danny",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Not only did this book deliver way more than I was expecting.. the adventure, the information, the facts and intense moments with Mother Nature, the love for the animals and the connection to the jungle... it has inspired me and reshaped my entire view of the world.. I would recommend anyone read this book, whether your a nature lover or someone seeking an adventure.. honestly It doesn’t matter what you’re into or what your background is, this book has so much to offer. I plan on making my way to the jungle, hope to see you around Paul.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B00DB39Y6E\nPublisher ‏ : ‎ Harper; Reprint edition (March 18, 2014)\nPublication date ‏ : ‎ March 18, 2014\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 6981 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 340 pages"
  },
  {
    "title": "The Last Folk Hero: The Life and Myth of Bo Jackson",
    "author": "Jeff Pearlman",
    "ratingCount": "694 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "A New York Times BestsellerBy the author of Showtime—the source for HBO’s Winning Time—the definitive biography of mythic multi-sport star Bo Jackson.“A legendary tome on a legendary athlete.\" —Chris Herring, author of Blood in the GardenFrom the mid-1980s into the early 1990s, the greatest athlete of all time streaked across American sports and popular culture. Stadiums struggled to contain him. Clocks failed to capture his speed. His strength was legendary. His power unmatched. Video game makers turned him into an invincible character—and they were dead-on. He climbed (and walked across) walls, splintered baseball bats over his knee, turned oncoming tacklers into ground meat. He became the first person to simultaneously star in two major professional sports, and overtook Michael Jordan as America’s most recognizable pitchman. He was on our televisions, in our magazines, plastered across billboards. He was half man, half myth.Then, almost overnight, he was gone.He was Bo Jackson.Drawing on an astonishing 720 original interviews, New York Times bestselling sportswriter Jeff Pearlman captures as never before the elusive truth about Jackson, Auburn University’s transcendent Heisman Trophy winner, superstar of both the NFL and Major League Baseball and ubiquitous “Bo Knows” Nike pitchman. Did Bo really jump over a parked Volkswagen? (Yes.) Did he actually run a 4.13 40? (Yes.) During the 1991 flight that nearly killed every member of the Chicago White Sox, was he in the cockpit trying to help? (Oddly, yes. Or no. Or … maybe.)Bo Jackson isn’t Jim Thorpe.He’s not Deion Sanders, either. No, Bo Jackson is Paul Bunyan. The Last Folk Hero is the true tale of Bo Jackson that only “master storyteller” (NPR.org) Jeff Pearlman could tell.",
    "numberOfPages": "496",
    "reviews": [
      {
        "userName": "Karl Heinz",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Just great stuff...reads like a novel...seems real honest...warts and all...thx Jeff...would love to see your book on Aaron Rodgers after he retires...",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Liked the book but slow reading not put together for fun read. But we’ll worth the money except for me it wasn’t a book I couldn’t put down.",
        "stars": "4.0"
      },
      {
        "userName": "Roy Dunn",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I purchased this because. I had the privilege to play in a game with Bo and actually contributed to part of the story. Well written and very interesting to read.",
        "stars": "5.0"
      },
      {
        "userName": "Bill Emblom",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Author Jeff Pearlman has done a thorough job in researching the life of Bo Jackson. Despite enjoying success in professional football with the Oakland Raiders and in baseball primarily with the Kansas City Royals and Chicago White Sox I felt that Jackson wasn't really satisfied with his life. His private life was often spent womanizing and one could never be sure whether they would be dealing with the Dr. Jekyll or Mr. Hyde personality. Jackson could be very accommodating with other people but his pent-up anger could erupt with other people.\n\nI found it interesting that Jackson's physique was a gift of nature and eating healthy foods and working out were not a priority with him. He was successful playing professional football with the Raiders and then attempted professional baseball with the Kansas City Royals. His crippling hip injury in a football game was to lead to his eventual downfall as a professional athlete. Despite his talent as a football player one can't help but wonder how successful as a baseball player he would have been had he just stuck with baseball and avoided the hip injury.\n\nThe book includes those individuals in college and professional football along with players, managers, and coaches in baseball that he liked and others he had no use for whatsoever. The story involving Greg Pratt during his college year is especially tragic which involved a college coach demanding a drill during unforgiving heat. The author spares nothing with those Jackson didn't like. I won't mention the names here; you can read the book for yourself. If for whatever reason he liked you he could be a wonderful person but others received the Mr. Hyde personality.\n\nBo Jackson appeared a much more contented person in his post-athletic career and satisfied with his life involving his wife and family. The book contains sixteen pages of colored photos. Why only four stars? Say what you will but I was not comfortable with the amount of profanity in the book. If this doesn't bother you then I'm sure you will vote it five stars. Mortals are we all of us the greatest ones must fall.",
        "stars": "4.0"
      },
      {
        "userName": "Jessica T.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "It's hard to rate a Jeff Pearlman book anything less than 5 stars because he's so freaking thorough and engaging with his writing. And it's not like many biographies that are like reading really long English class assignments... there was plenty of humor, even during the baseball play-by-play parts which I still skimmed a teeny bit because baseball has never been my jam. But they weren't unbearable here.\n\nI'd of course heard of Bo Jackson and knew he was a two-sport phenom but that was about it as far as the details. I recall all the 'Bo Knows' stuff. I'd seen his post-retirement guest spot on Moesha. But I had no idea he was such a... well, less-than-pleasant person. But it was fascinating to read about the backstory and everything that led up to who he came to be. I was glued.\n\nAnd I still feel bad for Allison Hines. :)",
        "stars": "5.0"
      },
      {
        "userName": "Michael Battista",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Good book but I felt it spent too much time in the college years. I enjoyed the mlb stories wish they had more of them.",
        "stars": "5.0"
      },
      {
        "userName": "John N.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I was amazed at the details writer gave about Bo's life.",
        "stars": "5.0"
      },
      {
        "userName": "C. Baker",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Bo Jackson’s story is what could have been. Possibly the second greatest natural athlete of the 20th Century behind Jim Thorpe, Bo was a two sport phenom who was derailed by an unfortunate hip injury in a professional football game. This led to hip replacement surgery, and he is only athlete to play a professional sport with an artificial hip when he signed and played two seasons with the Chicago White Sox.\n\nPearlman does an excellent job of bringing Bo Jackson’s story to life, the good and the bad. He had bouts of surliness to fans, reporters and teammates countered by his acts of magnanimity and kindness to others. He was an indifferent athlete, meaning he really did not put much work in or practice hard, which makes his feats on the football field and in baseball rather phenomenal.\n\nMuch of the book also details the unbelievable feats he performed, from super long home runs in baseball, running so fast he had to walk up a wall in the outfield, his long touchdown runs, his preternatural speed, crazy throws from the outfield to get runners out at home, his track and field exploits at Auburn, it’s all documented here.\n\nOne wonders what would have happened had he dedicated himself to just one sport and put in the sweat and mental equity needed to be truly great. Of course, he would have had to avoid such a catastrophic injury.\n\nThat’s what makes Bo Jackson’s story one of what could have been.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B09PGDL5VX\nPublisher ‏ : ‎ Mariner Books (October 25, 2022)\nPublication date ‏ : ‎ October 25, 2022\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 42007 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 496 pages"
  },
  {
    "title": "Phil: The Rip-Roaring (and Unauthorized!) Biography of Golf's Most Colorful Superstar",
    "author": "Alan Shipnuck",
    "ratingCount": "2,412 ratings",
    "ratingStarts": "4.3 out of 5 stars",
    "synopsis": "NEW YORK TIMES BESTSELLER * “A rollicking good time.” —Golfweek * “Thoroughly engaging.” —The Washington Post Now with a new afterword: a juicy and freewheeling biography of legendary golf champion Phil Mickelson—who has led a big, controversial life—as reported by longtime Sports Illustrated writer and bestselling author Alan Shipnuck.Phil Mickelson is one of the most compelling figures in sports. For more than three decades he has been among the best golfers in the world, and his unmatched longevity was exemplified at the 2021 PGA Championship, when Mickelson, on the cusp of turning fifty-one, became the oldest player in history to win a major championship. In this raw, uncensored, and unauthorized biography, Alan Shipnuck captures a singular life defined by thrilling victories, crushing defeats, and countless controversies. Mickelson is a multifaceted character, and all his warring impulses are on display in these pages: He is a smart-ass who built an empire on being the consummate professional; a loving husband dogged by salacious rumors; a high-stakes gambler who knows the house always wins but can’t tear himself away. Mickelson’s career and public image have been defined by the contrast with his lifelong rival, Tiger Woods. Where Woods is robotic and reticent, Mickelson is affable and extroverted, an incorrigible showman whom many fans love and some abhor because of the overwhelming size of his personality. In their early years together on Tour, Mickelson lacked Tiger’s laser focus and discipline, leading Tida Woods to call her son’s rival “the fat boy,” among other put-downs. Yet as Tiger’s career has been curtailed by scandal, addiction, and a broken body, Phil sails on, still relevant on the golf course and in the marketplace. Phil is the perfect marriage of subject and author. Shipnuck has long been known as the most fearless writer on the golf beat, and he delivers numerous revelations, from the true scale of Mickelson’s massive gambling losses; to the inside story of the acrimonious breakup between Phil and his longtime caddie, Jim “Bones” Mackay; to the secretive backstory of the Saudi golf league that Mickelson championed to wield as leverage against the PGA Tour. But Phil also celebrates Mickelson’s random acts of kindness and generosity of spirit, to which friends and strangers alike can attest. Shipnuck has covered Mickelson for his entire career and has been on the ground at Mickelson’s most memorable triumphs and crack-ups, allowing him to take you inside the ropes with a thrilling immediacy and intimacy. The result is the juiciest and liveliest golf book in years—full of heart, humor, and unexpected turns.",
    "numberOfPages": "251",
    "reviews": [
      {
        "userName": "Shakespeare66",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Alan Shipnuck's unauthorized biography of Phil Mickelson is an outstanding book of research. It took Shipnuck a long time to get to the point of writing a biography of one of golf's greatest legends. With the work he produces, it does not disappoint. Shipnuck is more than fair in his portrayal of Mickelson and his family. He shows us both sides of a life: the good and the bad of Phil Mickelson.\n\nFirst of all, Shipnuck let's us see Phil Mickelson in action as a person. He shows us a man who signs autographs endlessly for his fans ala Arnold Palmer. I think Phil modeled his on course and off course behavior with the fans after Arnold. He felt that having a crowd support him is better than the crowd being against him. Arnie had his \"Army\" and so did Phil. Phil also endeared himself to players on the PGA tour and many in the book sing his praises. However, there are those who would not. Phil can be offensive with his mouth often calling people by nicknames. Some are nice; others condescending. Phil showed himself to be a leader and a motivator. He showed himself to be highly motivated to win, and especially to win majors.\n\nPhil is shown to be a great husband when his wife, Amy, was stricken with cancer. His victory at the Masters in 2010 showed us that. He was incredibly supportive during the birth of their children.\n\nPhil and his family were shown to be charitable to many causes. Phil treated the people who worked for him at golf tournaments by tipping them generoursly. His counterpart, Tiger Woods, was considered to be cheap. It is well known. Phil helped families who suffered misfortunes. His family were generous to the community.\n\nOn the other hand, Shipnuck has shown to us a \"darker\" side if you will of Phil Mickelson: his shady dealings with nefarious people and his penchant for gambling. We are all flawed. Phil is no exception. We learn of the dubious insider trading deal, his connection to bookies that were sleasebags ( one bilking Mickelson out of 500K), and gambling gambits that lost him millions of dollars. If one is making 50 million a year, what's a ten million dollar loss for four years in a row? But the more overriding concern of his gambling is the depth of the loss that none of us know about. Was there more than we know? Did he sell his Gulfstream airplane because he had money issues? Was Phil's overwhelming drive to win golf tournaments to pay back gambling debts or to make history? Why did he owe 900k to Jim \"Bones\" Mackay? Why did Phil not allow Jim to have the 18th hole flag of Phil's victories ( Phil manages to pay 800k to Jim and sent him 4 flags)? How can a golfer of his stature \"owe\" that much money to his caddie? Perhaps we will never know the full story about the gambling that Mickelson has done, and perhaps it is none of our business. And he is well known for relating his feelings about the taxes he has to pay in the State of California! Gee, I guess he did not have enough left over?\n\nPhil then lets his mouth get the better of him when he relates how he feels about the PGA Tour. He questions why a company with 800 million dollars in the bank is a charitable non-profit organization. He lets other things come out that were aired and he is immediately punished by his corporate sponsors. Sometimes it is best to leave things behind closed doors. In my readings, Phil has a lot of good points about the PGA tour that have already been modified. Larger amounts of money for winning tournaments has already happened in their response to players abandoning the tour for the richer Saudi League. The jury is still out about who is righter on the issue of Phil's complaints. Phil is a bold with his mouth as he is with his play on the golf course: both of these traits have cost him dearly but you have to admire a man with his courage.\n\nThere was no doubt that Phil was driven to make golf history, but he had to fight Tiger Woods to make that history. Just ask any of those who played against Nicklaus what they had to do to beat the guy! There were several who did not back down. Phil's gambling style on the golf course cost him a number of majors and never being able to win the US Open is one of his greatest failures. He did lose because of himself a number of times when he missed putts he should not have and made shots that cost him dearly. We learn that he could not have done it any other way. I heartily disagee. A 4 iron, a five iron, a chip and two putts could have easily won the US Open at Winged Foot. His 6 runner up finishes were all his fault.\n\nAfter reading the book, I am a fan of Phil Mickelson for life. He has shown such courage and he has shown that his is just a human being like the rest of us. He has made his mistakes and perhaps he has not thought things through clearly but his outspoken comments are probably 100% accurate. I will cheer for him whenever I see him play. I cannot do the same for Tiger. That is a different story.",
        "stars": "5.0"
      },
      {
        "userName": "hkgypsy",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I enjoyed reading about this complicated golfer in todays world. I’ve followed Phil for the entirety of his career. One minute I’m angry with him, the next, I applaud Phil for stepping out of the PGA zone to call them out. Looking forward to the next book. Would help him I he could control his Gambling.",
        "stars": "4.0"
      },
      {
        "userName": "Carl Owens",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Book arrived in a timely manner.",
        "stars": "5.0"
      },
      {
        "userName": "vegasbill",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If you're not a golf geek or fan of Phil Mickelson this book is probably not for you. It tells the tale from childhood to current day of an exceptionally talented golfer whose personality, charm and charisma together with the afore mentioned talent carried him to the pinnacle of success in his field. Like most idols he also has feet of clay and has made some mistakes along the way. All of his exploits on the golf course have been fully chronicled. This book spends about 75% of its time retelling those experiences and giving some insight into Mickelson's thought processes, shot by shot. This does get a bit tiring and repetitive. The best parts of the book are the behind the scenes look at Phil's family life, which is reminiscent of \"Ozzie and Harriet\", too good to be true, but according to the author is true. Also his oversized and often unpublicized philanthropy, his gambling addiction, his facility for saying the wrong thing at the wrong time, his facility for saying the right thing at the right time, his immense confidence in himself, his relationship with his caddy of 25 years and how he is viewed by his peers. Phil has been and probably will continue to be for at least a few more years the swashbuckling, risk taking golfer we have all admired from afar. This book gives us a close up look at the man, warts and all.",
        "stars": "4.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Interesting book, I found it entertaining",
        "stars": "5.0"
      },
      {
        "userName": "roscoepwavetrain",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I'm a Phil fan and read this book for obvious reasons given the latest headlines. I thought what I would be reading was a hit job but the book really isn't that. In fact, I thought it was fairly balanced in presenting multiple takes on Phil and his history. I never felt that the writer was trying to tear Phil down and my guess is he still has some fondness for him after all these years. The book spends plenty of time on the messier side of all things Phil but there was plenty of time dedicated to more positive aspects. I did feel the book seemed to not have a singular voice and was kind of choppy at times. My guess is it was heavily edited someone other than the author was pulling the strings in the book. In the end was my opinion of Phil changed? No, the dude is a champion and one of the best at what he does, and, shocking, he's human. As someone who enjoys gambling, I didn't see the big deal on all the harping on that and so what if the guy can occasionally be a prima donna, again, who cares. I \"guess\" I have a more realistic view of him after reading this book as there was some new stuff, but it seems that writers like this are obsessed with the notion that the public is blind to the faults of our heroes. its a gullible notion at best as anyone who has been alive for more than 30-years doesn't do this regularly.",
        "stars": "3.0"
      },
      {
        "userName": "Dog Lover",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I am a huge PGA golf fan. I very much looked forward to this book when I heard about it. It started ok, and then it just got lost, in my opinion. I do all of my reading on my kindle, and I have never looked up so many words to get a definition of the word. Then when I would see the definition I would think, well why didn't you just use THAT word ;-) It was like the author was trying to impress you with his vocabulary. In many places I found it hard to follow, the book would be describing a golf tournament, and then I'd have to page back to figure out which one, it was just so much minutia and name dropping. And of course the big \"reveal\" in the end with the interview with Phil last December that was supposedly \"off the record\" in Phil's view, I felt it was about the author's journey at that point, not Phil's. If you're a Phil fan or a big golf fan, go ahead and read it, but compared to some of the lengthy, excellent biographies I've read about Tiger, this one pales in comparison. I felt the author's ego through the whole thing. Disappointing.",
        "stars": "3.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B09JPJC4L4\nPublisher ‏ : ‎ Avid Reader Press / Simon & Schuster (May 17, 2022)\nPublication date ‏ : ‎ May 17, 2022\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 1725 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 251 pages"
  },
  {
    "title": "The Score Takes Care of Itself: My Philosophy of Leadership",
    "author": "Bill Walsh",
    "ratingCount": "2,031 ratings",
    "ratingStarts": "4.6 out of 5 stars",
    "synopsis": "The last lecture on leadership by the NFL's greatest coach: Bill Walsh   Bill Walsh is a towering figure in the history of the NFL. His advanced leadership transformed the San Francisco 49ers from the worst franchise in sports to a legendary dynasty. In the process, he changed the way football is played.  Prior to his death, Walsh granted a series of exclusive interviews to bestselling author Steve Jamison. These became his ultimate lecture on leadership.  Additional insights and perspective are provided by Hall of Fame quarterback Joe Montana and others.  Bill Walsh taught that the requirements of successful leadership are the same whether you run an NFL franchise, a fortune 500 company, or a hardware store with 12 employees. These final words of 'wisdom by Walsh' will inspire, inform, and enlighten leaders in all professions.",
    "numberOfPages": "300",
    "reviews": [
      {
        "userName": "Steven Haiser",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Reading this book takes you beyond the X’s and O’s and reveals the true cost of success. It also highlights the steps it takes to not get consumed by that price:\nLong read but excellent book.",
        "stars": "5.0"
      },
      {
        "userName": "Michael J. Nilsson",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I had the privilege of meeting Coach Walsh on multiple occasions, and was always impressed by the focus he maintained on the person he was speaking with. He took a genuine interest in others and particularly in those who he coached. While much of his book may contain common sense to many of us, his presentation of maxims to live and work by can be understood and applied by anyone who cares to live-up to being the best they can be. This book will not disappoint anyone who chooses to learn from a master of motivation and professionalism.",
        "stars": "5.0"
      },
      {
        "userName": "Strider",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I picked up this book as I am in business, lead a team and wanted to get better at coaching. Bill Walsh is a coaches coach as he brought about great teams, organizations, models and singlehandedly is responsible for many many coaches who are now head coaches. I think John Maxwell outlines all the coaches that came to head positions after working with Bill Walsh and it is pretty unbelievable.\n\nThe author is great and telling a story, packing in a lot of information and showing the human side to Bill Walsh. I am familiar with the author as he wrote many John Wooden books which are very good.\n\nOne huge takeaway from the book is Bill Walsh was an incredible smart and creative person. Reading 50 pages of the book you'll know that as it is JAM PACKED with tons and tons of examples, steps and plans on everything he did. I mean everything as it gets down to how he wrote job descriptions for the receptionist at the 49ers. If you are a coach or leader there is much to be gained as there is plenty to glean from and ponder to how you do and lead what you lead. Often I had to put the book down as there were so many different examples and things to think about as I was searching and thinking through how j could apply his examples to my work.\n\nThe human side is very honest as well as it touches the coaches life in winning, losing, leading, coaching, family and brines of depression. Makes you understand what perhaps some coaches deal with.\n\nThis is a great book for anyone who is a coach or business leader as you see a very honest a fine example of what goes into the habit and outcome of excellence which no doubt Bill Walsh created. I would recommend it.",
        "stars": "4.0"
      },
      {
        "userName": "JSJ",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book is about Bill Walsh’s philosophy of leadership that he implemented with the San Francisco 49ers. It is inspiring and relevant for any leader or anyone who wants to be leader. He describes his Standard of Performance, a way an organization can achieve excellence and execute towards perfection, and the definition of success for the organization as well as concepts and fundamentals of leadership and the lessons he learned. What made these ideas come to life was the examples interspersed with the lessons in the book.\n\nWhen I started the book, I knew about Bill Walsh at a high level about Bill Walsh as the leader of the 49ers, just what I got from the news headlines. Now I have a better understanding and appreciation for the 49ers organization and what he did as the head coach and GM. I will be studying Bill’s values, principles, and leadership philosophy as I develop my own.",
        "stars": "5.0"
      },
      {
        "userName": "Kal",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Everyone who is interested in leadership will gain from this book! There have been many great books on leadership, and this is one of them.",
        "stars": "5.0"
      },
      {
        "userName": "JKom",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If you have seen the NFL Network's series, \"A Football Life\", you may have seen the 90-min special they did on Bill Walsh. The video documentary is EXCELLENT, and paints a compelling story of this fascinating and brilliant man. This book, in progress at the time of his death, was finished by his son with the help of Steve Jamison. Several of Walsh's players and friends add their own insights in this book, which add to the interest.\n\nLike all of Walsh's work, it's more a series of short essays, collected and sorted into manageable categories. They are based on the speeches he gave after retiring from coaching. Now, as a management system I don't think he says anything that Steven Covey and others haven't said. But if you have ever wondered if the guy was really as good as his fans claim, or why the Niners were the 2015 laughing stock of the NFL, all you need to do is read this book to understand:\n\n1) Yes, he really was as brilliant as his fans claim\n2) Yes, his burnout was inevitable; he cared too passionately, too intensely about perfection\n3) No, nobody in the current Niner organization even comes within ten Levi Stadiums' distance of Walsh' football expertise and management skills.\n\nReading this, you understand that coaches like Mike Holmgren and Bill Belicheck are the real Walsh fans. And how success breeds success, but also the never-ceasing, crushing pressure that accompanies it. HIGHLY RECOMMENDED for all football fans.",
        "stars": "5.0"
      },
      {
        "userName": "D. Towe",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is not a bad book and I enjoy autobiographies from people who have succeeded but this book felt like it was a self published. I know it was not but often the same thing would be said over and over again only in a different way. It almost felt like someone was just trying pad the book.\n\nI did learn a lot about how football was changed by this man but that is about it.",
        "stars": "3.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B002G54Y04\nPublisher ‏ : ‎ Portfolio (July 3, 2009)\nPublication date ‏ : ‎ July 3, 2009\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 1864 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 300 pages"
  },
  {
    "title": "Bedtime Adventure Stories for Grown Ups",
    "author": "Anna McNuff",
    "ratingCount": "1,020 ratings",
    "ratingStarts": "4.5 out of 5 stars",
    "synopsis": "WHAT AMAZON READERS ARE SAYING ABOUT BEDTIME STORIES:★★★★★ \"Just magic!\"★★★★★ \"Feels like chatting to your (slightly adventure mad) friend over a warming drink\"★★★★★\"Funny, relatable... just brilliant.\"★★★★★ \"Makes you want to leave your safe, comfortable sofa and explore the amazing, big, wide world\"★★★★★ \"I was trying to ration myself to one story each night before bed... but I devoured it.\"★★★★★ \"Left me inspired and itching to get back out in the great outdoors!\"★★★★★ \"A neat little shot of adventure inspiration\"★★★★★ \"Anna is an adventure storytelling wizard!\"★★★★★ \"Just what I needed to read after a year of travel restrictions\"BOOK DESCRIPTION:Have you ever wanted to kayak down a gorge in New Zealand? Or run night-time marathons through the Californian desert? How about rollerblading 100 miles around Amsterdam?You have? Then pour yourself a cup of cocoa, get those jim-jams on and prepare to escape into a world of adventure with this collection of life-affirming short stories from award-winning adventurer Anna McNuff.You'll go road trippin’ through the Canadian winter. Bivvy out on a mountaintop in Wales. Explore pockets of wilderness around the city of London and take a journey by bike across Europe.Always upbeat and often insightful, Bedtime Adventure Stories is the antidote to adult life. It’ll have you drifting off into the land of nod, dreaming up journeys of your very own – and it’s proof that the only thing standing between you and the next wild adventure is a willingness to step beyond your front door.★ Because grown-ups need bedtime stories too ★",
    "numberOfPages": "196",
    "reviews": [
      {
        "userName": "Katherine",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Anna's writing style is conversational and easy to read. Her adventures are interesting, and although I confess, I have no interest in running through the desert at night, I did look up Salton by the Sea, and added it to my bucket list. I love her spirit of adventure!",
        "stars": "5.0"
      },
      {
        "userName": "Tracie Wright",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is the first book I have read of Annas'. I am 63 years young and enjoyed going on adventures through her words. This is a great read and got back on Amazon to order more of her books and take adventures with her doing things that I am unable to do.\nHave fun reading her books. I am!",
        "stars": "5.0"
      },
      {
        "userName": "W S D nz",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Upbeat micro travel stories with some fantastic mental health lessons thrown in the mix too. Absolutely love anything written by this amazing lady.",
        "stars": "5.0"
      },
      {
        "userName": "Sarah",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Anna seems to be an adventure superstar I just discovered by reading this amazingly fun book of adult bedtime stories. Being a walker/hiker myself it was great to immerse myself in stories of biking/running. Enjoy!",
        "stars": "5.0"
      },
      {
        "userName": "Rachel",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Loved reading the stories with my book club. Such an inspiring collection of beautiful lived experiences. I admire the author's bravery, it made me want to drop everything and go on a little trip.",
        "stars": "5.0"
      },
      {
        "userName": "Gail Blanchette LaPrino",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Ok I'm a couch potato who gets adventure vicariously. This book was at times great fun. At others I thought \"is she CRAZY???\" Either way she's really funny and I greatly enjoyed this book.",
        "stars": "5.0"
      },
      {
        "userName": "Ken Wallin",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A not-so-well-known writer (me!) once said \"Adventure is whatever you make of it, wherever you find it, from the ends of the earth to your own backyard.\" Anna McNuff's Bedtime Adventure Stories brings that point home well. Although I'm not sure they should be called \"bedtime\" stories, because they are anything but dull and sleep-inducing. Excitement abounds, and of course, adventure awaits, around each bend of the trail or over the next hilltop. (Loved the cover, by the way!) Ends of the earth? How about an adventure race across New Zealand? Your own backyard? Camping out right in London or a midnight run through the Southern California desert. This book has inspired me to not only hold onto dreams of big adventures, but to look for the microadventures to be had close at hand, in everyday life, for life itself is the greatest adventure of all, if only you know where to look.",
        "stars": "5.0"
      },
      {
        "userName": "Ali",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Why did I wait so long to buy this book? I laughed my way through each story. I loved the details, humor and honesty that Anna brought to each tale. Can't wait to read another of her books.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B094J85L6Z\nPublication date ‏ : ‎ May 9, 2021\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 7027 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 196 pages"
  },
  {
    "title": "Althea: The Life of Tennis Champion Althea Gibson",
    "author": "Sally H. Jacobs",
    "ratingCount": "2 ratings",
    "ratingStarts": "5.0 out of 5 stars",
    "synopsis": "“A captivating book that brilliantly reveals an American sports legend long overlooked. Sally Jacobs tells the riveting story of Althea Gibson, my personal shero, who overcame daunting odds – on the tennis court and off - to stand at the world pinnacle of her sport and became an inspiration to many.” — Billie Jean KingIn 1950, three years after Jackie Robinson first walked onto the diamond at Ebbets Field, the all-white, upper-crust US Lawn Tennis Association opened its door just a crack to receive a powerhouse player who would integrate \"the game of royalty.\" The player was a street-savvy young Black woman from Harlem named Althea Gibson who was about as out-of-place in that rarefied and intolerant world as any aspiring tennis champion could be. Her tattered jeans and short-cropped hair drew stares from everyone who watched her play, but her astonishing performance on the court soon eclipsed the negative feelings being cast her way as she eventually became one of the greatest American tennis champions.Gibson had a stunning career. Raised in New York and trained by a pair of tennis-playing doctors in the South, Gibson’s immense talent on the court opened the door for her to compete around the world. She won top prizes at Wimbledon and Forest Hills time and time again. The young woman underestimated by so many wound up shaking hands with Queen Elizabeth II, being driven up Broadway in a snowstorm of ticker tape, and ultimately became the first Black woman to appear on the cover of Sports Illustrated and the second to appear on the cover of Time. In a crowning achievement, Althea Gibson became the No. One ranked female tennis player in the world for both 1957 and 1958. Seven years later she broke the color barrier again where she became the first Black woman to join the Ladies Professional Golf Association (LPGA). In Althea, prize-winning former Boston Globe reporter Sally H. Jacobs tells the heart-rending story of this pioneer, a remarkable woman who was a trailblazer, a champion, and one of the most remarkable Americans of the twentieth century.",
    "numberOfPages": "457",
    "reviews": [
      {
        "userName": "Literary Redhead",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This brilliant bio of Althea Gibson, #1 ranked female tennis player in the world in 1957 and 1958, and the first Black woman to join the Ladies Professional Golf Association, captures in fierce prose the many obstacles Gibson overcame throughout life to reach tennis' pinnacle. A must-read masterpiece by Pulitzer Prize-winning author Sally H. Jacobs, both inspiring and heartbreaking.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B09Y44MRHS\nPublisher ‏ : ‎ St. Martin's Press (August 15, 2023)\nPublication date ‏ : ‎ August 15, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 28593 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 457 pages\nPage numbers source ISBN ‏ : ‎ 1250246555"
  },
  {
    "title": "Feherty: The Remarkably Funny and Tragic Journey of Golf's David Feherty",
    "author": "John Feinstein",
    "ratingCount": "273 ratings",
    "ratingStarts": "4.2 out of 5 stars",
    "synopsis": "The definitive biography of enigmatic golfer, commentator, and performer David Feherty—one of the most universally beloved figures in the game. John Feinstein, who has spent four decades finding intriguing sports characters and narratives and turning them into classic books, chronicles the life and career of David Feherty. The two have known each other for years, beginning with Feinstein’s work on A Good Walk Spoiled, researched and written at a time when Feherty was an excellent player, who won five times in Europe and was on the '91 Ryder Cup team, but also a functioning alcoholic. In retirement from the game, Feherty has sobered up, while his golf world persona has only grown in stature. Feherty is now a grand ambassador for golf, a man who is feted by US Presidents and respected by every big name in the game.   Feinstein tells hilarious true tales about Feherty’s time in the limelight and interactions with stars such as Tiger Woods, Rory McIlroy, Payne Stewart, and Seve Ballesteros. He also details Feherty’s struggles with alcoholism, the death of his son who was lost to addiction, and the highs and lows of Feherty’s marriages. Feinstein captures the human being behind the athlete, and his triumphant rebound as a golf commentator after his athletic career fell apart. Feherty is fall-down-funny, self-deprecating, and a lifelong underdog who has thrived as a commentator and television interview host, and most recently as a touring standup comic, using the difficult experiences of his life as a source for humor and understanding, which Feinstein mines with an expert’s touch.",
    "numberOfPages": "273",
    "reviews": [
      {
        "userName": "Charles A. Oschack",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If you like David Feherty you will love him after reading this book. It’s heart breaking to see such a good man struggle with with the demons that he has battled his whole life but it gives you a greater appreciate for what he has accomplished. It does have its funny moments - after all it is Feherty. I agree with previous review that several stories are duplicated I feel this is a result of poor editing not poor writing. It does not detract from the portrayal of the man that John Feinstein honestly presents, warts and all.",
        "stars": "4.0"
      },
      {
        "userName": "Glen House",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "When I saw this book, I was really excited about reading it. I'm a big fan of David Feherty golf and have read many of John Feinstein's books in the past and enjoyed them. However, I'm disappointed with the writing. I enjoyed the subject matter and learned some things about David Feherty that made me consider giving this a 4-star rating. It was Feinstein's writing that lowered my rating of the book. Feinstein kept repeating himself throughout the book. As I was reading, I kept thinking that you've already told us this multiple times! I don't mind an author reiterating a point, but he does it so often it makes me think he was using filler because he didn't have more to write. The other thing that was annoying was that Feinstein kept inserting his own politics into the book. I don't care what your politics are and how you feel about certain politicians or what your stance is on issues. Stick to the subject and be an honest reporter. If you want to write a book about politics, then do so instead of trying to force your feelings upon the reader who is reading the book to learn more about the subject rather than your politics.",
        "stars": "3.0"
      },
      {
        "userName": "G. Broderick",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I very much enjoyed the book. I was not fully aware of the depth of David's struggles. I did find the bits about all his relationships a little bit redundant, there must have been a few people he didn't get along with!",
        "stars": "4.0"
      },
      {
        "userName": "bjm NYC",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Feinstein's done great work before and you get a solid sense of Feherty here and why he remains well-liked in the sporting world. You learn new things about his journey to broadcaster, including his playing career (one great detail, he was a 5 handicapper when he decided to turn pro -- that's like the best guy on your Y pickup bball team announcing he's going to try out for the NBA) and how Gary McCord got him into broadcasting. The book doesn't shy away from his demons but it also reassures you every step of the way how beloved he is and how everyone not named Colin Montgomerie likes him. But then you'll get a tossed off detail like how he takes 13 pills every day for a variety of ailments or how he makes (yes makes) sniper rifles and it's like a little peek in a much darker version of Feherty's life. And Feinstein and Feherty do a good job of explaining why he went to LIV golf.\n\nAt the same time, it's oddly and sometimes slapdashingly edited; I found myself on a number of occasions going back because I was sure we'd gotten this detail earlier and sure enough it was there, so the book often feels like it needs a good temporal edit.",
        "stars": "3.0"
      },
      {
        "userName": "J. P. Becker",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is well-written, and Feherty is an interesting character. But the book is a stretch to reach 245 pages. And Feinstein repeats MULTIPLE stories, including one three times (Feherty's first marriage being a \"nonstop hostage situation.\"\nIt's enjoyable, but make sure you've got another book primed to go, because it won't take long to get through this.",
        "stars": "4.0"
      },
      {
        "userName": "Mark",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Excellent of a troubled soul fought and fought and fought to make an impact on the golfing world I am glad he is still funny and almost grounded in his life",
        "stars": "5.0"
      },
      {
        "userName": "Mike Mezo",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I've read John Feinstein for years.....love his research and stories......Feherty has several books about his life too......truly enjoyed both Feinstein's detail, and Feherty's life challenges and successes!!!",
        "stars": "5.0"
      },
      {
        "userName": "Neal Weiss",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Great book very enjoyable reading",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0BD4HFXT7\nPublisher ‏ : ‎ Hachette Books (May 9, 2023)\nPublication date ‏ : ‎ May 9, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 20640 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 273 pages\nPage numbers source ISBN ‏ : ‎ 0306830000"
  }
]