[
  {
    "title": "Broken: The Suspicious Death of Alydar and the End of Horse Racing’s Golden Age",
    "cover": "https://m.media-amazon.com/images/I/41KzYYD1oqL.jpg",
    "author": "Fred M. Kray",
    "ratingCount": "116 ratings",
    "ratingStarts": "4.5 out of 5 stars",
    "synopsis": "One fateful winter night, a famous racehorse mysteriously broke his leg while alone in his stall. An investigation ensued, but the real story has never been told…until now.\n\nIt was a cool, quiet evening at Calumet Farm, where the most valuable racehorses—including the prolific stallion Alydar—had settled into their stalls for the evening. Alton Stone, filling in for the regular night watchman, completed his rounds at the barn. Although nothing seemed out of the ordinary, an inexplicable hunch led Stone to check on Alydar. What he found—a grievously injured horse with no discernible cause—jump-started one of the biggest mysteries to ever hit the horse racing world.\n\nOne part true-crime investigation, one part evocative history of the adrenaline-filled days of horse racing’s golden age, Broken follows Alydar’s rise to fame and then dives into the sordid details of the crime and trial that came to define his legacy. Told with the taut pacing of a legal thriller, Broken investigates Alydar’s death, the $41.5 million insurance payout, and the stain it left on the sport of horse racing.\n\nThroughout, animal law attorney and author Fred M. Kray weaves together shocking testimony and key evidence from the trials, featuring dramatic photos taken the night of the incident. Drawing on interviews conducted with more than twenty-five key witnesses, Kray reveals insider-only details and, in order to discover the truth about the death of this magnificent horse, embarks on a major investigation—one that leads to an unexpected and startling conclusion.",
    "numberOfPages": "376",
    "reviews": [
      {
        "userName": "Mary E. Parsons",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book is nonfiction that reads like a mystery...I knew that name of this horse but I did not know the drama and ongoing controversy.\nI should reveal that I have known the author for years...back in the day when he was a trial lawyer so I suppose that I am not entirely unbiased but...I loved this book.\nI don't usually read much non fiction but this book is highly readable and tells an interesting, suspenseful story. The research is extensive and includes the difficulty in finding witnesses and then persuading them to talk. Kray did an excellent job explaining how that worked and the personal toll of the frustration.\nOf course, the backstory about Alydar is very important and it makes the event even more heartbreaking. It seems that while he had dedicated trainers there was an underlying issue regarding the treatment of the horse. It's easy to forget that these horses are a valuable investment and it is expected that they get results. In Alydar's care it wasn't that he lacked results, it was the financial need of the owners who treated him as a piece of property.\nI cried during the description of what happened to the horse..cruel doesn't even begin to describe the whole event. Kray lays out the evidence and we get to analyse and come to conclusions...we are not nudged either way even though I know the author has his own opinions!\nI highly recommend this book...it is interesting, well written and readable.",
        "stars": "5.0"
      },
      {
        "userName": "arlene edwards",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Very good book!",
        "stars": "4.0"
      },
      {
        "userName": "Trisha M",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "There are 2 books on the racehorse, Alydar. Wild Ride, which is about the history of Calumet Farm and subsequently the story of Alydar, and now Broken. Broken reads like a great true crime investigation. Author did an outstanding job writing about such a sad situation. He provides facts, documentation, and coincidences. As heartbreaking as the story of Alydar is, this book pays a wonderful tribute to his memory.",
        "stars": "5.0"
      },
      {
        "userName": "Jim Altfeld",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The in depth research and investigation performed by the author, right down to the most minute detail is incredible. He leaves no stone unturned and everyone remains a suspect or at least in collusion. It's a tremendously insightful book that points out both the good and bad in horse racing. And the way he turned the book into a trial where the reader becomes a jurist was not just clever, but extremely well done. Only an attorney who represents animals could have pulled this off. Well worth the read.",
        "stars": "5.0"
      },
      {
        "userName": "Elizabeth",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Really fascinating. If you're a fan of horses or true crime you will love this book. I was unable to put it down. The author does a great job of explaining a complex case, while also giving insight into Alydar's personality. I loved it, even if it was brutally honest and hard hitting at times. 5 out of 5 stars. I will be thinking about this book for a long time.",
        "stars": "5.0"
      },
      {
        "userName": "Geoffrey Russell",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A great read. Wonderful detail.\nBrilliant way to end the book.\nI have recommended it to many.",
        "stars": "5.0"
      },
      {
        "userName": "Avid Reader",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "One of my fav books is Wild Ride. Mr. Kray took this story a step further in his quest to find the truth for Alydar. What an incredible horse, his legacy lives on. There should be do doubt that someone was responsible for his death, too many coincidences. JT Lundy was an evil, despicable man who is burning in hell. What he did to Calumet Farm was horrendous, that including Alydar.\nMy wish is that Calumet Farm will open to the public so many could visit this historic farm and give our condolences to Alydar. He deserves remembrance and recognition of his accomplishments.\nThank you Mr. Kray for defending Alydar.",
        "stars": "5.0"
      },
      {
        "userName": "Rock on Lily",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Such a sad story of a wonderful horse. Arrived in good order",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0BSN24XZS\nPublisher ‏ : ‎ Live Oak Press (May 2, 2023)\nPublication date ‏ : ‎ May 2, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 5448 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 376 pages"
  },
  {
    "title": "Catching the Captain (Charleston Coyotes Hockey Book 2)",
    "cover": "https://m.media-amazon.com/images/I/51LqoVdSQPL.jpg",
    "author": "Jacob Chance",
    "ratingCount": "528 ratings",
    "ratingStarts": "4.3 out of 5 stars",
    "synopsis": "When Kaiden Hart, the captain of the Charleston Coyotes hockey team, comes to my aid in an emergency, it’s the first time I’ve seen him since I was a young girl.\n\nAnd boy, have the years been kind to him.\n\nWhen he invites me out to dinner, accepting seems like the polite thing to do.\n\nAt least that’s what I tell myself.\n\nHow else can I justify wanting to be near my older sister’s ex-boyfriend?\n\nIt couldn’t have anything to do with his piercing blue eyes and kissable lips.\n\nWho cares if he’s got chiseled abs and a rear end I could bounce a quarter off of?\n\nIt’s definitely not how protective he is toward me. Or how thoughtful he is offering me his spare room when I need a temporary place to stay.\n\nI know I should refuse. Really, I should run in the opposite direction.\n\nBut it’s too late. I’m already falling for him.\n\nNow, all I can think about is catching the captain.\n\nThis is a standalone feel good low angst hockey romance where the protective hero get struck with a case of insta love and falls hard for the heroine.",
    "numberOfPages": "205",
    "reviews": [
      {
        "userName": "Linda J. Olinger",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "When Kaiden Hart comes to her rescue she’s blindsided! Rori hasn’t seen him for nearly decade when he dated her older sister when they were in college. Does that make him off limits because he’s her sister’s ex?\nMaybe he’s too fine and too nice to let that be a deciding factor!\nA cute story about an aging hockey player who re-meets (Is that a word?) a beautiful younger woman and is immediately smitten!\nGreat story, hot hockey players, serious steamy scenes..... You’re going to love this book!",
        "stars": "5.0"
      },
      {
        "userName": "Krisha Bledsoe",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Catching the Captain by Jacob Chance was unput downable! Once I got started I fell in love with Kaiden and Rori. Rori's character is one to love her beauty, independence and determination to live her life on her terms. And Kaiden the hot , rich, protective and very big Hearted Captain of the Coyote Hockey team.\nThe meeting is a unexpected collision. The instant attraction is a explosion that they didn't expect. Kaiden is the truly the boyfriend of the year. OMG I really couldn't get enough of both of them and the way he was with Rori. I extremely recommend reading Catching the Captain by Jacob Chance he truly never disappoints in writing a book.\nHe always gets the five Stars.\nLove your books Jacob.",
        "stars": "5.0"
      },
      {
        "userName": "Kiesha",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "They only issue I had with this book was the ending.\nSheesh no epilogue to wrap it up just a lame sex scene🙄 I though he was going to purpose at the party wth 🤦🏽‍♀️. Other than the readers having to create our own future for this couple lol Kaiden and Rori we a great couple!",
        "stars": "4.0"
      },
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I liked this book well enough. What I wanted was a more complete conclusion. This ending didn't feel as though it was wrapped up enough. Where did they go in there relationships with each other and with the sister. There was room for a whole different line of story there. Missed opportunities.",
        "stars": "4.0"
      },
      {
        "userName": "N Hesse",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Catching the Captain is a captivating story the hooked me from the very beginning. This book had it all – heart, passion, humor, and emotion. The storyline was very-well written. I adored the push and the pull between Kaiden and Rori; their chemistry was so natural and relatable. The emotions radiated from the pages and the swoon-worthy moments were breathtaking. There was no angst or drawn-out drama – simply a beautiful story about two characters who find love when they least expect. This book was everything I hoped for in Kaiden’s story and more. I loved every second of this story and didn’t want it to end!! This book is a must read!!",
        "stars": "5.0"
      },
      {
        "userName": "Tiffany Levin",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The second book in the Charleston Coyotes Hockey series features the captain, Kaiden, who finds the love of his life, Rori, after she almost gets hit by a car. While she is a blast from his past, he didn’t really know her then and they take off like a wildfire! Their chemistry is off the charts and their love is even better!!\n\nJacob does an amazing job yet again pulling you in to the story from the very beginning and holds you until the very end! Cannot wait to dove in to the rest of the series!",
        "stars": "5.0"
      },
      {
        "userName": "Letitia Bennion",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is the second book in the Coyotes hockey set. I loved the storyline with Rori and Kaiden. Kaiden is an amazing guy, and loved how he just wanted to help her, or have her back no matter what. Murphy and Ryder were awesome too, they cracked me up with their antics. There were a few hints at possible future stories. Although would\nlove to see what happens to Serena. I do wish there had been a little more on why there was such an issue with Rori's sister. I also loved their were past characters from other series that have been written.",
        "stars": "4.0"
      },
      {
        "userName": "Kathy Castillo",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is the 2nd Book in the Charleston Coyotes Series. You don't have to read the 1st Book-Wanting the Winger-but I'd recommend that you do! Kaiden is the team's Captain who meets Rori after she is almost run over by a car. She recognizes him as he used to date her older sister. Rori is 10 years younger than Kaiden & is working as a waitress while looking for a job in Sports Management. She doesn't have a great relationship with her Mother & sister. They are really nasty towards her but she does have her other sister Stella & roommate Serena as her closest friends. I don't include spoilers in my reviews but if you're a Fan of this Author & also like Hockey you won't be disappointed with this one! Looking forward to the next book in this Series!",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0C94N2RCY\nPublication date ‏ : ‎ June 22, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 2501 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 205 pages"
  },
  {
    "title": "Wrong Pucking Jersey: A Why Choose Hockey Romance (Heartbreaker Kings Book 1)",
    "cover": "https://m.media-amazon.com/images/I/51HeMH9ycML.jpg",
    "author": "Roxanne Steele",
    "ratingCount": "516 ratings",
    "ratingStarts": "4.0 out of 5 stars",
    "synopsis": "Have you ever been punched in the face by a hockey player?\n\nImagine… 6’1” all chiseled goodness, accidentally punching you out into unconsciousness because this girl right here couldn’t let the pucking douche of my ex hit the fine goalie in the face. That’s exactly what happens when you decide to jump into an explosive brawl between two rival teams, thinking they’ll stop if the coach’s daughter gets involved.\n\nYeah… that didn’t work.\n\nNow, I’m sure you’re wondering how I, Mikayla Cross Johnson, ended up in this predicament.\n\nLet’s rewind.\n\nAfter graduating with my best friend and becoming certified registered nurses, we decided to go outside the box regarding healthcare. Where did that land us? Getting a sports internship in the hopes of being the team nurse of one of the many NHL hockey teams across North America. Everything goes all fine and dandy until we have to choose different teams.\n\nIt shouldn’t be a problem until I realize the star players of each team are my exes.\nCue the theatrics.\n\nPicking the more tolerable ex-boyfriend is one thing, but digging up old wounds is another. These two used to be my best friends—my Heartbreaker Crew—who tore themselves apart. Now, I land on the rival team while my sweet father, the newly hired coach, is assigned to the other. This is the definition of messy, but it can only go downhill from here.\n\nDespite being sandwiched between two professional teams, fighting to be the winners of the NHL championships, and attempting to not fall in love with four players, I’m coming to realize one striking thing.\n\nI might be wearing the wrong pucking jersey.\n\nWRONG PUCKING JERSEY is a spicy 200,000 words ‘why choose’ hockey romance. This book stands alone as the first in a brand new hockey romance series.",
    "numberOfPages": "806",
    "reviews": [
      {
        "userName": "Teeana clark",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This was an epic read with all the feels. I was happy sad mad and everything in between. I full-on shouted mad at certain parts, and I wanted to throw my Kindle. I also full on cried my eyes out and wanted to hug a pillow. I also laughed so hard my eyes watered.\n\nHave you ever been Mary had a little lamb drunk... lol to find out what that means read the book.\n\nI love Mikayla and her men, I disliked Jayce from the get-go. I'd like to say he deserved what he got in the end, but I just can't. He realized his mistakes in life, and I felt bad that he was dealt the hand he got in the last chapter.\n\nI absolutely loved this book and would definitely read it again.\n\nI would, however, like to point out that I came across quite a few grammar issues while reading and a place or two where names were mixed up. I also felt that the story had a few areas that could have been cut down in word count, and they still would have come across as intended.\n\nI would still recommend it. However, it would also be nice for the author to reread through and fix those issues so the paperbacks and hardbacks don't have the issues.",
        "stars": "4.0"
      },
      {
        "userName": "Brit K.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "So, I liked the storyline, and towards the end, it crushed me a few times. However, the names changing so much and not even the many nicknames like the actual names were incorrect was driving me crazy. When Dimitri calls his adoptive father James, but in the front of the book and even beginning calls him David. Then, when Dimitri and Mikayla are stuck in traffic, it keeps saying Dimitri instead of Damien. Even Maddox had his middle name changed a few times. I gave it a 4 because I did like the story/plot.",
        "stars": "4.0"
      },
      {
        "userName": "Jordan",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book was a hard start. As a person who enjoys why choose romance I was eagerly awaiting this release. The book took a few chapters to get into, and the background of the characters wasn’t always clear, however after a while I was able to see the authors direction. With twists and turns, new loves and old flames forming a wild new relationship it was fun to read. This book is a mfmmm, however the spice level is a 2/5. It’s more thrilling than romance if you get my hint. The ending was definitely justice personified yet surprising. I look forward to the next installment with new characters later this year.",
        "stars": "4.0"
      },
      {
        "userName": "Ericka Gutierrez",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I really enjoyed this book, despite the few editing errors. The character development was so good and they took you on a rollercoaster of emotions. Loved how there was spice, laughter, tears and some mystery. I've never read Roxanne Steele before, but will be waiting (im)patiently for more books from this hockey world of hers. Great second chance, why choose Hockey romance!",
        "stars": "4.0"
      },
      {
        "userName": "Raquel",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This was an intense week thought of, beautiful read. I still don't know how to feel about the ending. But I loved how Makaylas' relationship progressed with her men and their maturity with looking back at the past.",
        "stars": "4.0"
      },
      {
        "userName": "Victoria Fulton-McArn",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This story definitely isn't what I thought it would be. It will have you crying, laughing, yelling and falling in love. I really hope the author will write a extra bonus chapter so we can see what will happen to Mikayla and her men in the future. I love how this book also has a new age vibe to it very refreshing. Spicy Level: 🌶🌶🌶.5",
        "stars": "5.0"
      },
      {
        "userName": "galina sulaiman",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I enjoyed this book and gosh does it hurt that the one I wanted to heal, did but didn’t. Am wondering if murder was intentional. Call me whatever you want, but I feel shady vibes from brother dearest, Moscow puck bunny as well.",
        "stars": "4.0"
      },
      {
        "userName": "Crystal Guzman",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Wow!! I didn't see that ending! I really am sitting here shocked. I loved it! I waited months for this book and couldn't put it down!! The chemistry between Mikayla and Maddox!! Hot, hot, hot!! And then Damien, Ace, and Wolfgang! This is a second chance romance, childhood sweetheart romance, RH, and sports romance. She's the girl who they all fell in love with as teenagers. But now they're adults, doing adult things. Very steamy!! Very angsty!!! The slow burn was so good, just them trying to navigate how a relationship would work and being brave enough to not care what anyone thinks. I loved how confident Maddox and Damien were! They were not letting anyone get in the way of their happiness. I loved the different POV's and getting to see Mikayla though each of the guys POV. No spoilers, but this was probably one of the only books that I've ever empathized with the villain. I laughed and I cried and I'm so sad it's over!!",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0C5V7GXLW\nPublication date ‏ : ‎ June 30, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 5956 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 806 pages"
  },
  {
    "title": "Into the Abyss: An Extraordinary True Story",
    "cover": "https://m.media-amazon.com/images/I/51+ET6nvFmL.jpg",
    "author": "Carol Shaben",
    "ratingCount": "5,885 ratings",
    "ratingStarts": "4.3 out of 5 stars",
    "synopsis": "Read the \"gripping and emotionally affecting\" book where four men survived the plane crash. The pilot. A politician. A cop... and the criminal he was shackled to (Washington Post).\n\nOn an icy night in October 1984, a commuter plane carrying nine passengers crashed in the remote wilderness of northern Alberta, killing six people. Four survived: the rookie pilot, a prominent politician, a cop, and the criminal he was escorting to face charges. Despite the poor weather, Erik Vogel, the 24-year-old pilot, was under intense pressure to fly. Larry Shaben, the author's father and Canada's first Muslim Cabinet Minister, was commuting home after a busy week at the Alberta Legislature. Constable Scott Deschamps was escorting Paul Archambault, a drifter wanted on an outstanding warrant. Against regulations, Archambault's handcuffs were removed-a decision that would profoundly impact the men's survival.\n\nAs the men fight through the night to stay alive, the dividing lines of power, wealth, and status are erased, and each man is forced to confront the precious and limited nature of his existence.",
    "numberOfPages": "338",
    "reviews": [
      {
        "userName": "monya sigler",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I enjoyed he authors writing style as she brings to life the harrowing circumstances around the crash and rescue of a Canadian bush flight. Satisfyingly, she also takes the reader through the poignant impact of the crash of the lives of the survivors. I am pleased to have experienced this tale!",
        "stars": "4.0"
      },
      {
        "userName": "Tiffany Crosby",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I had to finish this book the moment I started reading it. I was captivated by the quest for survival against all odds and for the human quest for meaning in the midst of trauma. We can learn so much about the human spirit by survivors of tragedy. It's natural to wonder what if and think about those who missed the flight because of an unplanned happening and those who made the flight unexpectedly. Much like 9/11 and those who did not make it into the office that day for one reason or another.",
        "stars": "5.0"
      },
      {
        "userName": "Booklover",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The true story of four men, strangers to one another, who survived a plane crash and how the trauma affected each man's life.",
        "stars": "4.0"
      },
      {
        "userName": "Lafmore",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This isn't a grand survival adventure nor a sensationalized version of events. It is an exploration of how this tragedy occurred and how the experience shaped the lives of the survivors. A great deal dealt with the safety issues and how this accident affected the future of aviation in Canada. It also explores the physical, emotional and spiritual repercussions for the survivors. It is a well written, interesting story, although I felt the end got a little unfocused and rambling.",
        "stars": "4.0"
      },
      {
        "userName": "lovesroses",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "As no other secular book has done in my 70 years, this book was very profoundly moving. It really did make me stop several times while reading, and think, and search through the deepest part of me, on so many levels with such introspection.\n\nI go through books like candy, and I know that none have affected me as deeply as this book and the relevant experiences told, were, Profound.",
        "stars": "5.0"
      },
      {
        "userName": "Robert J. Ruttenberg",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I enjoyed this book and actually felt the pain the 4 survivors endured. She really captured the essence of the crash",
        "stars": "4.0"
      },
      {
        "userName": "KenO",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Having been involved in aviation as an Air Force Loadmaster, it's much easier to comprehend the magnitude of this story. Though never in a crash, there were some close calls that ended with a sigh of relief. Sitting in the jump seat on an instrument approach and watching the altimeter going down and nothing in sight until the high intensity approach lights brightened up the fog prior to seeing a runway. Trusting the instruments and hoping they where accurate.\n\nDead reckoning is a dubious term with a double meaning. One is good and one is bad. Carol has done an outstanding job of bringing the worst nightmare of a pilot into a words that puts you into the left seat and your \"driving\". The reader can almost feel the horror of a crash and its aftermath. The healing process and grief weighs heavy on your shoulders as you read on. A break in the clouds hanging over Eric's head allows a ray of light break through at the end. It was a long, hard road!",
        "stars": "5.0"
      },
      {
        "userName": "Headly",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "In this true story you will become acquainted with the four survivors of this small commuters airline. You will read of the horror of survival in snow covered woods to a reunion some 10 years later.\n\nThe story dives deep into the lives , both before and after the crash, and follows them through the tough times and slow healing and through relationships both lost and found. Of you've ever wanted to be a bush pilot, or know someone who does...then this is a must read.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B009CJK4GA\nPublisher ‏ : ‎ Grand Central Publishing (May 21, 2013)\nPublication date ‏ : ‎ May 21, 2013\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 18082 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 338 pages"
  },
  {
    "title": "Rich Boy - A Dark Hockey Romance",
    "cover": "https://m.media-amazon.com/images/I/51YgS5slJ5L.jpg",
    "author": "Ruby Wolff",
    "ratingCount": "303 ratings",
    "ratingStarts": "4.1 out of 5 stars",
    "synopsis": "This is a standalone, new adult, high school hockey romance novel with morally gray characters.\n\nBLAKE\nI warned her, and she didn't listen, now I’m going to ruin her….\nI have everything, the money, the girls, the reputation, but it didn’t keep me out of juvie...because of August Miles.\nNow she will learn to keep her mouth shut, and listen to orders.\n\nAUGUST\nHe warned me to keep my mouth shut.\nI did.\nBut it didn't do me any favors.\nHe still came for me, made me his little toy, to have fun whenever he wants.\nThings to know\nHockey Romance\nHighschool\nObsessed/Possessive Hero\nVirgin H\nStandalone\nDual POV\nJealous Hero\nRevenge Romance\nDark Themes",
    "numberOfPages": "402",
    "reviews": [
      {
        "userName": "Alexciz",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Omg that was literally the main thing running through my mind almost the entire book. That and the grammatical errors were the ONLY things not making this a 5 star read. This was my 1st book by Ruby Wolff and she did not disappoint. I DID spend too much time trying to visualize our h. Yes, she was tiny, big bœbs and had a long neck…how tiny? 5ft? Green eyes, blue, grey?? Long hair, dark? Light? Skin tone? Nothing! Blake had a few more descriptors: copper eyes, brown hair, and tall. Other than that? Zilch! A lot of us readers create the story in our heads, movie style, so that very pertinent missing information turned me into a whiny 3 year old trying to figure it out, obviously! 🤣\nThe story line was DARK and I loved every NONCON minute of it! No shame here! It was hot and spïcy and full of forgiveness, growth, love and family in the end. Our characters work hard to bring it around and create a connection so deep that it will stand the rest of time. Our H so stinkin’ possessive he made plans to be worn around Augusts’ neck in the form of his ashes in a piece of jewelry! 😂🤣 Speaking of jewelry…I never really got into the whole BDSM scene personally (love it in the books) but the way chains are discussed throughout this book I ligit went and looked them up so I could visualize them properly and now totally see the appeal. Yummy…\nThe drama factor was chefs 💋 so good! Trying to figure out who dun it, who was involved with what, how the real villains were going to pay, had me on the edge of my seat!! I could not put this down. Thanks again to booktok for leading me to this novel!! What DID I do before booktok anyway? 🤔\nAll in all a hot AF story by a new to me author who only failed with grammar and a bit of jumping around as well as character descriptions. Other than those little issues? This book was a 5 star read, easily!",
        "stars": "4.0"
      },
      {
        "userName": "Kristi Thomas",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I’m actually surprised by how much I enjoyed this book our main character August was at first very timid and scared of our hero Blake, but I was happy to see the further we got in the book the more of a backbone she grew I also greatly enjoyed the graveling Blake had to do, and his grand gesture at the end was very sweet overall a great book looking forward to book to four stars.⭐️⭐️⭐️⭐️",
        "stars": "4.0"
      },
      {
        "userName": "Ms Cat",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A dark hockey, high school bully romance where a morally gray boy seeks revenge at Hillcrest Elite High School.\n\nAugust Miles, blamed for sending Blake, the high school hockey 🏒 golden boy, to juvie.\n\nDefinitely a non-consensual 📚 until it shifts to consensual. Lots of 🔥\n\nBut, it is so much more than brutality. It's a raw, emptional read as the author sheds light on their hidden secrets and deceits. Their darkness that causes anxiety and nightmares. Consoling each other as their walls are shred.\n\nSage advice:\n“Marry someone who you love more and more every day. You wake up and go to sleep with a smile, knowing you have the best person next to you.”\n\nThis line though, my ❤️\n“It took me nine months to make your heart, don’t let someone break it in a day. People will come and go in your life, but your mother will always love you.”",
        "stars": "5.0"
      },
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Blake is all kinds of messed up. He believes he was tortured in a five month stint in juvie because August lied to the cops and said he assaulted a girl. Upon release he's vowed to make August his pet. August is quiet and smart. She's not a partier and she's not a liar. She told Blake she didn't rat him out but she can't make him believe her. What's worse is she's starting to like being his pet.\nThis book is grey on the dark scale. It was high heat with a possessive touch her and you die mmc and a sweet virgin fmc.",
        "stars": "5.0"
      },
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "1st time reader of this author and I can't wait for more. The end bargaining chip was the only let down of the book. Hockey had very little to do with this story. I loved the dark twisted love. From 1-5, with 5 being the best\nFeel like characters loved eachother =4\nDarkness = 4.5\nTwisted=4\nUnable to put down=5\nAlpha-hole =4\nBully =4.5\nIf you like Sam Marino, JL Beck, and Loraine Alken then you will like this",
        "stars": "4.0"
      },
      {
        "userName": "john robert weaver",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I like when shy girls take center stage for alpha males. Some of the grammar threw me off with missing or misspelled words, but I liked it overall.",
        "stars": "4.0"
      },
      {
        "userName": "ReeseCup",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "The wording was pretty confusing in some spots. A few parts I just didn’t think it made sense. However, the more I read, the better the story got. Not something I will read again, but it was good enough to recommend to read at least once.",
        "stars": "4.0"
      },
      {
        "userName": "Jennifer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I really liked this book. It shows how sometimes you can’t trust anyone. Even one’s close to you. Even if it was a bit messed up the way it went about. Would read again and again.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0C53WJL4C\nPublication date ‏ : ‎ July 6, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 3766 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 402 pages"
  },
  {
    "title": "Filthy Puck: A High School Hockey Bully Romance (Red Creek Ravens Book 1)",
    "cover": "https://m.media-amazon.com/images/I/513Ednwn-XL.jpg",
    "author": "L. Ann",
    "ratingCount": "67 ratings",
    "ratingStarts": "4.7 out of 5 stars",
    "synopsis": "LIFE WAS GOOD UNTIL SHE SHOWED UP AND TOOK WHAT WAS MINE\n\nBailey Linnett\nThief, Liar, Stunning\nShe thought this was a game\nTaking things that didn't belong to her\nMaking me feel things I shouldn't—not for someone like her.\n\nRush Carter\nConfused, Angry, Lost\nI never meant to hurt him\nI only wanted to ease his pain\nHe sees my presence as a betrayal—an act of war.\n\nRed Creek Raven’s hockey captain has painted me as his enemy, and no matter what I do, he’s determined to make me bleed.\n\nThere's a fine line between pleasure and pain ... and it seems Rush Carter is happy to cross it.\n\nPlease check the TW at the start of the book.\n\nFilthy Puck and Broken Puck follow Rush and Bailey's story, and is a complete duet.",
    "numberOfPages": "543",
    "reviews": [
      {
        "userName": "Stacie Patton",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "CBA angst and darkness is back, and I'm here for it!\n\nThe Churchill Bradley Academy dark romance books( the Dare series) by these same authors are some of my favorite dark romances of ALL TIME! If you haven't read them you are missing something very special, and that series is an amazing intro that sets up this new saga in the same universe perfectly.\n\nThis book is just as good, but with delicious hockey players, and I was captivated and taken away from the first page.\n\nRush and Bailey are just as compelling,flawed and broken as Eli and Bella, and so well written, and their story took me on such a ride. It's sexy, hot, angry and uncompromising dark, and I can't recommend it enough!",
        "stars": "5.0"
      },
      {
        "userName": "Bridget",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "These two ladies did it again. I was hooked immediately from the first few chapters. I didn't know if I wanted to hug Rush or strangle him. I wanted to shake some sense into Riley to just tell him who she was. That CBA elite (eeek) I hope he's like his name sake. That cliffy killed me, I so glad I don't have to wait for the second book, I'm about to dive in now.",
        "stars": "5.0"
      },
      {
        "userName": "poepoe",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Beware this story will suck you in and keep you in a chock hold until the last word and leave you wanting more there is love between these two people but so lost their way with everything that happens between them the road rocky spicy haunting and I just want to give Rush our Mmc a big hug check your trigger warning it does end on a cliffhanger but the next installment is released the next day",
        "stars": "5.0"
      },
      {
        "userName": "Meloz",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "OMG! I loved it! I hated it! I smiled. I wanted to smash something! Oh, how frustrating! How beautiful.....\nWell done L.Ann and Claire Marta...\nI'm hooked.",
        "stars": "5.0"
      },
      {
        "userName": "Shani K.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I took a timeout from sports romances in general for a little bit, needing a break and diving into something else. That changed when these two authors announced they were releasing a hockey romance. I perked up really fast! Oh? Not just a hockey romance but a dark, high school bully romance too?! Sign me up!\n\nRush - I loved how strong of a character he is. He didn’t “need” supporting characters in order to make him stand out. He has this depth to him that shows. Whether it’s when he’s the sweetheart or the bully, you can see or feel his emotions on the page. This guy goes through so much in a short period of time. You can’t help but get involved in everything that’s going on. You’ll cheer him on, yell at him, and want to hug him all at different moments in the book. He’s a complex character that will have you loving him in the end.\n\nBailey - I loved that she too has a depth to her that makes her engaging. She’s not the shy, wallflower girl you might expect. Instead, she has fire, strength, and determination. She too has to deal with a series of ups and downs that make you dizzy as you go through them with her. When you think she’s this sweet girl, BAM…she surprises you with how she can be just as angst filled. I cheered her on a lot in this book, felt her emotions, and truly wanted to fight alongside her at times. She’ll surprise you in all the best ways.\n\nTogether, their journey is pretty angst-filled. I found myself second-guessing how I felt about certain characters. Were they really, truly this way or that way, or was I imagining it? The twists and turns had me talking back to the book as if they could hear me. They amped up my anxiety a few notches that’s for sure. I’m not even mad about it!\n\nOne final note, this was the first hockey romance I’ve read in years that truly had a good amount of actual hockey in it. This is what a hockey romance SHOULD be. It wasn’t just thrown in there like a fight on the ice to make it hockey. No, they wrote in scenes that meshed well with the story itself. It was well written, well thought out, and researched to make sure they were doing the sport justice. For me, it’s comparable to one of the most popular hockey series out there. Kudos to the authors for taking the genre/trope seriously and making it what it should be. I can’t tell you how freaking awesome that is. Sadly, and too often it’s put in there as an afterthought.\n\nBe prepared to be taken on a roller coaster ride with plenty of ups and downs, twists and turns! Don’t forget to grab a tissue for some unexpected tears, a snack, a comfortable spot to sit in, and a blanket so you can binge.\n\nHands down, this is one of my top favorites of the year so far. I can’t wait for more! GIMME GIMME GIMME!",
        "stars": "5.0"
      },
      {
        "userName": "Natasha",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If there is one thing that L. Ann and Claire Marta always manages to excel at, it’s creating one hell of a rollercoaster of a story!\n\nFilthy Puck and Broken Puck (book 2!) take us on a wildly tumultuous ride of heartache, hate, anger, pain, love, and “spice” with our MMC and FMC, Rush & Bailey. From childhood pen pals to enemies and then lovers, with both of our main characters experiencing so much drama and turmoil in their lives, you won’t be able to stop reading!\n\nAnd another thing that our authors always achieve in their storytelling; you FEEL all the things! They have such an incredible way of really making you feel like you’re a part of the story.",
        "stars": "4.0"
      },
      {
        "userName": "Michelle L. Arsenault",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "High school bully hockey romance written by two amazing authors! Rush Carter, good guy turned bad. Bailey Linnett the object of Rush’s torment. Rush blames everything bad that is happening in his life on Bailey and torments her. Bailey comes to realize that she has “known” Rush for most of her life and tries to rationalize this Rush she knows now with the boy she grew up writing! The way this book ended on a cliff hanger just made me eager to read the second book!",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0BY9N54XD\nPublisher ‏ : ‎ Raven Ink Publishing (August 14, 2023)\nPublication date ‏ : ‎ August 14, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 3612 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 543 pages\nPage numbers source ISBN ‏ : ‎ B0CDNC6ZJS"
  },
  {
    "title": "The Last Viking: The Life of Roald Amundsen, Conqueror of the South Pole",
    "cover": "https://m.media-amazon.com/images/I/51SxNGcCOdL.jpg",
    "author": "Stephen Bown",
    "ratingCount": "800 ratings",
    "ratingStarts": "4.5 out of 5 stars",
    "synopsis": "This “fascinating biography” of the Norwegian explorer who beat Robert Scott to the South Pole is “intelligent and often thrilling” (London Sunday Times).\n\nThe most feted explorer of his generation, Roald Amundsen counted the discovery of the Northwest Passage, in 1905, as well as the North Pole amongst his greatest achievements. His revolutionary approach to technology transcends polar and nautical significance. However, until now, his story has rarely featured as more than a footnote to Scott’s tragic failure.\n\nReviled for defeating Scott but worshipped by his men, Amundsen was pursued by women and creditors throughout his life before disappearing on a mission to rescue an Italian explorer attempting to claim the North Pole for Mussolini. The Last Viking is the life of a visionary and a showman, who brought the era of Shackleton to an end, put the newly independent Norway on the map, and was the twentieth century’s brightest trailblazing explorer.",
    "numberOfPages": "385",
    "reviews": [
      {
        "userName": "Miss Karenina",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Generally, in my day to day life, I feel that I was born too soon... I know that I would make an excellent planetary colonist. But I am also a diligent student of the lives and accomplishments of ground - breaking mountaineers and arctic explorers.\n\nThis excellent work brings the details of Amundsen's \"firsts\" to light. He was, without doubt, one of, if not THE, greatest explorers on the planet. Ever. Things that you'd think would be elementary: proper planning, using skis on snow/ice at the poles, learning from arctic inhabitants... he basically pioneered.\n\nDuring my read, I found myself wondering... if Cook and Peary's claims on the North Pole have been discredited, then who actually DID get there first? Gee. Guess who!\n\nAlthough details about his personal life rounded out his character, to me these are secondary points that did nothing to sway my admiration for the man. He tended to keep his personal life separate from his professional life, and (especially in today's world where people tend to think you want to know all the minutiae of their business) I like that. His personal life was generally kept that way, which to me is an admirable trait.\n\nThe language barrier has been instrumental in keeping Amundsen's accomplishments from being more widely known (as explained in the book), so I for one am very glad to see his story told in English. I was late finding it (published in 2012)... don't wait any longer! Definitely recommended.",
        "stars": "5.0"
      },
      {
        "userName": "Ron DiGiovanni",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Notice I use the title \"most likely.\" This is only for the fact that I dropped this pile of rubbish after reading about a third of it.\n\nHuntford wasn't bad enough with his relentless comparison of apples and oranges (Scott vs. Amundsen). We now have a fresh new effort in whitewashing the bizarre character of the last barbarian.\n\nRoald Amundsen was unquestionably the greatest of the polar athletes. Unfortunately, he also had the type of self-destruct personality that makes this brand of rehabilitative writing necessary.\n\nWhen I got about 25% through this book I started getting the feeling that this was little more than a cleanup job for old Roald. At that moment I decided that I would read ahead to the one true test of this author's intent - how he handles the case of Amundsen and Nobile.\n\nOH, MY GOD, what a pack of lies!\n\nWhen I read the chapter title - \"The Dirigible And The Fascist,\" at first I thought it was some sort of joke or sarcastic theme. But then, as I read on, I was not just disappointed that I had wasted 12 bucks on this crap, I was totally appalled.\n\nTo accuse Umberto Nobile of being a Fascist has less merit than calling Mother Theresa a Nazi. If you read anything about the life of Nobile, by any author, you will quickly come to realize that Mussolini and his Blackshirts made Nobile's life pure hell from day one of their tyranny. This is why the Americans embraced him lovingly. This is why the Russians went through such great expense and risk (both personal and political) to rescue him and his crew with their best icebreaker. The Russians admired little Umberto because they knew he was no Fascist.\n\nMost Nobile historians will either admit or at least intimate that the Fascists would have preferred to have Nobile die on the ice. And this wasn't just after the crash of the Italia. High ranking Blackshirts like Italo Balbo and Umberto's Fascist-favored competitors in the Italian aviation industry were praying that he would simply disappear up north in the Norge.\n\nWhat this author needs to realize is that you don't have to scrub a man's back to reveal new and interesting aspects of his life. I love reading new and interesting facts about Adolph Hitler. The story of this demon has always intrigued me. But if you twist the truth so as to favor your subject, you'll only discredit yourself in the act.\n\nOf course, I'm making no comparisons here, but if you really want to understand Amundsen, READ HIS BOOKS. In his 1912, The South Pole (free with Kindle) he reveals his inner self with almost as much detail as our glorious Fuhrer did in Mein Kampf. He explains how he and his men killed a really cool Emperor Penguin just for s***s and giggles, clubbed five little puppies to death with the back of an axe, and drooled as they pondered the dog meat waiting for them at the end of a long trek. By the way, just so you know, according to Roald, Man's best friend is as tasty and delicious as any good cut of beef - and THAT was the actual quote.\n\nThe shame of it all is that this book was obviously well researched. The details of the Belgica voyage are one example. I have always harbored the suspicion that Amundsen might have been gay, in the closet, resentful of it, and just like Shakelton's brother, used female relations as a cover. Evidently, this was not the case, and although this author was willing to deal with this mystery of his life, I see no point in reading further for these insights, simply because I can no longer trust what I read.\n\nBut now let's go all the way back to the title, to set the record straight. Twice in my limited reading, I noticed that the author uses the phrase \"The Last Viking\" in suggesting that this was some sort of title that Amundsen earned for his stoic courage and savage determination to succeed. Rot! HIS MOTHER BESTOWED THIS TITLE UPON HIM! She used to say, \"Rrrrroald! You are the last of the Vikings.\" And this was most likely when he was behaving like the ingrate that he was. If this author mentions this somewhere where I didn't read, well, that's as much credit as I can give him.\n\nLet's allow this hyperbolic garbage to sink down into the ice where it belongs.\n\nRon DiGiovanni\nEaston, PA",
        "stars": "1.0"
      },
      {
        "userName": "Valerie Barber",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Very thorough",
        "stars": "4.0"
      },
      {
        "userName": "Miss Weezie",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I'm thrilled to have found this book as I'm doing research on Amundsen for a lecture I'll be presenting to about 100 people aboard two eco-tourism trips this winter to the Falkland Islands, South Georgia and the Antarctic Peninsula.\nI've been reading several different books but this is the one I've chosen to take with me for reference.\nIt's my 9th year as a kayak guide and lecturer in Antarctica and I've found in general our passengers get a bit overwhelmed with stories and lectures about Shackleton and Scott so I believe this will satisfy and/or open new territory and understanding.\nIt piqued my interest as well, both my parents were Norwegian, born about the time of Amundsen's passing. I believe not only was he a great leader but possessed keen insight into people's characters, created good working teams and, through a number of positive factors, achieved great things.\nOne has to admire his tireless and impeccable preparations, he never lost a man on any of his expeditions due to careful planning and execution of gear (furs), food (fresh meat) and methods of travel (skis and dog sledges).\nI choose not to compare his South Pole exploration with Scott's too much, I'd found myself growing weary of others' scathing critiques.\nI've chosen instead to stick only to Amundsen's story, it's so compelling and stands very well on its own.\nI've found this book enlightening and refreshing in that the author has stuck with his main character and not fallen into the comparison trap.\nAmundsen's story is detailed with enough of his own research we know he'd done his homework.\nTo do anything less might spell disaster, which others had suffered.\nAs you've said there had to be more behind the man than his stoic public persona, the image he fed to the world.\nThe private image can generally be more interesting than the public one, as this book shows.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B009JXIY9I\nPublisher ‏ : ‎ Aurum (October 20, 2012)\nPublication date ‏ : ‎ October 20, 2012\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 7657 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 385 pages"
  },
  {
    "title": "Tent for Seven: A Camping Adventure Gone South Out West",
    "cover": "https://m.media-amazon.com/images/I/41HlufGnTUL.jpg",
    "author": "Marty Ohlhaut",
    "ratingCount": "20 ratings",
    "ratingStarts": "4.9 out of 5 stars",
    "synopsis": "\"A factual account that reads like a breathtaking thriller. . . . Highly recommend.\"—Readers' Favorite (5 Stars)\n\nMarty Ohlhaut loved the great outdoors, and he loved his family, but this time, the combination proved disastrous.\n\nCooped up inside due to long work hours, Marty was excited about taking off with his wife and five children for the beautiful Canadian Rockies. Aware that this could be their last camping trip together, he wanted to make it extra memorable.\n\nLittle did he know how memorable it would be. From a massive heat wave and tainted water to encounters with aggressive red ants and formidable bears, they experienced one problem after another. Then tragedy struck, forcing Marty to face the terrifying possibility of losing a loved one. With the help of mysterious strangers in one of the world's most awe-inspiring locations, he fought to keep his family alive and his sanity intact.\n\nNow, three decades later, he joins forces with his daughter Grace Ly to recount the gripping tale of that ill-fated vacation. Written with candor and wit reminiscent of Bill Bryson, Tent for Seven vividly captures both the grandeur and the dangers of the wilderness as Marty learns just how much his wife and children mean to him—and how fragile life can be.",
    "numberOfPages": "276",
    "reviews": [
      {
        "userName": "Sheryl T Smith",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I am not a fast reader but read it in record time.The chapters are packed with this Family's adventures that are often too unreal to believe at times. The descriptions of the places they went, the close calls, & life threatening events made you feel like you were there in person & pretty scary at times .\nThe humorous accounts had me laughing out loud and other times I was like What Were You thinking ??\nI highly recommend A Tent For Seven , you will not be disappointed .",
        "stars": "5.0"
      },
      {
        "userName": "John C.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Tent for Seven is a folksy true account of a family vacation filled with adventure, drama, and a touch of humor. The main story and vignettes make for a captivating read. I had trouble leaving it, and finished the book within a day of receiving it. I highly recommend it!",
        "stars": "5.0"
      },
      {
        "userName": "James A. Kelly",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "A fun, though at times nerve racking romp through the woods. The book was hard to put down, as I needed to know what was next in store for the troupe of seven. I highly recommend this easy read.",
        "stars": "4.0"
      },
      {
        "userName": "Ginny H.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "“A Tent for Seven” is a wonderful entertainingly written true story of Marty and his family with an abundance of adventure and love. Many scenes are absolutely hilarious, I laughed out loud often. With its quick pace it is almost impossible to put down.\n\nThe style holds your interest as the author juxtaposes this family trip with adventures of his own travels 20 years earlier as a single college graduate. He reflects on the intense strain but also the immense joy which comes from sharing his love of camping with his family. I found it to be insightful and moving.\n\n“Tent” does what we hope all good books will do: transport us from our day to day lives to fun and excitement without leaving our easy chairs. But it goes further. It invites the readers to reflect on their own adventures and their handling of adversity while recognizing the importance of family and friends in their own lives.\n\nAnd it specially reminds us to acknowledge the kindness of strangers. Perhaps if we reflect carefully, we too might realize we’ve crossed paths with an “angel” or two in our own lives.",
        "stars": "5.0"
      },
      {
        "userName": "L. Gold",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Immerse yourself in a heartwarming camping journey that defies convention. Through trials and triumphs, the Ohlhaut family embarks on an unforgettable adventure, showcasing their resilience and deep appreciation for the natural world. The author's vivid descriptions and well-timed humor infuse the prose with an infectious sense of adventure, allowing readers to feel the thrill or trepidation of each moment. I was moved on several occasions by the compassion and kindness shown by strangers who generously extend a helping hand when needed most. Ultimately, this enchanting tale serves as a poignant reminder of the enduring power of family bonds, forged through shared experiences, that resonate long after the final page. Enjoy.",
        "stars": "5.0"
      },
      {
        "userName": "Amanda Schreier",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This was a really fun read! “Tent for Seven” is both really funny (I laughed out loud several times) and heartwarming. If you like adventure books, interesting travel escapades, and humorous, smart storytelling, you’ll love this book! What makes it extra special, beyond just a crazy adventure, is the heartwarming journey the main character, Marty, goes on within himself. I don’t want to give anything away, but this book has that spark of soul that leaves you thinking about it long after. Really enjoyed it!",
        "stars": "5.0"
      },
      {
        "userName": "Silky 42",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "It’s hard to put this book down. You’ll become attached to the family, and cry and cheer with their experiences. Their willingness to remain hopeful and “hang in there” no matter what happens, provides a great lesson for everyone.",
        "stars": "5.0"
      },
      {
        "userName": "Amazon customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Read in one sitting. This book is a fun, quick read. The writing is hilarious and entertaining. I loved the accompanying pictures and the pie reciepe! I've never had saskatoon pie, but after reading the pie chapter I feel the need to go find some. I feel bad for this family and all they went through, but, at the end of the day, it made for a great story!",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0C2PMP9S5\nPublisher ‏ : ‎ Sandra Jonas Publishing House (August 15, 2023)\nPublication date ‏ : ‎ August 15, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 5759 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 276 pages"
  },
  {
    "title": "First Flight, Final Fall",
    "cover": "https://m.media-amazon.com/images/I/51FVZq7VJ4S.jpg",
    "author": "C.W. Farnsworth",
    "ratingCount": "3,825 ratings",
    "ratingStarts": "4.4 out of 5 stars",
    "synopsis": "A new adult romance with sass, steam, and soccer.\n\n\n\nWhat do you do when you encounter the famous footballer voted “Sexiest Athlete Alive” three years running on a soccer field in Germany?\n\n\nIf you’re Saylor Scott, you challenge him to a shoot-out. And win.\n\n\nSaylor’s goals have always involved the literal kind constructed from posts and netting. Her single-minded focus has cost her a lot, but it’s also earned her recognition as the top female college player in the US. She doesn’t get attached, she never gets distracted, and she could care less what anyone thinks of her.\n\n\nMeeting Adler Beck, the notorious player celebrated worldwide and coveted by women everywhere, challenges her indifference. But Saylor perfected the art of appearing unbothered a long time ago, and her scoring percentage is even higher off the pitch. Might as well add a gorgeous German to the tally.\n\n\nBecause only a fool would fall for a superstar known for breaking hearts alongside records.\n\n\nAnd no one has ever accused Saylor Scott of being a fool.",
    "numberOfPages": "330",
    "reviews": [
      {
        "userName": "Bookworm Angel 📚😇",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This was the first book I've ever read by C.W. Farnsworth and I loved it!!! I've read many books with a female athlete and I wish there were more of them - it's just usually the hero that gets all the notoriety. Women can be strong and capable, but still be feminine and girly. I loved Saylor immediately! She's such a fiercely unapologetic character and I was so here for it. Her immediate connection and attraction to Beck was so palpable, it nearly jumped off the page! Wonderful story!!",
        "stars": "5.0"
      },
      {
        "userName": "Allie Brenner",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I will say, it felt like it took a minute to get to the good parts, but the last half of the book was really great! Loved the ending!!",
        "stars": "4.0"
      },
      {
        "userName": "Zoe Pearce",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If you’re looking for a cute sports romance this is it. The character development was so well done, I loved the emphasis on a female sports icon and not wanting to waiver from her goals. I wish there was another epilogue more focused on our FMC.",
        "stars": "4.0"
      },
      {
        "userName": "Lauren F.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Saylor and Beck are perfect in every imperfect way. I loved every word of this book. Officially one of my favorites. *reads the entire backlist of C.W. Farnsworth*",
        "stars": "5.0"
      },
      {
        "userName": "Samantha McKee",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This book was so good.. so so good! I absolutely loved Saylors confidence in herself and her abilities as a player. I also absolutely loved Adler and how he fell her for Saylor. I would love more soccer romance in the future! ❤️❤️",
        "stars": "5.0"
      },
      {
        "userName": "ceci",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Amazing the best book ever, spoke to me as an athlete in bizzare ways. Love alder and saylor is awesome",
        "stars": "5.0"
      },
      {
        "userName": "Caroline Keller",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I think I have reread this book a total of seven times? All in on one of my favorite stories. Unapologetically, talented players in a fun dynamic, with swoon worthy romance",
        "stars": "5.0"
      },
      {
        "userName": "Jennifer Alexander",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I loved how she finally let herself feel and I just loved how Adler pulled and pushed her to become a better part of herself.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0952X69NY\nPublisher ‏ : ‎ C.W. Farnsworth LLC (June 24, 2021)\nPublication date ‏ : ‎ June 24, 2021\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 2185 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 330 pages\nPage numbers source ISBN ‏ : ‎ B096TRWT23"
  },
  {
    "title": "Long Shot: Lincoln U- Ice Hockey (Taking The Shot Book 1)",
    "cover": "https://m.media-amazon.com/images/I/519jFoYs1dL.jpg",
    "author": "MJ Fields",
    "ratingCount": "505 ratings",
    "ratingStarts": "4.2 out of 5 stars",
    "synopsis": "Ellie\n\nBefore my junior year at Lincoln University, I promised myself three things. Just three.\n\nActually dig into the whole sorority girl bit.\nStay away from athletes.\nSeriously, stay away from athletes.\n\nWhen Professor Taylor posted our chem midterm partners and I got stuck with the captain of Lincoln’s Ice Hockey team, I was sure I’d be able to abide by rules 2 and 3. After all, I was immune to Leo’s whole ‘hottest guy on campus’ thing. I grew up with him— my brother’s best friend.\n\nThat I’ve been obsessed with since I was eight.\n\nF' me.\n\nLeo\n\nSenior year. Captain of the hockey team, already engaged to the NHL with the perfect union months away, my whole life mapped out ahead of me. All my dreams have come true.\n\nExcept for the one with Eleanor Rhodes.\n\nThat one’s reoccurring, starring her in nothing but my number and that perfect little blush that shows up every time she looks at me.\n\nNo biggie. I’ve worked that one out. In the shower. Numerous times. Never had a reason to get any closer than her Instagram until Professor Taylor assigned us as chem partners.\n\nThe one girl on campus who shouldn’t be on my radar, yet she somehow seems to be the only one.",
    "numberOfPages": "318",
    "reviews": [
      {
        "userName": "Jennifer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "What a start to a new series! Leo and Ellie have known each other from childhood, now they attend the same college. Ellie has always had a crush on Leo and Leo could never take his eyes off Ellie. Leo is a senior plays NCAA hockey going to the pros when he graduates. Ellie is a junior, former NCAA soccer player, best in her state until an “injury”, and a sorority sister. When they are assigned as biochem partners for a project they start hanging out. Leo is “married” to hockey and doesn’t want anything serious because he doesn’t have time for relationships. Until Ellie happened. Ellie is a bit more hard headed to admit how much she likes Leo. Once he gets her to open up we see a softer side of Ellie. This book will make you laugh and like every other book of MJ’s have all the feels.",
        "stars": "5.0"
      },
      {
        "userName": "Shelia Hollin",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Great start to the series! Great characters and story line! Like the fact the guy falls first!! Can’t wait for the next book!",
        "stars": "5.0"
      },
      {
        "userName": "Tim McConnell",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "this book had such an abrupt start, transitions, and ending that I felt like I was missing chapters. they just started out knowing and liking each other but really didn’t showcase a history of hanging out/ a pining stage. then it also brought up how her mom was financially struggling and needed a second job yet she didn’t have a job, was in an expensive sorority, and was constantly buying other peoples drinks and dinner and you’re just like where did she get this money from. all of their chemistry came from just feeling comfortable with the other person and they didn’t really have anything drawing them together and then for all of their important conversations it would just be solved by him telling her what he wanted and even if it was different for her she just agreed and went along with it without any real discussion about logistics. it just felt very unrealistic even for a romance book and left me wanting more",
        "stars": "2.0"
      },
      {
        "userName": "Linda J. Olinger",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Sometimes it takes a while to find your soulmate, but other times they are right in front of you most of your life! But often a guy won’t make the first move because of friendship! With that special girl’s brother, one of his best friends! Until one day he does!\nBeautifully written with all the fun of college life, but unapologetically showing the bad things than can happen too!\nI loved it and am anxiously awaiting the next book!\nA⭐️⭐️⭐️⭐️⭐️ Book for M J Fields!",
        "stars": "5.0"
      },
      {
        "userName": "Becca Loves Books",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "😭😭😭😭😭 I don’t wanna wait I’m currently throwing a 3yr old temper tantrum because I need more ….. kicking yelling the whole nine yards. Why must you do this Ms Fields ?? You wow me with your beautiful words and then bam I gotta wait… so so not cool BUT OMG I FKN LOVE this book so much…. Leo and Ellie are chefs kiss … so so sweet and spicy …. I love how Leo was so protective and wanted to help Ellie with her issues .",
        "stars": "5.0"
      },
      {
        "userName": "ky",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I think I have all the books, but still opt for more. I love these two characters, the honesty, the love ❤️. It will be interesting to find out how the story line helps with the findings of Ellie’s illness. Of course hoping for the best. Would kind of love for Ollie to find his happy ending with her roommate, but will just have to wait and see.😉🥰👏🏻👏🏻👏🏻👏🏻",
        "stars": "5.0"
      },
      {
        "userName": "Debb",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "What a fantastic read!! Loved to story between Elle and Leo! I love stories where couple finds each other and build from there. I can't wait to see what the next book brings and to see the spimln offs with the other characters.\nMJ makes them so loveable!",
        "stars": "5.0"
      },
      {
        "userName": "Alysha",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Umm… excuse me? Where’s the end of the book? It just ends. I’m so confused.\n\nAlso the writing just wasn’t it. The banter back and forth between different people is just one line, then another, then another, and so on. The story doesn’t flow well. Lots of fade to black parts (not just intimate times but parts of the story) and it just kind of jumps around.\n\nWhile I liked the brothers best friend and old crush story, it wasn’t done well. The book is just very choppy.",
        "stars": "2.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0C711L4GY\nPublisher ‏ : ‎ Blue Valley Publishing LLC (June 2, 2023)\nPublication date ‏ : ‎ June 2, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 1851 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 318 pages"
  },
  {
    "title": "My Secret Baby for the Wide Receiver: An Enemies to Lovers Sports Romance",
    "cover": "https://m.media-amazon.com/images/I/41Ec0XVdq+L.jpg",
    "author": "Olivia Pearl",
    "ratingCount": "114 ratings",
    "ratingStarts": "4.1 out of 5 stars",
    "synopsis": "I got pregnant from a one-night stand.\nI didn't know he was an NFL star.\n\nHe had my attention the moment he walked in the bar,\nDrawing the eyes of every woman in the room.\n\nWith a face chiseled by the divine,\nWe locked eyes and knew exactly what we wanted.\n\nOur chemistry was dangerous,\nHis touch intoxicating.\n\nBy the end of the night,\nHe dominated my mind, body and soul.\n\nWe agreed, no strings attached.\n\nTwo months later, I'm his new team doctor.\nI didn’t know he was the infamous Matt Donovan.\n\nOur encounters are a potent mix of desire and disdain.\nBut beneath the animosity is an undeniable attraction.\n\nThe more we bicker,\nThe quicker he breaks thru my panty's defenses.\n\nNeither of us sees this going to the end zone.\nBut that’s when things get complicated…\nAnd I may have just fumbled.\n\nThe nausea I’m feeling isn’t because I’m sick,\nIt’s because I’m pregnant and he’s the daddy.",
    "numberOfPages": "229",
    "reviews": [
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I’ve read several of Olivia Pearl’s books and I think this is one of her best. It was quick and enjoyable. At one point I wanted to reach into the book and punch Matt in the face. So I just closed it so I wouldn’t break my kindle 🤣",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Stories featuring former foster children seem to be in fashion lately. The circumstances in this story are so very unlikely that it is easy to suspend disbelief. Both Matt and Natasha are appealing characters. You are rooting for a happily ever after right from the beginning.",
        "stars": "3.0"
      },
      {
        "userName": "Bren I",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "What starts off as a steamy one night stand turns out to be a loveable romance and the characters will pull on those pesky heart strings. Natasha and Matt are a adorable couple. I really love these two characters.",
        "stars": "5.0"
      },
      {
        "userName": "Leslie",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I did enjoy this book but I really felt like I needed more context. It was as I read the outline and all of the juicy details were left out. Still a fan of Olivia Pearl!! This was cute quick read",
        "stars": "3.0"
      },
      {
        "userName": "Sara B.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "For me, this story falls short of my expectations from the blurb. The two main characters were difficult for me to connect with and were argumentative and nasty to each other for most of the book.\n\nI can suspend reality, but when someone completes medical school they go through a residency program.\n\nKU",
        "stars": "2.0"
      },
      {
        "userName": "Wendy Brunell",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Matt and Natasha meet one night at a bar and have a spicy encounter in his truck in the parking lot. Matt likes his one night stands because they don't expect anything from him later because they understand what it is - one night and that's it. Natasha is finishing medical school and wants to work in an ER but is having a hard time getting the job because she's so young. She takes a 2 week internship of sorts with the Seattle Seahawks. Imagine her surprise when she runs into Matt there because he's their wide receiver. He's shocked to see Natasha as well and angry because she must have known who he was when they hooked up and now she's harassing him. He's a single dad because of a \"gold digger\" and so he's wary of everyone now. Eventually, he accepts that she didn't play him.\nNatasha is offered a job as the assistant to the team doctor and she and Matt hook up a few times. He overhears her talking to a friend and saying that she is pregnant. Again, he is certain that she's just trying to trap him and get at him money. She doesn't want anything from him and tells him to bug off basically. When Matt stops to think and not be angry, he realizes that he really likes Natasha and wants to try and see if they can start a relationship. He has to work really hard to get her to agree, but eventually she does. There are a few more stumbles, but then they get their happily ever after.",
        "stars": "4.0"
      },
      {
        "userName": "Angel43",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This contemporary romance is page-turning with exceptional world-building and characters that are intriguing and realistic. Their journey is enthralling with a secret baby for the wide receiver, an explicit romance that is engulfed by steamy passion, lust, desire, and spice with all the feelings, sports romance, billionaire grumpy single dad, enemies to lovers, close proximity, age gap, drama, heartfelt emotions, an unexpected pregnancy, a one-night stand, adventure, and more. I recommend reading this book by an extraordinary author who knows how to captivate her reader's hearts and attention with my secret baby the wide receiver and explicit romance that is sure to have readers begging for more.\n\nI got pregnant from a one-night stand.\nI didn't know he was an NFL star.\n\nHe had my attention the moment he walked in the bar,\nDrawing the eyes of every woman in the room.\n\nWith a face chiseled by the divine,\nWe locked eyes and knew exactly what we wanted.\n\nOur chemistry was dangerous,\nHis touch was intoxicating.\n\nBy the end of the night,\nhe dominated my mind, body, and soul.\n\nWe agreed, no strings attached.\n\nTwo months later, I'm his new team doctor.\nI didn’t know he was the infamous Max Donovan.\n\nOur encounters are a potent mix of desire and disdain.\nBut beneath the animosity is an undeniable attraction\n\nThe more we bicker,\nThe quicker he breaks thru my panty's defenses.\n\nNeither of us sees this going to the end zone.\nBut that’s when things get complicated…\nAnd I may have just fumbled.\n\nThe nausea I’m feeling isn’t because I’m sick,\nIt’s because I’m pregnant and he’s the daddy.\n\nI received a free copy of this book and am voluntarily leaving a review.",
        "stars": "5.0"
      },
      {
        "userName": "Kay",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I stuck it out until the end, but I will never read a book by this author again.\nPoor writing, horrible grammar, ridiculous story",
        "stars": "1.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0CC8Q2KWX\nPublication date ‏ : ‎ July 29, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 3110 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 229 pages\nPage numbers source ISBN ‏ : ‎ B0CD16C4GZ"
  },
  {
    "title": "A Gorgeous Villain (St. Mary's Rebels Book 2)",
    "cover": "https://m.media-amazon.com/images/I/41Yos0TythS.jpg",
    "author": "Saffron A. Kent",
    "ratingCount": "1,765 ratings",
    "ratingStarts": "4.3 out of 5 stars",
    "synopsis": "*A standalone novel set in the world of St. Mary's\n**INCLUDES the prequel, The Wild Mustang & The Dancing Fairy\n\n\nTwo years ago, Reed Jackson betrayed Calliope Thorne and broke her heart. So she stole his most prized possession – a white mustang – and drove it into the lake for revenge.\n\nNow, Callie is stuck at a reform school while Reed is off at college, living his life without repercussions.\n\nUntil he comes back.\n\nWith him comes back all the feelings that Callie has been trying to bury: anger and heartbreak.\n\nBut most of all, desire.\n\nAt the sight of his beautiful but lying lips and his gunmetal gray eyes that still taunt and smolder when he looks at her.\n\nWhatever though. It’s not as if Callie is ever going to fall for her ex-boyfriend again. Or let him corner her in a bar one night and touch her, kiss her…\n\nNeither is she going to kiss him back. Or worse, sleep with him.\n\nBecause that would make her naïve and foolish.\n\nOh, and also pregnant.\n\nAnd there’s no way Callie is ever going to get pregnant at eighteen and with Reed’s baby, no less. The guy she hates.The guy who taught her all about heartbreak.\n\nWho might look like a gorgeous hero but really is the villain of her story.",
    "numberOfPages": "547",
    "reviews": [
      {
        "userName": "The Romantic Rush Blog",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I just love all things about Saffron Kent’s longing-filled, angsty, steamy, and messy coming of age stories- stories she usually speckles with tantalizing sizzle of the forbidden or taboo and then saturated with intense drama and all the complicated feels. But I was extra excited about this- not only because Callie was a character that appealed to me so intensely from MDA, but also because I wanted to see her delicious spin on a teen unexpected baby story. There’s so much going on here- second chances, family vendettas, the drama of first love, heartbreak and healing, a surprise baby, and my favorite reform school girl gang. A perfect symphony of the tumultuous first love emotions and heartfelt coming of age triumphs- I loved it!\n\nOur story begins in a beautifully SK way- a besotted girl pining away from the boy forbidden from here, in this story a boy her age but one that is her brother’s bitter enemy. Saffron teases us with sweet glimmers of happy connection and young love bliss, but that happiness quickly dissolves into the sharp pains of broken first love. The characters immediately engross and intoxicate you, and I found myself spiraling through the gambit of emotions just in the first part of their dramatic love story. I don’t think I’ve ever rooted for a SK coule as hard as I rooted for these two- and their love story was so gratifying because of it!\n\nLike most Saffron stories- this book is longer than average, which means the pace and flow of our narrative really builds our anticipation, heightens that romantic longing she’s so famous for, and creates a slower burn romance, though here because of the novella and the second chance component, we’re able to experience a much earlier glimpse of emotional bliss before everything crumbles- which only made my desperation for Callie and Reed every greater in the second part of their story. I had read the novella prior, which meant that the post-novella story for me began at about the 25% mark. I appreciated the distinct narrative voices of both characters- Reed more decisive, direct, more combustible. And Callie’s sings of youth and innocence- she has a flowery, poetic like besotted quality to her inner voice, even when it’s laced with hurt and anger. Her voice is repetitive though- she has a tendency to say/think the same thing multiple times, sometimes right in sequence, other times sprinkled throughout her chapters- and for the most part, I think this is a great creative choice that highlights the conflicted, slightly manic, emotions she has and her youth, though I can see how this would frazzle a more impatient reader, I found myself feeling this way a smidge towards the end- given this is a longer story and I was getting twitchy for my HEA.\n\nThe chemistry here, though, is **chef’s kiss**- so engrossing and delicious. LIke many Saffron books, we have heavy doses of youthful lust and desperation paired with a tender emotional longing and oodles of angst. And, the dynamic of a vulnerable, emotionally exposed and optimistic heroine with a broody, emotionally unavailable alpha is SK’s specialty. Reed, though, is a real delight in the ways he defies the typical SK man. Despite some egregious immature missteps, he’s a man who quickly course corrects. He ends up proving to be selfless, emotionally vulnerable, and surprisingly tender. Despite being forbidden, he’s not the pursued- he’s the pursuer. He longs for Callie as much as she longs for him- perhaps even more- he’s just much better at containing it than she is, because he’s made so many sacrifices to protect it. And he has a DIRTY MOUTH and a possessive, protective streak a mile wide. SK always gives me some delicious nasty talking men- but Reed may take the cake. Meow. And Callie owned my heart straight away- she’s gentle, emotionally open, and so loving. She’s soft, but she also grows into her strength- finding a way to stand up for herself in the sea of men trying to alpha her life, both Reed and her buffet of brothers. Saffron gives great attention to the complexity of both characters- developing them and maturing them in subtle but compelling ways, and the surprise baby element plays nicely into how these two figure out how to be adults while also overcoming their past pains.\n\nThe Villain doesn’t end up being the villain at all, and that’s what I loved the most. This story ends up being quite swoony and sweet, perhaps more so than any other SK story- and I gobbled up every morsel. And the teases of the story of what’s to come for both Poe and Wyn- YAAS GIMME. I’m obsessed with this series- truly SK at her finest!\n\n4.5 stars",
        "stars": "5.0"
      },
      {
        "userName": "sherrejon",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Oh SAK. How do you do this to me? How do you get me to immerse myself so throughly into this world that I feel every emotion, every heartbreak, every laugh, every tear, every breath, every flutter, every twist and turn, every chill? You’re a master at words. And I’m just a measly peasant consuming them.\n\nThis book includes the prequel, which I read last week and absolutely loved. After the prequel, we flash forward to two years later when Callie is at Saint Mary’s school, a reform school for girls that are considered “bad.” She was forced to go there after she sunk Reed’s car two years before. She would’ve gone to juvie, but they were able to strike a deal so that she only had to go to Saint Mary’s. Since she arrived at the school, she sneaks out every Thursday to the ballet studio she used to practice at, and every Friday, she sneaks out with her friends to a bar. When she was forced to go to Saint Mary’s, the ballet studio that she had been at basically kicked her out because other girls were afraid that she would influence them in a bad way, because of her “crime.” She had been dreaming of going to Juilliard since she was five years old, and the dream left when she sunk that car. So she continues living her life, in a limited capacity, because of the heartbreak that she suffered when Reed used the love she felt for him against her to beat her brother two years before.\n\nReed comes back, and it’s not what people expected. Two years before, when he was a senior, he was an amazing soccer player; being scouted and having a bright future in soccer is what many expected for him. However, that’s not what happened. He works for his dad, because that’s what his dad forced him to do in order for Reed to protect Callie. He comes back, and he notices that Callie is sneaking out, in the middle of the night, on the bus, to go practice ballet. He finds her again, even though she tries to stay away from him, even though she doesn’t want to melt for him anymore and she wants to hate him, he finds her and pursues her once again. But he hides behind his villainy mask. This gorgeous villain hides his true feelings in order to protect his fairy, his beautiful Fae. He tells her that she needs to continue pursuing her dream, and he’s going to help her again, like he did two years before. So she does; he helps her, and it’s almost as if time never passed and the connection from before is still there.\n\nTheir connection, the raw chemistry, is visceral, tattooed into their soul, undeniably magnetic, passionate, and all-consuming, and they can’t stay away from each other. So what happens? Yep, she gets pregnant (this is not a spoiler, but it does happen around the 50% mark in this book). Now, it’s Reed’s job to protect her and their baby, their beautiful baby that means the world to both of them. And although we don’t see more sexy times until about 80%, when we do… oh em gee 🔥🥵. They make up for not being more intimate in spades! The way he worships her body, her pregnant body that is the vessel giving life to their baby, was utterly sexy and emotive. Her body is sexy to him, and he lets her know with every caress, every kiss, every lick, every touch 🥰🔥🥵😅. She’s the drug that he needs to survive, and her belly just ignites him even more.\n\nThis book… oh this book is one long grovel… a way for Reed to make it up to Callie for breaking her heart… he puts his heart, soul, and dreams on the line in order to protect his fairy, to protect his baby, to protect their future, even if it kills him and forces him to put walls around his villainy heart. And Callie… Callie understands…she knows… gah these two were just ❤️🥺. Reed… the strength it took for you to sacrifice so much of yourself is admirable… and you did it all for your fairy… and your baby… because that’s how you show your love.\n\nThis book is angsty and emotional… but it’s so sweet… and the ending is so rewarding. My heart was put through the ringer, and I shed many tears, but their HEA was heartwarming and satisfying and simply amazing. I loved it!!!\n⚠️safety squad⚠️\n-no cheating\n-OW is mentioned in prequel- h is remembering seeing OW pleasuring H, but this was a memory; it wasn’t happening live\n-during separation, H NEVER strays- he remains FAITHFUL and can’t even look at other women\n-other girls/women want H, but he ONLY has eyes for h- no one else matters 🥰SWOON\n-be prepared to get emotional 🥺 I did 😢.",
        "stars": "5.0"
      },
      {
        "userName": "Bre Landers",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I loved Reed & Callie’s story.\n\nDid I want to punch Reed in the face? Yes!\nMultiple times? Again yes!\n\nAnd don’t even get me started on Callie, come on girl!\nBut through all the ups, downs & drama…Callie is just the perfect girl for Reed & just what he needed.\n\nSweet moments, hidden moments, precious moments all wrapped into this book.\nI loved the side characters just as much as the main story and moving into the next one as soon as I’m able!",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B08W4J97V3\nPublisher ‏ : ‎ Purple Prose Press LLC (June 3, 2021)\nPublication date ‏ : ‎ June 3, 2021\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 3447 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 547 pages\nPage numbers source ISBN ‏ : ‎ B09R34XKYQ"
  },
  {
    "title": "Broken Puck: A High School Hockey Bully Second Chance Romance (Red Creek Ravens Book 2)",
    "cover": "https://m.media-amazon.com/images/I/516PtcPUYtL.jpg",
    "author": "L. Ann",
    "ratingCount": "61 ratings",
    "ratingStarts": "4.7 out of 5 stars",
    "synopsis": "LIFE WAS A MESS BECAUSE I SCREWED UP AND BLAMED THE WRONG PERSON.\n\nBailey Linnett\nStrong, Defiant, Beautiful\nShe swallowed all my rage.\nStood silent as I piled the blame on her.\nBut this time I've gone too far, and she will never forgive me.\n\nRush Carter\nDrunk, Desperate, Broken\nHis anger destroyed us both\nEdging my pleasure with his pain\nI want to hate him, and yet I need to be the one to save him.\n\nThere’s a fine line between trust and betrayal, and no matter what I choose, someone is going to get hurt.\n\nRed Creek Raven’s hockey captain is determined to regain my trust, but there’s something dark on the horizon. Something that could destroy the fragile new bond forming between us for good.\n\nFilthy Puck and Broken Puck follow Rush and Bailey's story, and is a complete duet.",
    "numberOfPages": "441",
    "reviews": [
      {
        "userName": "Lori",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Once again heed those triggers. Boy did this book start off hard, so emotional. In this book you get more of Rush's prospective and what he is and has dealt with in his life. And everything that Bailey had to live through whether it was at the hands of Rush or her bully of a brother. I wanted to knock him over head a time or two or three. There was definitely some surprises in this book some good and some not so much. These two authors once again killed it with this book. Can I say that I absolutely fell in love with Hank. I highly highly recommend this book.",
        "stars": "5.0"
      },
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I loved this book. It had all the aspects I enjoy reading. A good back ground and characters I could relate to. Some mystery and angst. I couldn't put it down.",
        "stars": "5.0"
      },
      {
        "userName": "Shani K.",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I've said it to others, but I'll say it here too, thank heavens this was a rapid release! The way Filthy Puck ended had me all mixed up and emotional. I found myself saying \"WTF\" to the book, to the authors, and even to the characters. You know, I should have known after CBA that these two authors weren't going to hesitate to make their readers all twisted up with emotions again. But, did I say sign me up anyway? Yes, yes I did.\n\nIf you thought that Rush and Bailey were going to get a smooth or \"lighter\" road to their HEA at the end of this book, you'd be wrong. Instead, what we get is even more of a roller coaster ride where secrets come out, lies are smacked with the truth, and hash realities are shown.\n\nRush - I love him. The way he's able to come back from everything he's lived through in book one and embrace himself and who he's become is awesome. The guy has a lot of strength in him. His loyalty to his friends and those he cares about really shines through. Oh but don't let that fool you, that guy has some serious darkness to him that he brings out regularly.\n\nBailey - the epic turn for her in this book blew me away. We get two sides of the coin with her here too. She's not just the nice girl, she's got all this emotional turmoil wrapped up in her from the things she's been through now. She's not going to just take things and learns how to embrace both sides of herself too. She can be quite the volatile chick too! I love her. I love how strong she is, even if there are times she doesn't feel it.\n\nAgain, they blew me away with the fact that they included so much hockey in a seamless way in this story. It's not an afterthought or thrown in as a plot device. Instead, it's portrayed in the right way. You can tell they took t he time to do a sports romance in a way that catered to hockey romance readers.\n\nIf you like darker themes such as the ones listed at the beginning of the book (use the look inside feature on Amazon), plenty of angst, sports, spice done right, with a well-balanced plot, this is the book for you. Trust me on this, grab this duet. Read it and obsess like the rest of us! I can't wait for the next books in the series!",
        "stars": "5.0"
      },
      {
        "userName": "Alyssa G’Sell",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "✨ʙʀᴏᴋᴇɴ ᴘᴜᴄᴋ ʀᴇᴠɪᴇᴡ✨\n\n5/5⭐️\n\nBook one was emotional but this book has my head spinning……\n\nHow much can these two take….. Well your about to find out….\n\nThis book picks up right where book one left off…\n\nBailey doesn’t remember anything from the attack besides seeing a lightning bolt on the persons shoes.\n\nRush gets questioned for 2 days about everything…\n\nRush wants to see Bailey but it’s not a good time with everything going on and him and his gran leave for awhile.. He also started therapy..\n\nHe writes Bailey a letter hoping that she will actually read it. She receives the letter but doesn’t want to open it yet.\n\nEventually she does open it and she replies to him.\n\nRush writes her again to let her know that he is coming back to town and school so she isn’t blindsided but she is anyways..\n\nHer brother makes everything about him.. I didn’t like him in the first book or their mom but this book made me want to throw my kindle multiple times…\n\nRush doesn’t like the way Bailey is acting, he can tell she isn’t herself and is trying to not feel her feelings by sleeping with him and he’s not going to let her lose her self.\n\nRush sees a bruise on baileys face and wants to know wtf happened but she won’t say. He has an assumption but no proof until Nikki tells him that Bailey acted weird when she said his name…\n\nRush does something that gives Bailey her voice back and from this point on its hectic!!\n\nI love that we found out more about Hank.\nI love that Rush calls her Bug and Little Rose.\nRush is super sweet and loves this girl to death.\nI love that they have had this connection since they were 8 years old from writing the letters.\n\n“𝘠𝘰𝘶’𝘷𝘦 𝘢𝘭𝘸𝘢𝘺𝘴 𝘣𝘦𝘦𝘯 𝘮𝘺 𝘉𝘶𝘨, 𝘺𝘰𝘶 𝘣𝘦𝘤𝘢𝘮𝘦 𝘮𝘺 𝘓𝘪𝘵𝘵𝘭𝘦 𝘙𝘰𝘴𝘦, 𝘢𝘯𝘥 𝘐 𝘭𝘰𝘷𝘦𝘥 𝘺𝘰𝘶 𝘢𝘴 𝘣𝘰𝘵𝘩.”",
        "stars": "5.0"
      },
      {
        "userName": "Natasha",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "If there is one thing that L. Ann and Claire Marta always manages to excel at, it’s creating one hell of a rollercoaster of a story!\n\nBroken Puck picks up where Filthy Puck left off, therefore you’ll really want to read Filthy Puck first.\n\nFilthy Puck and Broken Puck take us on a wildly tumultuous ride of heartache, hate, anger, pain, love, and “spice” with our MMC and FMC, Rush & Bailey. From childhood pen pals to enemies and then lovers, with both of our main characters experiencing so much drama and turmoil in their lives, you won’t be able to stop reading!\n\nAnd another thing that our authors always achieve in their storytelling; you FEEL all the things! They have such an incredible way of really making you feel like you’re a part of the story.",
        "stars": "4.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B0C57KSS9L\nPublisher ‏ : ‎ Raven Ink Publishing (August 15, 2023)\nPublication date ‏ : ‎ August 15, 2023\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 3391 KB\nSimultaneous device usage ‏ : ‎ Unlimited\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Not Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 441 pages\nPage numbers source ISBN ‏ : ‎ B0CDNGTG8F"
  },
  {
    "title": "438 Days: An Extraordinary True Story of Survival at Sea",
    "cover": "https://m.media-amazon.com/images/I/51+KXksQ0SL.jpg",
    "author": "Jonathan Franklin",
    "ratingCount": "6,455 ratings",
    "ratingStarts": "4.7 out of 5 stars",
    "synopsis": "Declared “the best survival book in a decade” by Outside Magazine, 438 Days is the true story of the man who survived fourteen months in a small boat drifting seven thousand miles across the Pacific Ocean.\n\nOn November 17, 2012, two men left the coast of Mexico for a weekend fishing trip in the open Pacific. That night, a violent storm ambushed them as they were fishing eighty miles offshore. As gale force winds and ten-foot waves pummeled their small, open boat from all sides and nearly capsized them, captain Salvador Alvarenga and his crewmate cut away a two-mile-long fishing line and began a desperate dash through crashing waves as they sought the safety of port.\n\nFourteen months later, on January 30, 2014, Alvarenga, now a hairy, wild-bearded and half-mad castaway, washed ashore on a nearly deserted island on the far side of the Pacific. He could barely speak and was unable to walk. He claimed to have drifted from Mexico, a journey of some seven thousand miles.\n\nA “gripping saga,” (Daily Mail), 438 Days is the first-ever account of one of the most amazing survival stories in modern times. Based on dozens of hours of exclusive interviews with Alvarenga, his colleagues, search-and-rescue officials, the remote islanders who found him, and the medical team that saved his life, 438 Days is not only “an intense, immensely absorbing read” (Booklist) but an unforgettable study of the resilience, will, ingenuity and determination required for one man to survive more than a year lost and adrift at sea.",
    "numberOfPages": "289",
    "reviews": [
      {
        "userName": "Kindle Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "As remarkable as this story of courage in the face of deprivation is, the real story is about the challenge of the new realities of living in a changing environment where profits trump all other considerations. Millions of poor people around the world struggle everyday to find clean water and adequate food. We must stop this exploration of our resources and put an end to capitalist greed, that results in this devastation of our planet.",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Must read!!!",
        "stars": "5.0"
      },
      {
        "userName": "Briana McElroy",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "incredible story",
        "stars": "5.0"
      },
      {
        "userName": "eric w anderson",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Great story. Hard to even imagine. Painfully easy to read. A story of humanity overcoming all odds to survive. Alvarenga made it and most all would not.",
        "stars": "5.0"
      },
      {
        "userName": "Susan McCracken",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I thought it was very interesting how a person could last so long on the open ocean in a small boat",
        "stars": "4.0"
      },
      {
        "userName": "Otterprods",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "This is such a remarkable story. Based on thorough research and free of any pretentious writing style, it really captures the physical and mental struggles that Alvarenga encountered throughout his journey and beyond. It reads like an exciting novel and is the best book I've read this year (so far).",
        "stars": "5.0"
      },
      {
        "userName": "Amazon Customer",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I appreciated learning so much about the ocean while reading an engaging account of survival at sea. Worth the read.",
        "stars": "5.0"
      },
      {
        "userName": "Sun Sand + Sips",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Not only was it a great, thrilling story - I learned a lot. And if I am ever stuck at sea, I may just make it thanks to Chancha and his story. Except for my motion sickness. That may be an issue.",
        "stars": "5.0"
      }
    ],
    "details": "ASIN ‏ : ‎ B00UDCHZ3K\nPublisher ‏ : ‎ Atria Books; Reprint edition (November 17, 2015)\nPublication date ‏ : ‎ November 17, 2015\nLanguage ‏ : ‎ English\nFile size ‏ : ‎ 53174 KB\nText-to-Speech ‏ : ‎ Enabled\nScreen Reader ‏ : ‎ Supported\nEnhanced typesetting ‏ : ‎ Enabled\nX-Ray ‏ : ‎ Enabled\nWord Wise ‏ : ‎ Enabled\nSticky notes ‏ : ‎ On Kindle Scribe\nPrint length ‏ : ‎ 289 pages"
  }
]