[
  {
    "title": "Never Lie: An addictive psychological thriller",
    "author": "Freida McFadden",
    "ratingCount": "73,742 ratings",
    "ratingStarts": "4.4 out of 5 stars",
    "synopsis": "Newlyweds Tricia and Ethan are searching for the house of their dreams.But when they visit the remote manor that once belonged to Dr. Adrienne Hale, a renowned psychiatrist who vanished without a trace four years earlier, a violent winter storm traps them at the estate… with no chance of escape until the blizzard comes to an end.In search of a book to keep her entertained until the snow abates, Tricia happens upon a secret room. One that contains audio transcripts from every single patient Dr. Hale has ever interviewed. As Tricia listens to the cassette tapes, she learns about the terrifying chain of events leading up to Dr. Hale’s mysterious disappearance. Tricia plays the tapes one by one, late into the night. With each one, another shocking piece of the puzzle falls into place, and Dr. Adrienne Hale’s web of lies slowly unravels.And then Tricia reaches the final cassette. The one that reveals the entire horrifying truth.",
    "numberOfPages": "338",
    "reviews": [
      {
        "userName": "Debb H/MrsBumbles",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "\"The only way two people keep a secret is if one of them is dead\"\nI enjoyed this page turner by the skillful Freida McFadden. The setting was perfect for this suspense filled read. I was invested in the characters enough to dislike and distrust most of them lol. That was the well executed goal. Speaking of executed... Some of the people in this book enjoyed it way too much.\nI fell in love with the house where Ethan and Tricia were stranded during a storm. If the walls could talk... Oh wait!\nBy midway through I became disappointed because I thought I figured it all out, but glad to say I wasn't really even close.\nThe only negative thing I have to say is the stunning conclusion was almost too much all at once. But then I thought about real murder cases and realized it's plausible.\nThe epilogue delivers a neat \"happy ending\"... Or does it? Pick this one up and you'll be wondering about that for awhile. Another great read by Freida McFadden!",
        "stars": "4.0"
      },
      {
        "userName": "Lily",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I started this book because I’ve enjoyed several of McFadden’s books and I got a free Kindle copy of NEVER LIE.\n\nI thought this was a fun thriller. Before I go any further, I should add I didn’t go into it expecting it to be realistic fiction.\n\nA story involving a psychiatrist. Yes, please.\n\nThat psychiatrist, Adrienne Hale, vanished a few years ago, and no clues reveal what happened to her. Yes, yes!!\n\nA couple, Tricia and Ethan, newly weds, is thinking about buying this deceased doctor’s large estate and pays a visit to the property during a snow storm. The two are forced to stay put until the blizzard passes.\n\nSomething seems off from the start. A light is on upstairs, even though the realtor hasn’t arrived yet and this house is full of dust and has been unoccupied for some time. Yes, yes!! I want to know more.\n\nAnd then Tricia discovers a secret room, containing audio transcripts of Hale’s sessions with her patients. That isn’t the only secret this estate is hiding. These recorded sessions and secrets reveal clues about Hale and her disappearance.\n\nI enjoyed NEVER LIE so much, half way in, I decided to purchase a paperback version of the novel.\n\nNEVER LIE moves back and forth between the past and the present and is told from two POVs: Adrienne (the psychiatrist) and Tricia (the wife) who’s considering buying the property.\n\nTwo questions I had included:\n\n✔️ Who did it?\n\n✔️ What happened to the psychiatrist?\n\nI’m saying no more. Read it and enjoy it!",
        "stars": "4.0"
      },
      {
        "userName": "gmt",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I am a total true crime junkie; I read all the books and listen to all the podcasts. When I got about 30% done with the book, I figured out a major plot point. At around 60%, there was a pivotal moment and I figured out another major plot point. Then, around 80% in, things took a hard turn and BOOM! Everything I thought I knew was wrong! While a couple of small details were on the predictable side, the majority of the book was definitely unexpected! Loved it and can't wait to read more by this author!",
        "stars": "4.0"
      },
      {
        "userName": "Brittany",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Honestly wasn’t that interested reading the preview of the book but decided to try anyway and read it in one night, couldn’t put it down! Wanted to know what would happen next and how this story turned out, and thought I had it figured out but the ending is not at all what I expected! Too good of a twist",
        "stars": "4.0"
      },
      {
        "userName": "Gillian",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I for sure thought that the mmc was bad but who knew the fmc was worse! Then the names revealed and the whole story changed up like 😱 definitely wasn't what I thought. I found this book very thrilling and ate it up! There was unexpected turns every way. It's definitely worth it. This was definitely one of those books where you won't know what to expect. The character development was a switch up too. I loved it!",
        "stars": "5.0"
      },
      {
        "userName": "Madalyn",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "McFadden always has a way of making you THINK you know the story but QUICKLY makes sure to prove you wrong.\nI knew that too, before reading this one, and I was proven wrong again thinking I knew who the mysterious subject is.\nLoved the story! I also have big history in psychology and mental health so the perspective of a psychiatrist was fun to read!",
        "stars": "4.0"
      },
      {
        "userName": "rosa",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "Gosh this book was confusing in the best way possible. I made it towards the end and realized how many Easter eggs had been laid out from the beginning, I’m shocked at how I let small and meaningful details go unnoticed but Freida McFadden and her thrilling writing structure will do that to you. Highly recommend🌚",
        "stars": "5.0"
      },
      {
        "userName": "Katelynn",
        "avatar": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
        "comment": "I just stared getting into reading and heard good things about this book, so I decided to buy. The book is pretty good, not as good as I imagined it would be. It has a good plot and some pretty good twists but not as exciting as it was made out to be. Still recommend for a quick read.",
        "stars": "4.0"
      }
    ]
  }
]